Run by AMM on 10 Nov 2016 16:01:01





================================================================================
 1 phenotype predictions by site
================================================================================

              |                             valueall
         site |       rrr        rrs        rsr        rss        srs        sss |     Total
--------------+------------------------------------------------------------------+----------
ciprofloxacin |       304          0          2          0          1      1,072 |     1,379 
  clindamycin |       338          7          0          0         10      1,024 |     1,379 
 erythromycin |       354          6          0          0          8      1,011 |     1,379 
  fusidicacid |       151          4          0          0          3      1,221 |     1,379 
   gentamicin |        76          1          0          0          2      1,300 |     1,379 
  methicillin |       393          2          0          0          0        984 |     1,379 
    mupirocin |        15          0          0          2          0      1,362 |     1,379 
   penicillin |     1,161          3          0          0          4        211 |     1,379 
   rifampicin |        23          0          1          0          1      1,354 |     1,379 
 tetracycline |       121          4          0          0          5      1,249 |     1,379 
 trimethoprim |       175          3          1          0          1      1,199 |     1,379 
   vancomycin |         0          0          0          0          0      1,379 |     1,379 
--------------+------------------------------------------------------------------+----------
        Total |     3,111         30          4          2         35     13,366 |    16,548 

16477 out of 16548 phenotype predictions agree
99.570945
largest disagreements

         site |      Freq.     Percent        Cum.
--------------+-----------------------------------
  clindamycin |         17       23.94       23.94
 erythromycin |         14       19.72       43.66
 tetracycline |          9       12.68       56.34
  fusidicacid |          7        9.86       66.20
   penicillin |          7        9.86       76.06
 trimethoprim |          5        7.04       83.10
ciprofloxacin |          3        4.23       87.32
   gentamicin |          3        4.23       91.55
  methicillin |          2        2.82       94.37
    mupirocin |          2        2.82       97.18
   rifampicin |          2        2.82      100.00
--------------+-----------------------------------
        Total |         71      100.00

              |                  valueall
         site |       rrs        rsr        rss        srs |     Total
--------------+--------------------------------------------+----------
ciprofloxacin |         0          2          0          1 |         3 
  clindamycin |         7          0          0         10 |        17 
 erythromycin |         6          0          0          8 |        14 
  fusidicacid |         4          0          0          3 |         7 
   gentamicin |         1          0          0          2 |         3 
  methicillin |         2          0          0          0 |         2 
    mupirocin |         0          0          2          0 |         2 
   penicillin |         3          0          0          4 |         7 
   rifampicin |         0          1          0          1 |         2 
 tetracycline |         4          0          0          5 |         9 
 trimethoprim |         3          1          0          1 |         5 
--------------+--------------------------------------------+----------
        Total |        30          4          2         35 |        71 

35 out of 35mykrobe overcall
.21150592
30 out of 30typewriter undercall
.18129079
 make bar chart of which methods differ on which antibiotic

              |                             valueall
         site |       rrr        rrs        rsr        rss        srs        sss |     Total
--------------+------------------------------------------------------------------+----------
ciprofloxacin |       304          0          2          0          1      1,072 |     1,379 
  clindamycin |       338          7          0          0         10      1,024 |     1,379 
 erythromycin |       354          6          0          0          8      1,011 |     1,379 
  fusidicacid |       151          4          0          0          3      1,221 |     1,379 
   gentamicin |        76          1          0          0          2      1,300 |     1,379 
  methicillin |       393          2          0          0          0        984 |     1,379 
    mupirocin |        15          0          0          2          0      1,362 |     1,379 
   penicillin |     1,161          3          0          0          4        211 |     1,379 
   rifampicin |        23          0          1          0          1      1,354 |     1,379 
 tetracycline |       121          4          0          0          5      1,249 |     1,379 
 trimethoprim |       175          3          1          0          1      1,199 |     1,379 
   vancomycin |         0          0          0          0          0      1,379 |     1,379 
--------------+------------------------------------------------------------------+----------
        Total |     3,111         30          4          2         35     13,366 |    16,548 






================================================================================
 2 phenotype predictions compared to gold standard
================================================================================

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
         I |         6          0          0          0          0         74 |        80 
        NA |       288          8          0          0          9      1,699 |     2,004 
         R |     2,720          9          3          0          4         89 |     2,825 
         S |        97         13          1          2         22     11,504 |    11,639 
-----------+------------------------------------------------------------------+----------
     Total |     3,111         30          4          2         35     13,366 |    16,548 


goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
         R |     2,720          9          3          0          4         89 |     2,825 
         S |        97         13          1          2         22     11,504 |    11,639 
-----------+------------------------------------------------------------------+----------
     Total |     2,817         22          4          2         26     11,593 |    14,464 

14224 out of 14464results agree between all methods and gold standard
98.340708
disagreements by site

----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = R

              |                        valueall
         site |       rrr        rrs        rsr        srs        sss |     Total
--------------+-------------------------------------------------------+----------
ciprofloxacin |       299          0          2          0         15 |       316 
  clindamycin |       180          0          0          0          5 |       185 
 erythromycin |       342          0          0          0          6 |       348 
  fusidicacid |       144          3          0          2         13 |       162 
   gentamicin |        73          1          0          1         19 |        94 
  methicillin |       381          2          0          0          8 |       391 
    mupirocin |         6          0          0          0          0 |         6 
   penicillin |     1,124          2          0          1         10 |     1,137 
   rifampicin |        22          0          1          0          2 |        25 
 tetracycline |       112          1          0          0          5 |       118 
 trimethoprim |        37          0          0          0          6 |        43 
--------------+-------------------------------------------------------+----------
        Total |     2,720          9          3          4         89 |     2,825 


----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = S

              |                             valueall
         site |       rrr        rrs        rsr        rss        srs        sss |     Total
--------------+------------------------------------------------------------------+----------
ciprofloxacin |         4          0          0          0          1      1,031 |     1,036 
  clindamycin |        22          2          0          0          2        253 |       279 
 erythromycin |        11          6          0          0          8        999 |     1,024 
  fusidicacid |         7          1          0          0          1      1,202 |     1,211 
   gentamicin |         3          0          0          0          1      1,275 |     1,279 
  methicillin |         5          0          0          0          0        957 |       962 
    mupirocin |         6          0          0          2          0      1,007 |     1,015 
   penicillin |        32          1          0          0          3        196 |       232 
   rifampicin |         1          0          0          0          1      1,345 |     1,347 
 tetracycline |         6          3          0          0          5      1,240 |     1,254 
 trimethoprim |         0          0          1          0          0        626 |       627 
   vancomycin |         0          0          0          0          0      1,373 |     1,373 
--------------+------------------------------------------------------------------+----------
        Total |        97         13          1          2         22     11,504 |    11,639 







================================================================================
 3 find sensitivity and specifity of each method/antibiotic
================================================================================
restrict to sites with clear gold standard values only
14464 results are R/S
Typewriter
vancomycin has no positive samples

     +---------------------------------------------------------------------------------+
     |          site   sensit~y   specif~y      lsens      usens      lspec      uspec |
     |---------------------------------------------------------------------------------|
  1. | ciprofloxacin   .9525316    .996139   .9229159   .9731923    .990144    .998947 |
  2. |   clindamycin    .972973   .9211469    .938058   .9911674   .8830481    .949925 |
  3. |  erythromycin   .9827586   .9892578   .9628524   .9936471   .9808607   .9946257 |
  4. |   fusidicacid   .8888889   .9942197   .8300889   .9328041   .9881268   .9976729 |
  5. |    gentamicin   .7765958   .9976544   .6790029   .8560738   .9931607    .999516 |
     |---------------------------------------------------------------------------------|
  6. |   methicillin   .9744245   .9948025   .9534699   .9876689   .9879128   .9983103 |
  7. |     mupirocin          1   .9940886   .5407419          1   .9871782   .9978276 |
  8. |    penicillin   .9885664    .862069   .9805276   .9938985   .8108956   .9037048 |
  9. |    rifampicin        .92   .9992576   .7396942   .9901604   .9958706   .9999812 |
 10. |  tetracycline   .9491525   .9952153   .8926097   .9811139    .989615   .9982421 |
     |---------------------------------------------------------------------------------|
 11. |  trimethoprim   .8604651   .9984051   .7206752   .9470235   .9911461   .9999596 |
 12. |    vancomycin          .          1          .          .   .9973169          1 |
     +---------------------------------------------------------------------------------+
restrict to sites with clear gold standard values only
14464 results are R/S
Genefinder
vancomycin has no positive samples

     +---------------------------------------------------------------------------------+
     |          site   sensit~y   specif~y      lsens      usens      lspec      uspec |
     |---------------------------------------------------------------------------------|
  1. | ciprofloxacin   .9525316    .996139   .9229159   .9731923    .990144    .998947 |
  2. |   clindamycin    .972973   .9139785    .938058   .9911674   .8747111   .9441066 |
  3. |  erythromycin   .9827586   .9833984   .9628524   .9936471    .973552      .9903 |
  4. |   fusidicacid   .9074074   .9933939   .8518829   .9472466    .987025   .9971437 |
  5. |    gentamicin   .7872341   .9976544   .6907066   .8649268   .9931607    .999516 |
     |---------------------------------------------------------------------------------|
  6. |   methicillin   .9795396   .9948025   .9600844   .9911263   .9879128   .9983103 |
  7. |     mupirocin          1   .9921182   .5407419          1   .9845291   .9965913 |
  8. |    penicillin   .9903254   .8577586   .9827555   .9951609    .806078   .9000219 |
  9. |    rifampicin        .92   .9992576   .7396942   .9901604   .9958706   .9999812 |
 10. |  tetracycline   .9576271   .9928229   .9038842   .9861006   .9864197   .9967131 |
     |---------------------------------------------------------------------------------|
 11. |  trimethoprim   .8604651   .9984051   .7206752   .9470235   .9911461   .9999596 |
 12. |    vancomycin          .          1          .          .   .9973169          1 |
     +---------------------------------------------------------------------------------+
restrict to sites with clear gold standard values only
14464 results are R/S
Mykrobe
vancomycin has no positive samples

     +---------------------------------------------------------------------------------+
     |          site   sensit~y   specif~y      lsens      usens      lspec      uspec |
     |---------------------------------------------------------------------------------|
  1. | ciprofloxacin   .9462025   .9951738   .9152605   .9683523   .9887733   .9984311 |
  2. |   clindamycin    .972973     .90681    .938058   .9911674   .8664392   .9382196 |
  3. |  erythromycin   .9827586   .9755859   .9628524   .9936471   .9641699   .9841396 |
  4. |   fusidicacid   .9197531   .9925681   .8666846   .9565803   .9859391   .9965962 |
  5. |    gentamicin   .7978724   .9968725   .7024887   .8736973    .992012   .9991472 |
     |---------------------------------------------------------------------------------|
  6. |   methicillin   .9795396   .9948025   .9600844   .9911263   .9879128   .9983103 |
  7. |     mupirocin          1   .9940886   .5407419          1   .9871782   .9978276 |
  8. |    penicillin   .9912049   .8448276   .9838852   .9957746   .7917048   .8888914 |
  9. |    rifampicin        .88   .9985152   .6878097   .9745346   .9946468   .9998201 |
 10. |  tetracycline   .9576271   .9888358   .9038842   .9861006   .9813391   .9938833 |
     |---------------------------------------------------------------------------------|
 11. |  trimethoprim   .8604651          1   .7206752   .9470235   .9941339          1 |
 12. |    vancomycin          .          1          .          .   .9973169          1 |
     +---------------------------------------------------------------------------------+
all methods
14464 results are R/S
14464 results are R/S
14464 results are R/S

     +-----------------------------------------------------------------------------+
     |    method   sensit~y      lsens      usens   specif~y      lspec      uspec |
     |-----------------------------------------------------------------------------|
  1. |    valuez   .9674336   .9602083   .9736679   .9886588    .986565   .9905025 |
  2. | valuetype   .9638938   .9563399   .9704657     .99158   .9897482   .9931591 |
  3. | valuegene   .9670796   .9598206   .9733485   .9902912   .9883389   .9919921 |
     +-----------------------------------------------------------------------------+
results for rifamcipin (site: rpob)
Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)

goldstanda |                  valueall
        rd |       rrr        rsr        srs        sss |     Total
-----------+--------------------------------------------+----------
         I |         0          0          0          1 |         1 
        NA |         0          0          0          6 |         6 
         R |        22          1          0          2 |        25 
         S |         1          0          1      1,345 |     1,347 
-----------+--------------------------------------------+----------
     Total |        23          1          1      1,354 |     1,379 

results for fusidic acid: fusb, fusc, fusa
Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)

goldstanda |                  valueall
        rd |       rrr        rrs        srs        sss |     Total
-----------+--------------------------------------------+----------
        NA |         0          0          0          6 |         6 
         R |       144          3          2         13 |       162 
         S |         7          1          1      1,202 |     1,211 
-----------+--------------------------------------------+----------
     Total |       151          4          3      1,221 |     1,379 


               |                  ValueAll
          site |       AAA        APA        APP        PPP |     Total
---------------+--------------------------------------------+----------
          fusa |     1,320          0          2         57 |     1,379 
          fusb |     1,355          2          0         22 |     1,379 
          fusc |     1,302          1          2         74 |     1,379 
---------------+--------------------------------------------+----------
         Total |     3,977          3          4        153 |     4,137 


                  |           goldstandard
              ABC |        NA          R          S |     Total
------------------+---------------------------------+----------
A:AAA,B:AAA,C:AAA |         6         13      1,202 |     1,221 
A:AAA,B:AAA,C:APA |         0          1          0 |         1 
A:AAA,B:AAA,C:APP |         0          2          0 |         2 
A:AAA,B:AAA,C:PPP |         0         73          1 |        74 
A:AAA,B:APA,C:AAA |         0          1          1 |         2 
A:AAA,B:PPP,C:AAA |         0         18          2 |        20 
A:APP,B:AAA,C:AAA |         0          1          1 |         2 
A:PPP,B:AAA,C:AAA |         0         51          4 |        55 
A:PPP,B:PPP,C:AAA |         0          2          0 |         2 
------------------+---------------------------------+----------
            Total |         6        162      1,211 |     1,379 

for resistant samples

                  |       zam value
              ABC |         r          s |     Total
------------------+----------------------+----------
A:AAA,B:AAA,C:AAA |         0         13 |        13 
A:AAA,B:AAA,C:APA |         1          0 |         1 
A:AAA,B:AAA,C:APP |         2          0 |         2 
A:AAA,B:AAA,C:PPP |        73          0 |        73 
A:AAA,B:APA,C:AAA |         1          0 |         1 
A:AAA,B:PPP,C:AAA |        18          0 |        18 
A:APP,B:AAA,C:AAA |         1          0 |         1 
A:PPP,B:AAA,C:AAA |        51          0 |        51 
A:PPP,B:PPP,C:AAA |         2          0 |         2 
------------------+----------------------+----------
            Total |       149         13 |       162 

results for penicillin: meca, mecc, blaz
Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)

goldstanda |                  valueall
        rd |       rrr        rrs        srs        sss |     Total
-----------+--------------------------------------------+----------
         I |         1          0          0          4 |         5 
        NA |         4          0          0          1 |         5 
         R |     1,124          2          1         10 |     1,137 
         S |        32          1          3        196 |       232 
-----------+--------------------------------------------+----------
     Total |     1,161          3          4        211 |     1,379 


               |                        ValueAll
          site |       AAA        APA        APP        PPA        PPP |     Total
---------------+-------------------------------------------------------+----------
          blaz |       222         19          7          1      1,130 |     1,379 
          meca |       999          1          2          0        377 |     1,379 
          mecc |     1,362          0          0          0         17 |     1,379 
---------------+-------------------------------------------------------+----------
         Total |     2,583         20          9          1      1,524 |     4,137 


                  |                goldstandard
              ABC |         I         NA          R          S |     Total
------------------+--------------------------------------------+----------
A:AAA,C:AAA,Z:AAA |         4          1         10        196 |       211 
A:AAA,C:AAA,Z:APA |         0          0          1          3 |         4 
A:AAA,C:AAA,Z:APP |         0          0          2          1 |         3 
A:AAA,C:AAA,Z:PPP |         1          1        733         31 |       766 
A:AAA,C:PPP,Z:APA |         0          0         15          0 |        15 
A:APA,C:PPP,Z:APP |         0          0          1          0 |         1 
A:APP,C:AAA,Z:PPP |         0          0          2          0 |         2 
A:PPP,C:AAA,Z:AAA |         0          0         11          0 |        11 
A:PPP,C:AAA,Z:APP |         0          0          2          1 |         3 
A:PPP,C:AAA,Z:PPA |         0          0          1          0 |         1 
A:PPP,C:AAA,Z:PPP |         0          3        358          0 |       361 
A:PPP,C:PPP,Z:PPP |         0          0          1          0 |         1 
------------------+--------------------------------------------+----------
            Total |         5          5      1,137        232 |     1,379 

for resistant samples

                  |       zam value
              ABC |         r          s |     Total
------------------+----------------------+----------
A:AAA,C:AAA,Z:AAA |         0         10 |        10 
A:AAA,C:AAA,Z:APA |         1          0 |         1 
A:AAA,C:AAA,Z:APP |         2          0 |         2 
A:AAA,C:AAA,Z:PPP |       733          0 |       733 
A:AAA,C:PPP,Z:APA |        15          0 |        15 
A:APA,C:PPP,Z:APP |         1          0 |         1 
A:APP,C:AAA,Z:PPP |         2          0 |         2 
A:PPP,C:AAA,Z:AAA |        11          0 |        11 
A:PPP,C:AAA,Z:APP |         2          0 |         2 
A:PPP,C:AAA,Z:PPA |         1          0 |         1 
A:PPP,C:AAA,Z:PPP |       358          0 |       358 
A:PPP,C:PPP,Z:PPP |         1          0 |         1 
------------------+----------------------+----------
            Total |     1,127         10 |     1,137 

results for ciprofloxin: fusb, fusc, fusa
Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)

goldstanda |                  valueall
        rd |       rrr        rsr        srs        sss |     Total
-----------+--------------------------------------------+----------
         I |         1          0          0         20 |        21 
        NA |         0          0          0          6 |         6 
         R |       299          2          0         15 |       316 
         S |         4          0          1      1,031 |     1,036 
-----------+--------------------------------------------+----------
     Total |       304          2          1      1,072 |     1,379 


               |                  ValueAll
          site |       AAA        APA        PAP        PPP |     Total
---------------+--------------------------------------------+----------
     grla/gyra |     1,072          1          2        304 |     1,379 
---------------+--------------------------------------------+----------
         Total |     1,072          1          2        304 |     1,379 


           |                goldstandard
  ValueAll |         I         NA          R          S |     Total
-----------+--------------------------------------------+----------
       AAA |        20          6         15      1,031 |     1,072 
       APA |         0          0          0          1 |         1 
       PAP |         0          0          2          0 |         2 
       PPP |         1          0        299          4 |       304 
-----------+--------------------------------------------+----------
     Total |        21          6        316      1,036 |     1,379 

for resistant samples

           |       zam value
  ValueAll |         r          s |     Total
-----------+----------------------+----------
       AAA |         0         15 |        15 
       PAP |         0          2 |         2 
       PPP |       299          0 |       299 
-----------+----------------------+----------
     Total |       299         17 |       316 

results for erthytomycin: msta, mphc, erma, ermb, ermc, ermt, ermy
Recall order is  Typewriter Mykrobe Genefinder (lower case) Gold (uppercase)

goldstanda |                  valueall
        rd |       rrr        rrs        srs        sss |     Total
-----------+--------------------------------------------+----------
         I |         0          0          0          1 |         1 
        NA |         1          0          0          5 |         6 
         R |       342          0          0          6 |       348 
         S |        11          6          8        999 |     1,024 
-----------+--------------------------------------------+----------
     Total |       354          6          8      1,011 |     1,379 


               |                  ValueAll
          site |       AAA        APA        APP        PPP |     Total
---------------+--------------------------------------------+----------
          erma |     1,229          1          5        144 |     1,379 
          ermb |     1,375          1          0          3 |     1,379 
          ermc |     1,191         10          2        176 |     1,379 
          ermt |     1,359          0          0         20 |     1,379 
          ermy |     1,379          0          0          0 |     1,379 
          mphc |     1,361          1          0         17 |     1,379 
          msra |     1,360          1          0         18 |     1,379 
---------------+--------------------------------------------+----------
         Total |     9,254         14          7        378 |     9,653 


                      |                goldstandard
                  ABC |         I         NA          R          S |     Total
----------------------+--------------------------------------------+----------
a:AAA,B:AAA,C:AAA,T.. |         1          5          6        999 |     1,011 
a:AAA,B:AAA,C:AAA,T.. |         0          0          1          0 |         1 
a:AAA,B:AAA,C:AAA,T.. |         0          0         11          1 |        12 
a:AAA,B:AAA,C:AAA,T.. |         0          0         19          0 |        19 
a:AAA,B:AAA,C:APA,T.. |         0          0          0          7 |         7 
a:AAA,B:AAA,C:APA,T.. |         0          0          0          1 |         1 
a:AAA,B:AAA,C:APA,T.. |         0          0          1          0 |         1 
a:AAA,B:AAA,C:APP,T.. |         0          0          0          2 |         2 
a:AAA,B:AAA,C:PPP,T.. |         0          0        161          6 |       167 
a:AAA,B:AAA,C:PPP,T.. |         0          0          0          1 |         1 
a:AAA,B:AAA,C:PPP,T.. |         0          0          3          0 |         3 
a:AAA,B:APA,C:AAA,T.. |         0          0          0          1 |         1 
a:AAA,B:PPP,C:AAA,T.. |         0          0          3          0 |         3 
a:APA,B:AAA,C:AAA,T.. |         0          0          1          0 |         1 
a:APP,B:AAA,C:AAA,T.. |         0          0          0          4 |         4 
a:APP,B:AAA,C:AAA,T.. |         0          0          1          0 |         1 
a:PPP,B:AAA,C:AAA,T.. |         0          1        135          2 |       138 
a:PPP,B:AAA,C:APA,T.. |         0          0          1          0 |         1 
a:PPP,B:AAA,C:PPP,T.. |         0          0          5          0 |         5 
----------------------+--------------------------------------------+----------
                Total |         1          6        348      1,024 |     1,379 

drop those with complete agreement on all sites and with gold
resistant gold

     +-------------------------------------------------------------------+
     |              sample                                           ABC |
     |-------------------------------------------------------------------|
  1. |           C00001147   a:AAA,B:AAA,C:AAA,T:AAA,Y:AAA,M1:AAA,M2:AAA |
  2. |           C00001162   a:AAA,B:AAA,C:AAA,T:AAA,Y:AAA,M1:AAA,M2:AAA |
  3. |           C00001224   a:AAA,B:AAA,C:AAA,T:AAA,Y:AAA,M1:AAA,M2:AAA |
  4. |           C00003420   a:AAA,B:AAA,C:AAA,T:AAA,Y:AAA,M1:AAA,M2:AAA |
  5. | H071160354-264-B1-2   a:AAA,B:AAA,C:AAA,T:AAA,Y:AAA,M1:AAA,M2:AAA |
     |-------------------------------------------------------------------|
  9. |    H123100270-554-1   a:AAA,B:AAA,C:AAA,T:AAA,Y:AAA,M1:AAA,M2:AAA |
     +-------------------------------------------------------------------+
sensitive gold
. use viru_panel_all, clear

. 
. 
. 
. ******************************************************

. 
. noi di _n(5) _dup(80) "=" _n " 1 virulence predictions by site" _n _dup(80) "="





================================================================================
 1 virulence predictions by site
================================================================================

. 
. 
. 
. 
. 
. noi tab site valuea, m

              |                        valueall
         site |       aaa        apa        app        ppa        ppp |     Total
--------------+-------------------------------------------------------+----------
          eta |     1,338          1          0          0         40 |     1,379 
          etb |     1,372          1          0          1          5 |     1,379 
          etd |     1,320          1          0          1         57 |     1,379 
         meca |       999          1          0          2        377 |     1,379 
         mecc |     1,362          0          0          0         17 |     1,379 
          pvl |     1,266          3          0          1        109 |     1,379 
          sea |     1,080          1          0          3        295 |     1,379 
          seb |     1,267          1          0          2        109 |     1,379 
          sec |     1,149          1          0          4        225 |     1,379 
          sed |     1,313          0          0          0         66 |     1,379 
          see |     1,375          0          0          0          4 |     1,379 
          seg |       600          6          0         20        753 |     1,379 
          seh |     1,241          2          0          2        134 |     1,379 
          sei |       596          3          6         33        741 |     1,379 
          sej |     1,310          0          0          0         69 |     1,379 
         selr |     1,312          0          0          0         67 |     1,379 
          sep |     1,268          0          1          2        108 |     1,379 
          seu |       595          2          0         57        725 |     1,379 
        tsst1 |     1,119          1          0          4        255 |     1,379 
--------------+-------------------------------------------------------+----------
        Total |    21,882         24          7        132      4,156 |    26,201 


. 
. gen agree  = (valuea=="ppp"| valuea=="a" )

. 
. summ agree

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |     26,201    .1586199    .3653282          0          1

. 
. noi di r(sum) " out of " r(N) " virulence predictions agree"
4156 out of 26201 virulence predictions agree

. 
. noi di r(sum)/_N*100
15.86199

. 
. 
. 
. noi di "largest disagreements"
largest disagreements

. 
. noi tab site if agree!=1, sort

         site |      Freq.     Percent        Cum.
--------------+-----------------------------------
          see |      1,375        6.24        6.24
          etb |      1,374        6.23       12.47
         mecc |      1,362        6.18       18.65
          eta |      1,339        6.07       24.72
          etd |      1,322        6.00       30.72
          sed |      1,313        5.96       36.67
         selr |      1,312        5.95       42.63
          sej |      1,310        5.94       48.57
          sep |      1,271        5.77       54.33
          pvl |      1,270        5.76       60.10
          seb |      1,270        5.76       65.86
          seh |      1,245        5.65       71.50
          sec |      1,154        5.23       76.74
        tsst1 |      1,124        5.10       81.84
          sea |      1,084        4.92       86.75
         meca |      1,002        4.55       91.30
          seu |        654        2.97       94.27
          sei |        638        2.89       97.16
          seg |        626        2.84      100.00
--------------+-----------------------------------
        Total |     22,045      100.00

. 
. noi tab site valuea if agree!=1

              |                  valueall
         site |       aaa        apa        app        ppa |     Total
--------------+--------------------------------------------+----------
          eta |     1,338          1          0          0 |     1,339 
          etb |     1,372          1          0          1 |     1,374 
          etd |     1,320          1          0          1 |     1,322 
         meca |       999          1          0          2 |     1,002 
         mecc |     1,362          0          0          0 |     1,362 
          pvl |     1,266          3          0          1 |     1,270 
          sea |     1,080          1          0          3 |     1,084 
          seb |     1,267          1          0          2 |     1,270 
          sec |     1,149          1          0          4 |     1,154 
          sed |     1,313          0          0          0 |     1,313 
          see |     1,375          0          0          0 |     1,375 
          seg |       600          6          0         20 |       626 
          seh |     1,241          2          0          2 |     1,245 
          sei |       596          3          6         33 |       638 
          sej |     1,310          0          0          0 |     1,310 
         selr |     1,312          0          0          0 |     1,312 
          sep |     1,268          0          1          2 |     1,271 
          seu |       595          2          0         57 |       654 
        tsst1 |     1,119          1          0          4 |     1,124 
--------------+--------------------------------------------+----------
        Total |    21,882         24          7        132 |    22,045 


. 
. gen t_undercall = 1 if valuea=="ppa"
(26,069 missing values generated)

. 
. summ t_undercall

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 t_undercall |        132           1           0          1          1

. 
. noi di r(sum) " out of " r(N) "typewriter undercall"
132 out of 132typewriter undercall

. 
. noi di r(sum)/_N*100
.50379756

. drop t

. 
. gen t_undercall = (valuea=="ppa")

. 
. summ t_undercall

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 t_undercall |     26,201     .005038     .070801          0          1

. 
. noi di r(sum) " out of " r(N) "typewriter undercall"
132 out of 26201typewriter undercall

. 
. noi di r(sum)/_N*100
.50379756

. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. 
. run Analysis_Pipeline3.do
