Run by AMM on 10 Nov 2016 18:18:00





================================================================================
 1 virulence predictions by site
================================================================================

              |                        valueall
         site |       aaa        apa        app        ppa        ppp |     Total
--------------+-------------------------------------------------------+----------
          eta |     1,338          1          0          0         40 |     1,379 
          etb |     1,372          1          0          1          5 |     1,379 
          etd |     1,320          1          0          1         57 |     1,379 
         meca |       999          1          0          2        377 |     1,379 
         mecc |     1,362          0          0          0         17 |     1,379 
          pvl |     1,266          3          0          1        109 |     1,379 
          sea |     1,080          1          0          3        295 |     1,379 
          seb |     1,267          1          0          2        109 |     1,379 
          sec |     1,149          1          0          4        225 |     1,379 
          sed |     1,313          0          0          0         66 |     1,379 
          see |     1,375          0          0          0          4 |     1,379 
          seg |       600          6          0         20        753 |     1,379 
          seh |     1,241          2          0          2        134 |     1,379 
          sei |       596          3          6         33        741 |     1,379 
          sej |     1,310          0          0          0         69 |     1,379 
         selr |     1,312          0          0          0         67 |     1,379 
          sep |     1,268          0          1          2        108 |     1,379 
          seu |       595          2          0         57        725 |     1,379 
        tsst1 |     1,119          1          0          4        255 |     1,379 
--------------+-------------------------------------------------------+----------
        Total |    21,882         24          7        132      4,156 |    26,201 

26038 out of 26201 virulence predictions agree
99.377886
largest disagreements

         site |      Freq.     Percent        Cum.
--------------+-----------------------------------
          seu |         59       36.20       36.20
          sei |         42       25.77       61.96
          seg |         26       15.95       77.91
          sec |          5        3.07       80.98
        tsst1 |          5        3.07       84.05
          pvl |          4        2.45       86.50
          sea |          4        2.45       88.96
          seh |          4        2.45       91.41
         meca |          3        1.84       93.25
          seb |          3        1.84       95.09
          sep |          3        1.84       96.93
          etb |          2        1.23       98.16
          etd |          2        1.23       99.39
          eta |          1        0.61      100.00
--------------+-----------------------------------
        Total |        163      100.00

              |             valueall
         site |       apa        app        ppa |     Total
--------------+---------------------------------+----------
          eta |         1          0          0 |         1 
          etb |         1          0          1 |         2 
          etd |         1          0          1 |         2 
         meca |         1          0          2 |         3 
          pvl |         3          0          1 |         4 
          sea |         1          0          3 |         4 
          seb |         1          0          2 |         3 
          sec |         1          0          4 |         5 
          seg |         6          0         20 |        26 
          seh |         2          0          2 |         4 
          sei |         3          6         33 |        42 
          sep |         0          1          2 |         3 
          seu |         2          0         57 |        59 
        tsst1 |         1          0          4 |         5 
--------------+---------------------------------+----------
        Total |        24          7        132 |       163 

132 out of 26201typewriter undercall
.50379756
 make bar chart of which methods differ on which virulence factor





================================================================================
 2 phenotype predictions compared to gold standard
================================================================================
overall results

goldstanda |                        valueall
        rd |       aaa        apa        app        ppa        ppp |     Total
-----------+-------------------------------------------------------+----------
         A |     3,362         10          0         17         82 |     3,471 
        NA |    18,506         12          7        105      3,456 |    22,086 
         P |        14          2          0         10        618 |       644 
-----------+-------------------------------------------------------+----------
     Total |    21,882         24          7        132      4,156 |    26,201 

results by site

              |                        valueall
         site |       aaa        apa        app        ppa        ppp |     Total
--------------+-------------------------------------------------------+----------
          eta |     1,338          1          0          0         40 |     1,379 
          etb |     1,372          1          0          1          5 |     1,379 
          etd |     1,320          1          0          1         57 |     1,379 
         meca |       999          1          0          2        377 |     1,379 
         mecc |     1,362          0          0          0         17 |     1,379 
          pvl |     1,266          3          0          1        109 |     1,379 
          sea |     1,080          1          0          3        295 |     1,379 
          seb |     1,267          1          0          2        109 |     1,379 
          sec |     1,149          1          0          4        225 |     1,379 
          sed |     1,313          0          0          0         66 |     1,379 
          see |     1,375          0          0          0          4 |     1,379 
          seg |       600          6          0         20        753 |     1,379 
          seh |     1,241          2          0          2        134 |     1,379 
          sei |       596          3          6         33        741 |     1,379 
          sej |     1,310          0          0          0         69 |     1,379 
         selr |     1,312          0          0          0         67 |     1,379 
          sep |     1,268          0          1          2        108 |     1,379 
          seu |       595          2          0         57        725 |     1,379 
        tsst1 |     1,119          1          0          4        255 |     1,379 
--------------+-------------------------------------------------------+----------
        Total |    21,882         24          7        132      4,156 |    26,201 

comparision to clear gold value results

goldstanda |                  valueall
        rd |       aaa        apa        ppa        ppp |     Total
-----------+--------------------------------------------+----------
         A |     3,362         10         17         82 |     3,471 
         P |        14          2         10        618 |       644 
-----------+--------------------------------------------+----------
     Total |     3,376         12         27        700 |     4,115 

3980 out of 4115results agree between all methods and gold standard
96.71932
disagreements by site

----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = A

              |                  valueall
         site |       aaa        apa        ppa        ppp |     Total
--------------+--------------------------------------------+----------
          eta |       187          1          0          0 |       188 
          etb |       202          0          1          0 |       203 
          etd |       192          1          0          0 |       193 
         meca |       175          1          0          1 |       177 
         mecc |       155          0          0          0 |       155 
          pvl |       237          2          0          0 |       239 
          sea |       163          0          1          1 |       165 
          seb |       183          1          0          1 |       185 
          sec |       174          1          1          1 |       177 
          sed |       189          0          0          0 |       189 
          see |       202          0          0          0 |       202 
          seg |       126          1          1          0 |       128 
          seh |       177          1          0          1 |       179 
          sei |       126          0          1          0 |       127 
          sej |       185          0          0          0 |       185 
         selr |       186          0          0         19 |       205 
          sep |       194          0          0         11 |       205 
          seu |       126          0         11         47 |       184 
        tsst1 |       183          1          1          0 |       185 
--------------+--------------------------------------------+----------
        Total |     3,362         10         17         82 |     3,471 


----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = P

              |                  valueall
         site |       aaa        apa        ppa        ppp |     Total
--------------+--------------------------------------------+----------
          eta |         0          0          0         18 |        18 
          etb |         0          0          0          3 |         3 
          etd |         0          0          0         13 |        13 
         meca |         0          0          1        150 |       151 
         mecc |         0          0          0         13 |        13 
          pvl |         3          1          0         91 |        95 
          sea |         3          0          0         37 |        40 
          seb |         0          0          0         20 |        20 
          sec |         1          0          0         27 |        28 
          sed |         0          0          0         16 |        16 
          see |         0          0          0          3 |         3 
          seg |         1          0          0         76 |        77 
          seh |         2          0          0         24 |        26 
          sei |         3          1          6         68 |        78 
          sej |         1          0          0         19 |        20 
          seu |         0          0          3         18 |        21 
        tsst1 |         0          0          0         22 |        22 
--------------+--------------------------------------------+----------
        Total |        14          2         10        618 |       644 







================================================================================
 3 find sensitivity and specifity of each method/antibiotic
================================================================================
restrict to sites with clear gold standard values only
4115 results are P/A
Typewriter
selr has no positive samples
sep has no positive samples

     +-------------------------------------------------------------------------+
     |  site   sensit~y   specif~y      lsens      usens      lspec      uspec |
     |-------------------------------------------------------------------------|
  1. |   eta          1          1    .814698          1   .9805695          1 |
  2. |   etb          1          1   .2924018          1   .9819923          1 |
  3. |   etd          1          1   .7529474          1   .9810681          1 |
  4. |  meca   .9933775   .9943503   .9636555   .9998323   .9689253   .9998569 |
  5. |  mecc          1          1   .7529474          1   .9764817          1 |
     |-------------------------------------------------------------------------|
  6. |   pvl   .9578947          1   .8956916   .9884104   .9846839          1 |
  7. |   sea       .925   .9939394   .7961352   .9842578   .9666966   .9998466 |
  8. |   seb          1   .9945946   .8315665          1   .9702525   .9998631 |
  9. |   sec   .9642857   .9943503   .8165224   .9990962   .9689253   .9998569 |
 10. |   sed          1          1   .7940928          1   .9806713          1 |
     |-------------------------------------------------------------------------|
 11. |   see          1          1   .2924018          1    .981904          1 |
 12. |   seg    .987013          1   .9297529   .9996713   .9715919          1 |
 13. |   seh   .9230769   .9944134   .7486971   .9905446   .9692681   .9998586 |
 14. |   sei   .8717949          1   .7768378   .9367723   .9713715          1 |
 15. |   sej        .95          1   .7512673   .9987349   .9802576          1 |
     |-------------------------------------------------------------------------|
 16. |  selr          .   .9073171          .          .   .8590496   .9432732 |
 17. |   sep          .   .9463415          .          .   .9060199   .9729128 |
 18. |   seu   .8571429   .7445652    .636576    .969511   .6751918   .8058804 |
 19. | tsst1          1          1   .8456275          1   .9802576          1 |
     +-------------------------------------------------------------------------+
restrict to sites with clear gold standard values only
4115 results are P/A
Genefinder
selr has no positive samples
sep has no positive samples

     +-------------------------------------------------------------------------+
     |  site   sensit~y   specif~y      lsens      usens      lspec      uspec |
     |-------------------------------------------------------------------------|
  1. |   eta          1          1    .814698          1   .9805695          1 |
  2. |   etb          1   .9950739   .2924018          1   .9728606   .9998753 |
  3. |   etd          1          1   .7529474          1   .9810681          1 |
  4. |  meca          1   .9943503   .9758663          1   .9689253   .9998569 |
  5. |  mecc          1          1   .7529474          1   .9764817          1 |
     |-------------------------------------------------------------------------|
  6. |   pvl   .9578947          1   .8956916   .9884104   .9846839          1 |
  7. |   sea       .925   .9878788   .7961352   .9842578   .9569018   .9985287 |
  8. |   seb          1   .9945946   .8315665          1   .9702525   .9998631 |
  9. |   sec   .9642857   .9887006   .8165224   .9990962   .9597806   .9986286 |
 10. |   sed          1          1   .7940928          1   .9806713          1 |
     |-------------------------------------------------------------------------|
 11. |   see          1          1   .2924018          1    .981904          1 |
 12. |   seg    .987013   .9921875   .9297529   .9996713   .9572409   .9998022 |
 13. |   seh   .9230769   .9944134   .7486971   .9905446   .9692681   .9998586 |
 14. |   sei    .948718    .992126   .8738724   .9858525   .9569103   .9998007 |
 15. |   sej        .95          1   .7512673   .9987349   .9802576          1 |
     |-------------------------------------------------------------------------|
 16. |  selr          .   .9073171          .          .   .8590496   .9432732 |
 17. |   sep          .   .9463415          .          .   .9060199   .9729128 |
 18. |   seu          1   .6847826   .8389024          1    .612345   .7511507 |
 19. | tsst1          1   .9945946   .8456275          1   .9702525   .9998631 |
     +-------------------------------------------------------------------------+
restrict to sites with clear gold standard values only
4115 results are P/A
Mykrobe
selr has no positive samples
sep has no positive samples

     +-------------------------------------------------------------------------+
     |  site   sensit~y   specif~y      lsens      usens      lspec      uspec |
     |-------------------------------------------------------------------------|
  1. |   eta          1   .9946808    .814698          1   .9707214   .9998654 |
  2. |   etb          1   .9950739   .2924018          1   .9728606   .9998753 |
  3. |   etd          1   .9948186   .7529474          1    .971471   .9998688 |
  4. |  meca          1   .9887006   .9758663          1   .9597806   .9986286 |
  5. |  mecc          1          1   .7529474          1   .9764817          1 |
     |-------------------------------------------------------------------------|
  6. |   pvl    .968421   .9916318   .9104775   .9934397   .9700998   .9989849 |
  7. |   sea       .925   .9878788   .7961352   .9842578   .9569018   .9985287 |
  8. |   seb          1   .9891892   .8315665          1   .9614952    .998688 |
  9. |   sec   .9642857   .9830508   .8165224   .9990962   .9512687    .996491 |
 10. |   sed          1          1   .7940928          1   .9806713          1 |
     |-------------------------------------------------------------------------|
 11. |   see          1          1   .2924018          1    .981904          1 |
 12. |   seg    .987013    .984375   .9297529   .9996713   .9446974   .9981021 |
 13. |   seh   .9230769   .9888268   .7486971   .9905446   .9602234    .998644 |
 14. |   sei   .9615384    .992126   .8916883   .9919969   .9569103   .9998007 |
 15. |   sej        .95          1   .7512673   .9987349   .9802576          1 |
     |-------------------------------------------------------------------------|
 16. |  selr          .   .9073171          .          .   .8590496   .9432732 |
 17. |   sep          .   .9463415          .          .   .9060199   .9729128 |
 18. |   seu          1   .6847826   .8389024          1    .612345   .7511507 |
 19. | tsst1          1   .9891892   .8456275          1   .9614952    .998688 |
     +-------------------------------------------------------------------------+
all methods
4115 results are A/P
4115 results are A/P
4115 results are A/P

     +-----------------------------------------------------------------------------+
     |    method   sensit~y      lsens      usens   specif~y      lspec      uspec |
     |-----------------------------------------------------------------------------|
  1. |    valuez   .9782609   .9637942   .9880652   .9685969   .9622419   .9741454 |
  2. | valuetype   .9596273   .9414021   .9734606   .9763757   .9707599   .9811679 |
  3. | valuegene   .9751553   .9599667   .9857339    .971478   .9653836   .9767596 |
     +-----------------------------------------------------------------------------+
. *************************************************

. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\Datasets
E:\users\amy.mason\Pipeline_27_07_2016\Datasets

. 
. use pipeline_clean_all_values_wide, clear

. 
. 
. 
. ****************************************

. 
. 
. 
. ******************************************************

. 
. noi di _n(5) _dup(80) "=" _n " Overall summary" _n _dup(80) "="





================================================================================
 Overall summary
================================================================================

. 
. **************************

. 
. noi di  "Recall order is  Mykrobe Mykrobe Genefinder"
Recall order is  Mykrobe Mykrobe Genefinder

. 
. 
. 
. 
. 
. noi tab site ValueA, m

               |                                   ValueAll
          site |       AAA        AAP        APA        APP        PAP        PPA        PPP |     Total
---------------+-----------------------------------------------------------------------------+----------
      aac6aph2 |     1,300          0          2          1          0          0         76 |     1,379 
    aaddaph4ia |     1,291          0          2          0          0          0         86 |     1,379 
    aadeant6ia |     1,328          0         28          2          0          0         21 |     1,379 
        ant9ia |     1,227          0          4          3          0          0        145 |     1,379 
        ant9ib |     1,379          0          0          0          0          0          0 |     1,379 
        aph2ic |     1,379          0          0          0          0          0          0 |     1,379 
  apha3aph3iii |     1,327          0          0          1          0          0         51 |     1,379 
          arca |     1,372          0          1          0          0          0          6 |     1,379 
          arcb |     1,373          0          0          0          0          6          0 |     1,379 
          arcc |     1,373          0          0          0          0          6          0 |     1,379 
          arcd |     1,373          0          0          0          0          6          0 |     1,379 
          blaz |       222          0         19          7          0          1      1,130 |     1,379 
           cat |     1,379          0          0          0          0          0          0 |     1,379 
          ccra |     1,009          0          2          3          0          0        365 |     1,379 
          ccrb |     1,010          9          1         22          0          1        336 |     1,379 
         ccrca |     1,338          0          8          1          0          9         23 |     1,379 
         ccrcb |     1,333          0         22          0          0         22          2 |     1,379 
         ccrcc |     1,338          0         16          1          0          6         18 |     1,379 
           cfr |     1,376          0          0          1          0          0          2 |     1,379 
           chp |       449          0          1         46          0          0        883 |     1,379 
          dfra |     1,341          0          3          0          0          1         34 |     1,379 
          dfrb |     1,297          0          0          0          1          0         81 |     1,379 
          dfrc |     1,341          0          0          3          0         34          1 |     1,379 
          dfrd |     1,379          0          0          0          0          0          0 |     1,379 
          dfrg |     1,325          0          1          0          0          0         53 |     1,379 
          dfrk |     1,373          0          0          0          0          0          6 |     1,379 
          erma |     1,229          0          1          5          0          0        144 |     1,379 
          ermb |     1,375          0          1          0          0          0          3 |     1,379 
          ermc |     1,191          0         10          2          0          0        176 |     1,379 
          ermt |     1,359          0          0          0          0          0         20 |     1,379 
          ermy |     1,379          0          0          0          0          0          0 |     1,379 
           eta |     1,338          0          1          0          0          0         40 |     1,379 
           etb |     1,372          0          1          1          0          0          5 |     1,379 
           etd |     1,320          0          1          1          0          0         57 |     1,379 
          fusa |     1,320          0          0          2          0          0         57 |     1,379 
          fusb |     1,355          0          2          0          0          0         22 |     1,379 
          fusc |     1,302          0          1          2          0          0         74 |     1,379 
     grla/gyra |     1,072          0          1          0          2          0        304 |     1,379 
          iles |     1,379          0          0          0          0          0          0 |     1,379 
          isab |     1,379          0          0          0          0          0          0 |     1,379 
          lnua |     1,364          6          0          0          0          0          9 |     1,379 
          lnub |     1,378          0          0          0          0          0          1 |     1,379 
          lukm |     1,370          0          0          0          0          0          9 |     1,379 
         lukmf |     1,370          0          0          0          0          6          3 |     1,379 
        lukpvf |     1,266          0          2          0          0          0        111 |     1,379 
        lukpvs |     1,266          0          3          1          0          0        109 |     1,379 
          meca |       999          0          1          2          0          0        377 |     1,379 
          mecc |     1,362          0          0          0          0          0         17 |     1,379 
          mphc |     1,361          0          1          0          0          0         17 |     1,379 
          msra |     1,360          0          1          0          0          0         18 |     1,379 
          mupa |     1,362          2          0          0          0          0         15 |     1,379 
          mupb |     1,379          0          0          0          0          0          0 |     1,379 
          qaca |     1,333          0          1          1          0          0         44 |     1,379 
          qacb |     1,333          0          2          0          0         44          0 |     1,379 
       qaccsmr |     1,319          0          7          2          0          1         50 |     1,379 
          rpob |     1,354          0          1          0          1          0         23 |     1,379 
           sak |       306          0          3          5          0          0      1,065 |     1,379 
          sasx |     1,364          0          1          0          0         14          0 |     1,379 
          sat4 |     1,327          0          2          1          0          0         49 |     1,379 
           scn |       144          0          3         15          0          0      1,217 |     1,379 
           sea |     1,080          0          1          3          0          0        295 |     1,379 
           seb |     1,267          0          1          2          0          0        109 |     1,379 
           sec |     1,149          0          1          4          0          0        225 |     1,379 
           sed |     1,313          0          0          0          0          0         66 |     1,379 
           see |     1,375          0          0          0          0          0          4 |     1,379 
           seg |       600          0          6         20          0          0        753 |     1,379 
           seh |     1,241          0          2          2          0          0        134 |     1,379 
           sei |       596          0          3         33          0          6        741 |     1,379 
           sej |     1,310          0          0          0          0          0         69 |     1,379 
          selr |     1,312          0          0          0          0          0         67 |     1,379 
           sep |     1,268          0          0          2          0          1        108 |     1,379 
           seu |       595          0          2         57          0          0        725 |     1,379 
           str |     1,375          0          0          0          0          0          4 |     1,379 
          tetk |     1,272          0          4          4          0          0         99 |     1,379 
          tetl |     1,377          0          0          0          0          0          2 |     1,379 
          tetm |     1,339          0          1          1          0          0         38 |     1,379 
          teto |     1,379          0          0          0          0          0          0 |     1,379 
         tsst1 |     1,119          0          1          4          0          0        255 |     1,379 
          vana |     1,379          0          0          0          0          0          0 |     1,379 
          vanb |     1,379          0          0          0          0          0          0 |     1,379 
          vanc |     1,379          0          0          0          0          0          0 |     1,379 
          vgaa |     1,378          0          0          0          0          0          1 |     1,379 
          vgab |     1,379          0          0          0          0          0          0 |     1,379 
          vgba |     1,379          0          0          0          0          0          0 |     1,379 
---------------+-----------------------------------------------------------------------------+----------
         Total |   104,159         17        179        263          4        164     11,050 |   115,836 


. 
. gen agree  = (ValueA=="AAA"| ValueA=="PPP" )

. 
. summ agree

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |    115,836    .9945872    .0733728          0          1

. 
. noi di r(sum) " out of " r(N) " site predictions agree"
115209 out of 115836 site predictions agree

. 
. noi di r(sum)/_N*100
99.458717

. 
. 
. 
. noi di "largest disagreements"
largest disagreements

. 
. noi tab site if agree!=1, sort

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
           seu |         59        9.41        9.41
           chp |         47        7.50       16.91
          qacb |         46        7.34       24.24
         ccrcb |         44        7.02       31.26
           sei |         42        6.70       37.96
          dfrc |         37        5.90       43.86
          ccrb |         33        5.26       49.12
    aadeant6ia |         30        4.78       53.91
          blaz |         27        4.31       58.21
           seg |         26        4.15       62.36
         ccrcc |         23        3.67       66.03
         ccrca |         18        2.87       68.90
           scn |         18        2.87       71.77
          sasx |         15        2.39       74.16
          ermc |         12        1.91       76.08
       qaccsmr |         10        1.59       77.67
           sak |          8        1.28       78.95
          tetk |          8        1.28       80.22
        ant9ia |          7        1.12       81.34
          arcb |          6        0.96       82.30
          arcc |          6        0.96       83.25
          arcd |          6        0.96       84.21
          erma |          6        0.96       85.17
          lnua |          6        0.96       86.12
         lukmf |          6        0.96       87.08
          ccra |          5        0.80       87.88
           sec |          5        0.80       88.68
         tsst1 |          5        0.80       89.47
          dfra |          4        0.64       90.11
        lukpvs |          4        0.64       90.75
           sea |          4        0.64       91.39
           seh |          4        0.64       92.03
      aac6aph2 |          3        0.48       92.50
          fusc |          3        0.48       92.98
     grla/gyra |          3        0.48       93.46
          meca |          3        0.48       93.94
          sat4 |          3        0.48       94.42
           seb |          3        0.48       94.90
           sep |          3        0.48       95.37
    aaddaph4ia |          2        0.32       95.69
           etb |          2        0.32       96.01
           etd |          2        0.32       96.33
          fusa |          2        0.32       96.65
          fusb |          2        0.32       96.97
        lukpvf |          2        0.32       97.29
          mupa |          2        0.32       97.61
          qaca |          2        0.32       97.93
          rpob |          2        0.32       98.25
          tetm |          2        0.32       98.56
  apha3aph3iii |          1        0.16       98.72
          arca |          1        0.16       98.88
           cfr |          1        0.16       99.04
          dfrb |          1        0.16       99.20
          dfrg |          1        0.16       99.36
          ermb |          1        0.16       99.52
           eta |          1        0.16       99.68
          mphc |          1        0.16       99.84
          msra |          1        0.16      100.00
---------------+-----------------------------------
         Total |        627      100.00

. 
. noi tab site ValueA if agree!=1

               |                        ValueAll
          site |       AAP        APA        APP        PAP        PPA |     Total
---------------+-------------------------------------------------------+----------
      aac6aph2 |         0          2          1          0          0 |         3 
    aaddaph4ia |         0          2          0          0          0 |         2 
    aadeant6ia |         0         28          2          0          0 |        30 
        ant9ia |         0          4          3          0          0 |         7 
  apha3aph3iii |         0          0          1          0          0 |         1 
          arca |         0          1          0          0          0 |         1 
          arcb |         0          0          0          0          6 |         6 
          arcc |         0          0          0          0          6 |         6 
          arcd |         0          0          0          0          6 |         6 
          blaz |         0         19          7          0          1 |        27 
          ccra |         0          2          3          0          0 |         5 
          ccrb |         9          1         22          0          1 |        33 
         ccrca |         0          8          1          0          9 |        18 
         ccrcb |         0         22          0          0         22 |        44 
         ccrcc |         0         16          1          0          6 |        23 
           cfr |         0          0          1          0          0 |         1 
           chp |         0          1         46          0          0 |        47 
          dfra |         0          3          0          0          1 |         4 
          dfrb |         0          0          0          1          0 |         1 
          dfrc |         0          0          3          0         34 |        37 
          dfrg |         0          1          0          0          0 |         1 
          erma |         0          1          5          0          0 |         6 
          ermb |         0          1          0          0          0 |         1 
          ermc |         0         10          2          0          0 |        12 
           eta |         0          1          0          0          0 |         1 
           etb |         0          1          1          0          0 |         2 
           etd |         0          1          1          0          0 |         2 
          fusa |         0          0          2          0          0 |         2 
          fusb |         0          2          0          0          0 |         2 
          fusc |         0          1          2          0          0 |         3 
     grla/gyra |         0          1          0          2          0 |         3 
          lnua |         6          0          0          0          0 |         6 
         lukmf |         0          0          0          0          6 |         6 
        lukpvf |         0          2          0          0          0 |         2 
        lukpvs |         0          3          1          0          0 |         4 
          meca |         0          1          2          0          0 |         3 
          mphc |         0          1          0          0          0 |         1 
          msra |         0          1          0          0          0 |         1 
          mupa |         2          0          0          0          0 |         2 
          qaca |         0          1          1          0          0 |         2 
          qacb |         0          2          0          0         44 |        46 
       qaccsmr |         0          7          2          0          1 |        10 
          rpob |         0          1          0          1          0 |         2 
           sak |         0          3          5          0          0 |         8 
          sasx |         0          1          0          0         14 |        15 
          sat4 |         0          2          1          0          0 |         3 
           scn |         0          3         15          0          0 |        18 
           sea |         0          1          3          0          0 |         4 
           seb |         0          1          2          0          0 |         3 
           sec |         0          1          4          0          0 |         5 
           seg |         0          6         20          0          0 |        26 
           seh |         0          2          2          0          0 |         4 
           sei |         0          3         33          0          6 |        42 
           sep |         0          0          2          0          1 |         3 
           seu |         0          2         57          0          0 |        59 
          tetk |         0          4          4          0          0 |         8 
          tetm |         0          1          1          0          0 |         2 
         tsst1 |         0          1          4          0          0 |         5 
---------------+-------------------------------------------------------+----------
         Total |        17        179        263          4        164 |       627 


. 
. 
. 
. summ agree if strpos(type, "Aqu") |strpos(type, "Chro")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |     70,329    .9967439    .0569699          0          1

. 
. noi di r(sum) " out of " r(N) " aquired or chromosonal resistance site predictions agree"
70100 out of 70329 aquired or chromosonal resistance site predictions agree

. 
. noi di r(sum)/r(N)*100
99.674388

. 
. 
. 
. noi tab ValueAll if strpos(type, "Aquired"), sort

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |     60,428       95.26       95.26
        PPP |      2,785        4.39       99.65
        APA |         94        0.15       99.80
        PPA |         81        0.13       99.93
        APP |         38        0.06       99.99
        AAP |          8        0.01      100.00
------------+-----------------------------------
      Total |     63,434      100.00

. 
. summ agree  if strpos(type, "Aquired")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |     63,434    .9965161    .0589224          0          1

. 
. noi di r(sum) " out of " r(N) " predictions are identical between all three methods on aquired resistance prediction"
63213 out of 63434 predictions are identical between all three methods on aquired resistance prediction

. 
. 
. 
. noi tab ValueAll if strpos(type, "Chrom"), sort

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      6,422       93.14       93.14
        PPP |        465        6.74       99.88
        PAP |          4        0.06       99.94
        APA |          2        0.03       99.97
        APP |          2        0.03      100.00
------------+-----------------------------------
      Total |      6,895      100.00

. 
. summ agree  if strpos(type, "Chrom")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |      6,895    .9988397    .0340453          0          1

. 
. noi di r(sum) " out of " r(N) " predictions are identical between all three methods on chromosonal resistance prediction"
6887 out of 6895 predictions are identical between all three methods on chromosonal resistance prediction

. 
. 
. 
. noi tab ValueAll if strpos(type, "ccr"), sort

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      6,028       87.43       87.43
        PPP |        744       10.79       98.22
        APA |         49        0.71       98.93
        PPA |         38        0.55       99.48
        APP |         27        0.39       99.87
        AAP |          9        0.13      100.00
------------+-----------------------------------
      Total |      6,895      100.00

. 
. summ agree  if strpos(type, "ccr")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |      6,895     .982161    .1323757          0          1

. 
. noi di r(sum) " out of " r(N) " predictions are identical between all three methods on ccr prediction"
6772 out of 6895 predictions are identical between all three methods on ccr prediction

. 
. 
. 
. noi tab ValueAll if strpos(type, "viru"), sort

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |     31,281       81.01       81.01
        PPP |      7,056       18.27       99.29
        APP |        196        0.51       99.80
        PPA |         45        0.12       99.91
        APA |         34        0.09      100.00
------------+-----------------------------------
      Total |     38,612      100.00

. 
. summ agree  if strpos(type, "viru")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |     38,612    .9928779    .0840928          0          1

. 
. noi di r(sum) " out of " r(N) " predictions are identical between all three methods on virulence prediction"
38337 out of 38612 predictions are identical between all three methods on virulence prediction

. 
. 
. 
. 
. 
. noi tab ValueAll if strpos(type, "Chrom")|strpos(type, "Aquired"), sort

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |     66,850       95.05       95.05
        PPP |      3,250        4.62       99.67
        APA |         96        0.14       99.81
        PPA |         81        0.12       99.93
        APP |         40        0.06       99.98
        AAP |          8        0.01       99.99
        PAP |          4        0.01      100.00
------------+-----------------------------------
      Total |     70,329      100.00

. 
. summ agree  if strpos(type, "Chrom")|strpos(type, "Aquired")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |     70,329    .9967439    .0569699          0          1

. 
. noi di r(sum) " out of " r(N) " predictions are identical between all three methods on antibiotic prediction"
70100 out of 70329 predictions are identical between all three methods on antibiotic prediction

. 
. 
. 
. 
. 
. *sample discrenpancies

. 
. 
. 
. noi list sample site Value if agree!=1

        +------------------------------------------------+
        |               sample           site   ValueAll |
        |------------------------------------------------|
   245. |     H121320081-505-1       aac6aph2        APA |
  1167. |     RH11000301-155-1       aac6aph2        APA |
  1229. |     H092520302-216-1       aac6aph2        APP |
  1597. |            C00001446     aaddaph4ia        APA |
  2563. |            C00003152     aaddaph4ia        APA |
        |------------------------------------------------|
  2927. | H114140657-280-B01-2     aadeant6ia        APA |
  2956. |     H133120386-618-1     aadeant6ia        APA |
  2999. |     H092520302-216-1     aadeant6ia        APA |
  3078. |     H133960276-571-1     aadeant6ia        APA |
  3117. |            C00003385     aadeant6ia        APP |
        |------------------------------------------------|
  3151. | RH11000090-289-C02-2     aadeant6ia        APA |
  3182. |     H133300151-657-1     aadeant6ia        APA |
  3246. |  H125000105-229-G0-2     aadeant6ia        APA |
  3258. |     H133520197-646-1     aadeant6ia        APA |
  3296. | RH12000340-301-G03-2     aadeant6ia        APA |
        |------------------------------------------------|
  3343. |            C00007083     aadeant6ia        APA |
  3354. |     H125000105-833-2     aadeant6ia        APA |
  3359. |     H133000236-626-1     aadeant6ia        APA |
  3361. |            C00003221     aadeant6ia        APA |
  3375. | H105040039-373-G12-2     aadeant6ia        APA |
        |------------------------------------------------|
  3563. |     H101580214-176-2     aadeant6ia        APA |
  3571. |     H133580080-596-1     aadeant6ia        APA |
  3610. | H124420844-355-E10-2     aadeant6ia        APA |
  3625. | H103560109-371-E12-2     aadeant6ia        APA |
  3709. |     H113640215-127-2     aadeant6ia        APA |
        |------------------------------------------------|
  3719. |            C00012738     aadeant6ia        APA |
  3745. |     H133720214-574-1     aadeant6ia        APA |
  3789. |     H111640001-197-2     aadeant6ia        APA |
  3806. |     H133020301-629-1     aadeant6ia        APA |
  3902. |     H114160352-129-1     aadeant6ia        APA |
        |------------------------------------------------|
  3903. |     H104080090-443-2     aadeant6ia        APA |
  3969. |            C00003377     aadeant6ia        APP |
  3985. |     H133860126-577-1     aadeant6ia        APA |
  4014. |     H133720215-575-1     aadeant6ia        APA |
  4052. |  H082600495-244-F0-2     aadeant6ia        APA |
        |------------------------------------------------|
  4149. |     RH11000301-155-1         ant9ia        APP |
  4294. |  H120420116-223-A0-2         ant9ia        APA |
  4333. |  H120600058-224-B0-2         ant9ia        APA |
  5166. |            C00001446         ant9ia        APA |
  5269. |            C00003152         ant9ia        APP |
        |------------------------------------------------|
  5292. |     H132540570-419-2         ant9ia        APA |
  5497. |            C00008638         ant9ia        APP |
  9307. |            C00003377   apha3aph3iii        APP |
  9700. |  H103360314-241-C0-2           blaz        APA |
  9710. |            C00003320           blaz        APP |
        |------------------------------------------------|
  9796. |            C00001079           blaz        APP |
  9911. |     H114700366-481-1           blaz        APA |
 10007. | RH11000133-292-F02-2           blaz        APA |
 10009. |            C00003144           blaz        APA |
 10035. |  H101740629-240-B0-2           blaz        APA |
        |------------------------------------------------|
 10074. |     RH08000028-150-1           blaz        APA |
 10180. |            C00012749           blaz        APA |
 10281. |     RH12000540-156-1           blaz        APA |
 10340. |     H122660093-513-1           blaz        APA |
 10361. |     H121320082-506-1           blaz        APA |
        |------------------------------------------------|
 10436. | RH11000142-293-G02-2           blaz        APA |
 10468. |  H105140339-248-B0-2           blaz        APA |
 10523. |     H122840129-206-1           blaz        APA |
 10547. |            C00001091           blaz        APP |
 10640. |            C00003393           blaz        APP |
        |------------------------------------------------|
 10666. |  H102840444-246-H0-2           blaz        APA |
 10687. |     RH11000301-155-1           blaz        APP |
 10697. |            C00003406           blaz        PPA |
 10772. |     H122880144-207-1           blaz        APP |
 10788. |     H131660094-412-2           blaz        APA |
        |------------------------------------------------|
 10844. |            C00001080           blaz        APP |
 10943. |     H112540036-142-1           blaz        APA |
 10960. |     H110820268-195-2           blaz        APA |
 10961. |  H105020135-247-A0-2           blaz        APA |
 10981. |  H091100226-245-G0-2           blaz        APA |
        |------------------------------------------------|
 13788. |     RH11000301-155-1            cfr        APP |
 14368. |     H114720434-145-1           dfra        APA |
 14760. |     RH11000301-155-1           dfra        APA |
 14796. |     H121120058-504-1           dfra        APA |
 15066. |     H113640238-143-1           dfra        PPA |
        |------------------------------------------------|
 15201. |     H133960268-568-1           dfrc        PPA |
 15218. | H130240275-357-G10-2           dfrc        PPA |
 15266. |     H123120336-557-1           dfrc        PPA |
 15316. |     H121060252-533-1           dfrc        PPA |
 15355. |     H123100270-554-1           dfrc        PPA |
        |------------------------------------------------|
 15361. |     H123020176-551-1           dfrc        PPA |
 15388. |     H123100271-555-1           dfrc        PPA |
 15395. |     H132280003-416-2           dfrc        PPA |
 15414. |     H121340220-509-1           dfrc        PPA |
 15423. |     H114720434-145-1           dfrc        APP |
        |------------------------------------------------|
 15461. |  H124420845-227-E0-2           dfrc        PPA |
 15465. |     H121800040-510-1           dfrc        PPA |
 15485. | H122560310-348-F09-2           dfrc        PPA |
 15496. |     H123020177-552-1           dfrc        PPA |
 15509. |     H122960028-515-1           dfrc        PPA |
        |------------------------------------------------|
 15516. |     H121320081-505-1           dfrc        PPA |
 15554. |     H113020155-466-2           dfrc        PPA |
 15574. |     H123120337-556-1           dfrc        PPA |
 15587. |     H112060137-461-2           dfrc        PPA |
 15658. |     H133920237-578-1           dfrc        PPA |
        |------------------------------------------------|
 15680. |     H133900439-581-1           dfrc        PPA |
 15716. |     RH11000301-155-1           dfrc        APP |
 15770. | H124420844-355-E10-2           dfrc        PPA |
 15817. | H065060092-367-A12-2           dfrc        PPA |
 15838. |     H121000455-532-1           dfrc        PPA |
        |------------------------------------------------|
 15849. |     H113560219-469-2           dfrc        PPA |
 15853. |     H121120051-535-1           dfrc        PPA |
 15910. |     H133520197-646-1           dfrc        PPA |
 15949. |     H123120338-558-1           dfrc        PPA |
 16077. |     H122960030-517-1           dfrc        PPA |
        |------------------------------------------------|
 16130. |     H103060332-756-2           dfrc        PPA |
 16140. |     H123020178-553-1           dfrc        PPA |
 16284. |     H121120058-504-1           dfrc        APP |
 16309. |     H133960269-569-1           dfrc        PPA |
 16333. |     H123220266-561-1           dfrc        PPA |
        |------------------------------------------------|
 16354. |     H121320099-507-1           dfrc        PPA |
 16402. |     H104420050-188-2           dfrc        PPA |
 18940. |     H122880144-207-1           dfrg        APA |
 20735. |     RH11000301-155-1           erma        APP |
 21006. |     RH12000540-156-1           erma        APP |
        |------------------------------------------------|
 21077. |            C00001446           erma        APP |
 21358. |            C00003152           erma        APP |
 21665. |  H120600058-224-B0-2           erma        APA |
 21814. |            C00008638           erma        APP |
 22648. |            C00003385           ermb        APA |
        |------------------------------------------------|
 23445. |            C00012780           ermc        APP |
 23463. |     H111640001-197-2           ermc        APA |
 23466. |            C00001387           ermc        APA |
 23689. |            C00003290           ermc        APA |
 24225. |            C00013165           ermc        APA |
        |------------------------------------------------|
 24356. |            C00003158           ermc        APA |
 24445. |            C00003272           ermc        APA |
 24587. |            C00012784           ermc        APA |
 24651. |     H124860349-210-1           ermc        APA |
 24661. |            C00003355           ermc        APA |
        |------------------------------------------------|
 24702. |            C00012749           ermc        APP |
 24788. |            C00003292           ermc        APA |
 27599. |  RH12000505-239-A0-2           fusb        APA |
 28619. |            C00003340           fusb        APA |
 29065. |            C00003351           fusc        APA |
        |------------------------------------------------|
 29955. |     H105020486-191-2           fusc        APP |
 30069. |            C00003302           fusc        APP |
 31816. |     H133580080-596-1           lnua        AAP |
 31825. |     H133580086-601-1           lnua        AAP |
 32234. |     H133580087-582-1           lnua        AAP |
        |------------------------------------------------|
 32259. |     H133060079-613-1           lnua        AAP |
 32287. |     H133240054-609-1           lnua        AAP |
 32980. |     H133560609-593-1           lnua        AAP |
 34640. |     RH11000301-155-1           meca        APA |
 35079. |     H092520302-216-1           meca        APP |
        |------------------------------------------------|
 35597. |  H094920323-271-A1-2           meca        APP |
 38556. |     H110820268-195-2           mphc        APA |
 39189. |            C00003272           msra        APA |
 40900. |     H121320081-505-1           mupa        AAP |
 41177. |     RH10000448-161-1           mupa        AAP |
        |------------------------------------------------|
 44011. |     RH11000301-155-1           qaca        APP |
 44029. |     H121300130-139-1           qaca        APA |
 44133. |  H101740329-274-D1-2           qacb        PPA |
 44138. |     H121100042-534-1           qacb        PPA |
 44195. | RH11000029-284-F01-2           qacb        PPA |
        |------------------------------------------------|
 44257. |     H114720434-145-1           qacb        PPA |
 44260. |     H124060094-134-1           qacb        PPA |
 44349. |  H094920323-271-A1-2           qacb        PPA |
 44357. |     H101020134-173-2           qacb        PPA |
 44373. |     H113140144-468-2           qacb        PPA |
        |------------------------------------------------|
 44405. |     H121300130-139-1           qacb        APA |
 44421. |            C00013335           qacb        PPA |
 44443. |  H065120079-263-A1-2           qacb        PPA |
 44447. |     H133580080-596-1           qacb        PPA |
 44532. |            C00013362           qacb        PPA |
        |------------------------------------------------|
 44552. |  H093620523-269-G1-2           qacb        PPA |
 44577. |     H133720215-575-1           qacb        PPA |
 44578. |     H121320082-506-1           qacb        PPA |
 44597. |     RH11000301-155-1           qacb        APA |
 44599. |            C00013231           qacb        PPA |
        |------------------------------------------------|
 44618. |     H133000236-626-1           qacb        PPA |
 44691. |  H120420116-223-A0-2           qacb        PPA |
 44763. |            C00013406           qacb        PPA |
 44788. |     H121320081-505-1           qacb        PPA |
 44898. | H114140657-280-B01-2           qacb        PPA |
        |------------------------------------------------|
 44943. | RH11000044-286-H01-2           qacb        PPA |
 44974. |     H133300151-657-1           qacb        PPA |
 45016. |            C00013401           qacb        PPA |
 45019. |     H113640238-143-1           qacb        PPA |
 45058. |     H120680309-385-2           qacb        PPA |
        |------------------------------------------------|
 45107. |     H113920345-478-1           qacb        PPA |
 45121. |     H133720214-574-1           qacb        PPA |
 45126. |            C00002620           qacb        PPA |
 45134. |     H125000105-833-2           qacb        PPA |
 45223. |     H133020301-629-1           qacb        PPA |
        |------------------------------------------------|
 45264. |     H133120386-618-1           qacb        PPA |
 45281. |            C00013326           qacb        PPA |
 45306. |            C00013213           qacb        PPA |
 45320. | H130240275-357-G10-2           qacb        PPA |
 45323. |  H125000105-229-G0-2           qacb        PPA |
        |------------------------------------------------|
 45342. |     H114160352-129-1           qacb        PPA |
 45367. |     H113880160-476-1           qacb        PPA |
 45377. |     H133960276-571-1           qacb        PPA |
 45408. |  H074780626-266-D1-2           qacb        PPA |
 45449. |     H121320099-507-1           qacb        PPA |
        |------------------------------------------------|
 45483. | H124420844-355-E10-2           qacb        PPA |
 45488. |     H133860126-577-1           qacb        PPA |
 45490. |  H102820334-277-G1-2           qacb        PPA |
 45750. |            C00003155        qaccsmr        APA |
 45946. |            C00003348        qaccsmr        APA |
        |------------------------------------------------|
 46015. |     RH12000366-426-2        qaccsmr        APA |
 46242. |            C00003130        qaccsmr        APA |
 46467. |            C00003419        qaccsmr        APP |
 46512. |            C00003121        qaccsmr        APA |
 46543. |            C00003240        qaccsmr        APA |
        |------------------------------------------------|
 46593. |            C00001100        qaccsmr        PPA |
 46616. |            C00001091        qaccsmr        APP |
 46790. |     H121320081-505-1        qaccsmr        APA |
 47219. |            C00003385           sat4        APA |
 47514. |            C00003377           sat4        APP |
        |------------------------------------------------|
 48049. |     H104420250-444-2           sat4        APA |
 49729. |  RH10000375-235-E0-2           tetk        APP |
 49929. |     RH11000301-155-1           tetk        APP |
 50198. |            C00003301           tetk        APA |
 50211. |  RH12000505-239-A0-2           tetk        APA |
        |------------------------------------------------|
 50328. |     H100200151-169-2           tetk        APP |
 50380. |            C00008960           tetk        APA |
 50520. |            C00003419           tetk        APA |
 50599. |  RH10000389-236-F0-2           tetk        APP |
 53052. |            C00003385           tetm        APP |
        |------------------------------------------------|
 53341. |            C00003377           tetm        APA |
 63689. |            C00001240           dfrb        PAP |
 64922. |            C00003303           fusa        APP |
 66019. |            C00003332           fusa        APP |
 66454. | H111960080-332-F07-2      grla/gyra        PAP |
        |------------------------------------------------|
 67156. | H122560310-348-F09-2      grla/gyra        PAP |
 67456. |            C00003248      grla/gyra        APA |
 69328. |            C00003130           rpob        PAP |
 70204. |     H110740135-193-2           rpob        APA |
 70998. |            C00003248           ccra        APP |
        |------------------------------------------------|
 71057. |            C00003152           ccra        APA |
 71089. |     H110740135-193-2           ccra        APA |
 71391. | H120860096-346-D09-2           ccra        APP |
 71477. |  H094920323-271-A1-2           ccra        APP |
 71745. |     RH11000301-155-1           ccrb        APP |
        |------------------------------------------------|
 71777. | RH12000346-307-E04-2           ccrb        AAP |
 71902. |            C00000790           ccrb        APP |
 71979. |            C00000809           ccrb        APP |
 72027. |            C00003152           ccrb        APA |
 72054. |  H094920323-271-A1-2           ccrb        APP |
        |------------------------------------------------|
 72075. |            C00000785           ccrb        APP |
 72134. |            C00003229           ccrb        AAP |
 72154. |            C00012775           ccrb        AAP |
 72211. |            C00000799           ccrb        APP |
 72245. |            C00000787           ccrb        APP |
        |------------------------------------------------|
 72247. |            C00000800           ccrb        APP |
 72287. |            C00000806           ccrb        APP |
 72303. |            C00013393           ccrb        AAP |
 72391. |            C00000829           ccrb        APP |
 72394. |            C00000815           ccrb        APP |
        |------------------------------------------------|
 72398. |            C00012776           ccrb        AAP |
 72401. |     H101520278-175-2           ccrb        PPA |
 72411. |            C00000786           ccrb        APP |
 72534. |            C00000808           ccrb        APP |
 72541. |            C00000817           ccrb        APP |
        |------------------------------------------------|
 72554. |            C00013235           ccrb        AAP |
 72621. |            C00000784           ccrb        APP |
 72655. |            C00000831           ccrb        APP |
 72780. |            C00013162           ccrb        AAP |
 72791. |            C00013248           ccrb        AAP |
        |------------------------------------------------|
 72854. |            C00013367           ccrb        AAP |
 72893. |            C00000820           ccrb        APP |
 72965. |            C00000818           ccrb        APP |
 73014. |            C00000828           ccrb        APP |
 73032. |            C00000816           ccrb        APP |
        |------------------------------------------------|
 73036. |            C00000789           ccrb        APP |
 73038. |            C00000788           ccrb        APP |
 73099. |     H092520302-216-1          ccrca        APP |
 73128. |     H133180046-621-1          ccrca        PPA |
 73187. |     H133180047-622-1          ccrca        PPA |
        |------------------------------------------------|
 73207. |     H104420250-444-2          ccrca        PPA |
 73271. |     H133760113-576-1          ccrca        APA |
 73365. |     H132540570-419-2          ccrca        PPA |
 73415. |  H114080202-255-A1-2          ccrca        PPA |
 73428. |            C00013230          ccrca        PPA |
        |------------------------------------------------|
 73438. | RH11000072-288-B02-2          ccrca        PPA |
 73609. |            C00003229          ccrca        APA |
 73774. |     H104600048-190-2          ccrca        APA |
 73847. |  H120840083-225-C0-2          ccrca        APA |
 73926. |     H113640238-143-1          ccrca        APA |
        |------------------------------------------------|
 73964. | H122900151-350-H09-2          ccrca        PPA |
 74018. |     H121340220-509-1          ccrca        APA |
 74103. | H114680370-339-E08-2          ccrca        APA |
 74339. | H105260391-374-H12-2          ccrca        PPA |
 74431. | H123700164-353-C10-2          ccrca        APA |
        |------------------------------------------------|
 74533. |     H132540570-419-2          ccrcb        PPA |
 74556. |            C00003315          ccrcb        PPA |
 74645. |     H124940430-401-1          ccrcb        APA |
 74656. |            C00001226          ccrcb        PPA |
 74680. | H114140657-280-B01-2          ccrcb        APA |
        |------------------------------------------------|
 74683. |     H080980484-164-1          ccrcb        APA |
 74728. | RH11000090-289-C02-2          ccrcb        APA |
 74784. |     H133720214-574-1          ccrcb        APA |
 74837. |     H104080090-443-2          ccrcb        APA |
 74863. |     H133000236-626-1          ccrcb        APA |
        |------------------------------------------------|
 74878. |     RH11000301-155-1          ccrcb        APA |
 74894. | RH11000072-288-B02-2          ccrcb        PPA |
 74920. |     H133860126-577-1          ccrcb        APA |
 74939. |     H113640215-127-2          ccrcb        APA |
 74941. |     H133720215-575-1          ccrcb        APA |
        |------------------------------------------------|
 74963. | H122900151-350-H09-2          ccrcb        PPA |
 75009. |     H133580080-596-1          ccrcb        APA |
 75018. | H123700164-353-C10-2          ccrcb        PPA |
 75042. |     H125000105-833-2          ccrcb        APA |
 75089. |     H133960276-571-1          ccrcb        APA |
        |------------------------------------------------|
 75121. |     H104420250-444-2          ccrcb        PPA |
 75151. |     H133300151-657-1          ccrcb        APA |
 75159. |     H114120077-144-1          ccrcb        PPA |
 75167. |            C00013230          ccrcb        PPA |
 75195. |  H101120403-273-C1-2          ccrcb        PPA |
        |------------------------------------------------|
 75214. |     H104600048-190-2          ccrcb        PPA |
 75311. |     H133020301-629-1          ccrcb        APA |
 75313. | H105260391-374-H12-2          ccrcb        PPA |
 75327. |     H092520302-216-1          ccrcb        APA |
 75394. |  H120840083-225-C0-2          ccrcb        PPA |
        |------------------------------------------------|
 75428. |     H110520238-116-2          ccrcb        APA |
 75441. |            C00003093          ccrcb        APA |
 75447. | H114680370-339-E08-2          ccrcb        PPA |
 75489. |     H121340220-509-1          ccrcb        PPA |
 75521. |     H113640238-143-1          ccrcb        PPA |
        |------------------------------------------------|
 75575. |     H131800554-414-2          ccrcb        PPA |
 75576. |  H114080202-255-A1-2          ccrcb        PPA |
 75645. |  RH11000042-258-D1-2          ccrcb        PPA |
 75676. |     H133120386-618-1          ccrcb        APA |
 75694. |            C00003250          ccrcb        PPA |
        |------------------------------------------------|
 75738. |     H114160352-129-1          ccrcb        APA |
 75743. |  H125000105-229-G0-2          ccrcb        APA |
 75783. |     H133180047-622-1          ccrcb        PPA |
 75839. |     H133180046-621-1          ccrcb        PPA |
 75990. |  H120600058-224-B0-2          ccrcc        APA |
        |------------------------------------------------|
 76012. |  RH11000042-258-D1-2          ccrcc        PPA |
 76054. | H114140657-280-B01-2          ccrcc        APA |
 76176. |     H133720214-574-1          ccrcc        APA |
 76205. |     H133760113-576-1          ccrcc        PPA |
 76264. | H122900151-350-H09-2          ccrcc        APP |
        |------------------------------------------------|
 76310. |     H114160352-129-1          ccrcc        APA |
 76334. |     RH11000301-155-1          ccrcc        APA |
 76348. |     H133120386-618-1          ccrcc        APA |
 76351. |     H114120077-144-1          ccrcc        PPA |
 76353. |     H133860126-577-1          ccrcc        APA |
        |------------------------------------------------|
 76456. |  H125000105-229-G0-2          ccrcc        APA |
 76472. |     H133580080-596-1          ccrcc        APA |
 76841. |            C00003248          ccrcc        APA |
 76859. |            C00003229          ccrcc        PPA |
 76876. |  H101120403-273-C1-2          ccrcc        PPA |
        |------------------------------------------------|
 76903. |     H133020301-629-1          ccrcc        APA |
 76960. |     H133720215-575-1          ccrcc        APA |
 77015. |     H125000105-833-2          ccrcc        APA |
 77064. |     H133960276-571-1          ccrcc        APA |
 77066. |     H133300151-657-1          ccrcc        APA |
        |------------------------------------------------|
 77099. |     H133000236-626-1          ccrcc        APA |
 77124. |     H110520238-116-2          ccrcc        PPA |
 78202. |     RH10000448-161-1           arca        APA |
 78847. | H105040039-373-G12-2           arcb        PPA |
 79195. |            C00003272           arcb        PPA |
        |------------------------------------------------|
 79319. |            C00007064           arcb        PPA |
 79347. |            C00013217           arcb        PPA |
 79429. |     H121120058-504-1           arcb        PPA |
 79652. |     H113560219-469-2           arcb        PPA |
 80515. |            C00003272           arcc        PPA |
        |------------------------------------------------|
 80583. |     H113560219-469-2           arcc        PPA |
 80788. |            C00007064           arcc        PPA |
 80978. |     H121120058-504-1           arcc        PPA |
 81199. | H105040039-373-G12-2           arcc        PPA |
 81359. |            C00013217           arcc        PPA |
        |------------------------------------------------|
 81584. |            C00013217           arcd        PPA |
 81867. |     H121120058-504-1           arcd        PPA |
 82002. |            C00007064           arcd        PPA |
 82179. | H105040039-373-G12-2           arcd        PPA |
 82489. |     H113560219-469-2           arcd        PPA |
        |------------------------------------------------|
 82596. |            C00003272           arcd        PPA |
 82786. |            C00003301            chp        APP |
 82823. |            C00003421            chp        APP |
 82851. |            C00003423            chp        APA |
 82934. |            C00003259            chp        APP |
        |------------------------------------------------|
 82943. |            C00003422            chp        APP |
 83004. |            C00003253            chp        APP |
 83011. |            C00013241            chp        APP |
 83037. |            C00003115            chp        APP |
 83110. |            C00003306            chp        APP |
        |------------------------------------------------|
 83113. |            C00003396            chp        APP |
 83123. |            C00003254            chp        APP |
 83151. |            C00003272            chp        APP |
 83156. |     H123100271-555-1            chp        APP |
 83175. |            C00003164            chp        APP |
        |------------------------------------------------|
 83272. |            C00003397            chp        APP |
 83322. |            C00003315            chp        APP |
 83365. |            C00003195            chp        APP |
 83376. |            C00003248            chp        APP |
 83380. |            C00003321            chp        APP |
        |------------------------------------------------|
 83419. |            C00003381            chp        APP |
 83476. |            C00003111            chp        APP |
 83521. |            C00003415            chp        APP |
 83530. |            C00003379            chp        APP |
 83564. |     RH08000028-150-1            chp        APP |
        |------------------------------------------------|
 83589. |            C00002656            chp        APP |
 83603. |            C00003385            chp        APP |
 83607. |            C00000857            chp        APP |
 83637. |            C00003354            chp        APP |
 83639. |            C00003137            chp        APP |
        |------------------------------------------------|
 83641. |            C00003333            chp        APP |
 83686. |            C00003425            chp        APP |
 83699. |            C00003395            chp        APP |
 83710. |            C00013364            chp        APP |
 83750. |     RH11000301-155-1            chp        APP |
        |------------------------------------------------|
 83782. |            C00003176            chp        APP |
 83784. |            C00003134            chp        APP |
 83833. |            C00003319            chp        APP |
 83841. |            C00003411            chp        APP |
 83851. |            C00003382            chp        APP |
        |------------------------------------------------|
 83861. |            C00003320            chp        APP |
 83862. |            C00003337            chp        APP |
 83986. |            C00003307            chp        APP |
 84055. |            C00003125            chp        APP |
 84067. |            C00003252            chp        APP |
        |------------------------------------------------|
 84071. |            C00013195            chp        APP |
 84073. |            C00013221            chp        APP |
 84112. |            C00003122            chp        APP |
 84780. |     H105020486-191-2            eta        APA |
 86046. |            C00013318            etb        APA |
        |------------------------------------------------|
 86839. |     H112660153-200-1            etb        APP |
 87719. |            C00003337            etd        APP |
 87881. |     H110740135-193-2            etd        APA |
 89906. |     RH12000374-434-2          lukmf        PPA |
 89952. | RH11000146-294-H02-2          lukmf        PPA |
        |------------------------------------------------|
 89995. |     RH12000376-436-2          lukmf        PPA |
 90073. |     RH12000381-441-2          lukmf        PPA |
 90275. |  RH07000425-233-C0-2          lukmf        PPA |
 91006. |     RH12000375-435-2          lukmf        PPA |
 91982. |     H122880144-207-1         lukpvf        APA |
        |------------------------------------------------|
 92281. |  H094920323-271-A1-2         lukpvf        APA |
 92948. |            C00003224         lukpvs        APP |
 93103. | H113420072-336-B08-2         lukpvs        APA |
 93290. |  H094920323-271-A1-2         lukpvs        APA |
 93582. |     H122880144-207-1         lukpvs        APA |
        |------------------------------------------------|
 94143. |     H110820268-195-2            sak        APA |
 94691. |            C00003248            sak        APA |
 94751. |     H113640238-143-1            sak        APA |
 94811. |            C00003320            sak        APP |
 94888. |  H094920323-271-A1-2            sak        APP |
        |------------------------------------------------|
 94926. |            C00002656            sak        APP |
 94968. |     RH11000301-155-1            sak        APP |
 94975. |            C00003207            sak        APP |
 95313. |     H133860126-577-1           sasx        PPA |
 95581. |     RH11000301-155-1           sasx        APA |
        |------------------------------------------------|
 95678. |     H133960276-571-1           sasx        PPA |
 95710. |     H133720214-574-1           sasx        PPA |
 95763. |     H114160352-129-1           sasx        PPA |
 95854. |     H133300151-657-1           sasx        PPA |
 95955. |     H113640238-143-1           sasx        PPA |
        |------------------------------------------------|
 96028. |     H133000236-626-1           sasx        PPA |
 96070. |  H125000105-229-G0-2           sasx        PPA |
 96101. |     H133020301-629-1           sasx        PPA |
 96287. |     H133120386-618-1           sasx        PPA |
 96303. |     H133720215-575-1           sasx        PPA |
        |------------------------------------------------|
 96355. |     H125000105-833-2           sasx        PPA |
 96364. |     H133580080-596-1           sasx        PPA |
 96405. | H114140657-280-B01-2           sasx        PPA |
 96564. |            C00003207            scn        APP |
 96741. |            C00003422            scn        APA |
        |------------------------------------------------|
 96822. |            C00003395            scn        APP |
 96936. |            C00003317            scn        APP |
 97071. |            C00003411            scn        APP |
 97123. |            C00003122            scn        APP |
 97186. |     RH11000301-155-1            scn        APP |
        |------------------------------------------------|
 97221. |            C00008638            scn        APP |
 97240. |            C00003092            scn        APP |
 97290. |            C00003242            scn        APP |
 97334. |            C00003396            scn        APP |
 97451. |            C00003423            scn        APA |
        |------------------------------------------------|
 97488. |     H113640238-143-1            scn        APA |
 97515. |            C00003320            scn        APP |
 97558. |            C00003315            scn        APP |
 97586. |     H103440108-442-2            scn        APP |
 97596. |            C00002656            scn        APP |
        |------------------------------------------------|
 97645. |            C00003421            scn        APP |
 98154. |            C00003207            sea        APP |
 98467. |     RH11000301-155-1            sea        APP |
 98889. |     RH08000028-150-1            sea        APA |
 99200. |            C00003165            sea        APP |
        |------------------------------------------------|
 99656. |     H122880144-207-1            seb        APA |
 99931. |            C00001265            seb        APP |
100574. |            C00003306            seb        APP |
101086. |            C00003421            sec        APP |
101207. |     RH11000301-155-1            sec        APP |
        |------------------------------------------------|
101234. |            C00003393            sec        APP |
101357. |     H113640238-143-1            sec        APA |
101576. |            C00003425            sec        APP |
104860. |            C00003140            seg        APP |
104905. |     H122880144-207-1            seg        APA |
        |------------------------------------------------|
104919. |            C00003425            seg        APP |
104962. |            C00003389            seg        APP |
104971. |            C00003415            seg        APA |
104976. |            C00003317            seg        APP |
105000. |            C00003362            seg        APP |
        |------------------------------------------------|
105043. |            C00003314            seg        APP |
105065. |            C00003406            seg        APP |
105083. |            C00003347            seg        APP |
105105. |            C00003382            seg        APP |
105212. |            C00003321            seg        APP |
        |------------------------------------------------|
105354. |            C00001102            seg        APA |
105386. |            C00003393            seg        APP |
105549. |            C00001086            seg        APA |
105635. |            C00003320            seg        APP |
105695. |            C00003421            seg        APP |
        |------------------------------------------------|
105765. |            C00003340            seg        APP |
105895. |            C00003341            seg        APA |
105982. |            C00003315            seg        APP |
105986. |            C00003385            seg        APP |
106001. |            C00003318            seg        APP |
        |------------------------------------------------|
106063. |            C00003248            seg        APA |
106106. |  H094920323-271-A1-2            seg        APP |
106145. |            C00003423            seg        APP |
106177. |            C00003339            seg        APP |
106805. |            C00003134            seh        APP |
        |------------------------------------------------|
107040. | RH12000046-298-D03-2            seh        APP |
107292. |            C00003207            seh        APA |
107401. |  H120420116-223-A0-2            seh        APA |
107596. |     H114720432-482-1            sei        APP |
107597. |            C00003340            sei        APP |
        |------------------------------------------------|
107604. |            C00003425            sei        APP |
107628. |            C00003423            sei        APP |
107629. |            C00000790            sei        PPA |
107674. |            C00003337            sei        APA |
107712. |            C00001086            sei        APA |
        |------------------------------------------------|
107718. |            C00003406            sei        APP |
107726. |            C00003301            sei        APP |
107761. |     RH12000370-430-2            sei        APP |
107784. |            C00000817            sei        PPA |
107786. |            C00003260            sei        APP |
        |------------------------------------------------|
107899. |     H120440759-384-2            sei        APP |
107900. |            C00003315            sei        APP |
107909. |            C00003320            sei        APP |
107937. |            C00003134            sei        APP |
108015. |            C00000785            sei        PPA |
        |------------------------------------------------|
108018. |            C00000815            sei        PPA |
108037. |            C00003339            sei        APP |
108082. |     H132620132-420-2            sei        APP |
108089. |            C00003347            sei        APP |
108098. |            C00000800            sei        PPA |
        |------------------------------------------------|
108116. |  RH12000503-261-G1-2            sei        APP |
108210. |            C00000786            sei        PPA |
108211. |     H103220288-184-2            sei        APA |
108240. |            C00003318            sei        APP |
108292. |  H094920323-271-A1-2            sei        APP |
        |------------------------------------------------|
108439. |     H123120336-557-1            sei        APP |
108467. |     H111740190-456-2            sei        APP |
108468. |            C00003321            sei        APP |
108484. |            C00003385            sei        APP |
108563. |            C00003140            sei        APP |
        |------------------------------------------------|
108565. |     H100140197-167-2            sei        APP |
108566. |            C00003333            sei        APP |
108588. |     H124940430-401-1            sei        APP |
108609. |            C00003341            sei        APP |
108635. |            C00003317            sei        APP |
        |------------------------------------------------|
108648. |            C00003278            sei        APP |
108691. |     RH12000379-439-2            sei        APP |
108822. |            C00003382            sei        APP |
108839. |     H034660053-158-1            sei        APP |
108841. |     H110740135-193-2            sei        APP |
        |------------------------------------------------|
112109. |            C00001265            sep        APP |
112638. |            C00003270            sep        APP |
112759. |            C00003165            sep        PPA |
113084. |     H114720434-145-1            seu        APP |
113107. |     H133200270-608-1            seu        APP |
        |------------------------------------------------|
113117. |            C00003385            seu        APA |
113156. |     H114340058-470-2            seu        APP |
113195. |     H124860349-210-1            seu        APP |
113208. |            C00003317            seu        APP |
113230. |     H130660215-405-2            seu        APP |
        |------------------------------------------------|
113233. |     H120220271-381-2            seu        APP |
113235. |            C00003140            seu        APP |
113254. | RH11000090-289-C02-2            seu        APP |
113275. |     H132620132-420-2            seu        APP |
113297. |     H123120337-556-1            seu        APP |
        |------------------------------------------------|
113307. |            C00003389            seu        APP |
113322. |            C00003315            seu        APP |
113372. |            C00003382            seu        APP |
113381. |     H121320099-507-1            seu        APP |
113420. | RH11000044-286-H01-2            seu        APP |
        |------------------------------------------------|
113438. |     H133920237-578-1            seu        APP |
113474. |     H125280642-841-2            seu        APP |
113496. |     H124720623-209-1            seu        APP |
113508. |            C00003341            seu        APP |
113537. |            C00003414            seu        APP |
        |------------------------------------------------|
113547. |            C00003425            seu        APP |
113566. |            C00003411            seu        APP |
113569. |            C00003423            seu        APP |
113720. |            C00003352            seu        APP |
113786. |            C00003320            seu        APP |
        |------------------------------------------------|
113789. |     H131800573-415-2            seu        APP |
113830. |     H111600186-455-2            seu        APP |
113866. |     H120440759-384-2            seu        APP |
113906. |            C00003318            seu        APP |
113927. |            C00003410            seu        APP |
        |------------------------------------------------|
113948. |  H094920323-271-A1-2            seu        APP |
113982. |            C00003249            seu        APP |
114011. |  H104340410-220-F0-2            seu        APP |
114034. |            C00003314            seu        APP |
114057. |            C00003340            seu        APP |
        |------------------------------------------------|
114097. |            C00003347            seu        APP |
114114. |     H113560219-469-2            seu        APP |
114127. | H125280642-356-F10-2            seu        APP |
114134. |     H123120336-557-1            seu        APP |
114136. |            C00003084            seu        APP |
        |------------------------------------------------|
114169. |            C00003421            seu        APP |
114170. |            C00007096            seu        APP |
114171. |     H121000455-532-1            seu        APP |
114217. |            C00003277            seu        APP |
114244. |            C00003393            seu        APP |
        |------------------------------------------------|
114246. |            C00013224            seu        APP |
114272. |     H133100176-615-1            seu        APP |
114285. |     H100800158-172-2            seu        APP |
114289. |            C00003307            seu        APP |
114317. |            C00003397            seu        APP |
        |------------------------------------------------|
114324. |     H132920375-623-1            seu        APP |
114326. |            C00003406            seu        APP |
114345. |            C00001086            seu        APA |
114376. |            C00003137            seu        APP |
114413. |            C00003223            seu        APP |
        |------------------------------------------------|
114428. |     H111940137-460-2            seu        APP |
114453. |     H110740135-193-2            seu        APP |
114561. |            C00008625          tsst1        APP |
115169. |     H113640238-143-1          tsst1        APA |
115208. |            C00003134          tsst1        APP |
        |------------------------------------------------|
115275. |     RH11000301-155-1          tsst1        APP |
115362. |            C00008949          tsst1        APP |
        +------------------------------------------------+

. use anti_panel_all, clear

. 
. 
. 
. * in table

. 
. noi tab gold valueall

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
         I |         6          0          0          0          0         74 |        80 
        NA |       288          8          0          0          9      1,699 |     2,004 
         R |     2,720          9          3          0          4         89 |     2,825 
         S |        97         13          1          2         22     11,504 |    11,639 
-----------+------------------------------------------------------------------+----------
     Total |     3,111         30          4          2         35     13,366 |    16,548 


. 
. 
. 
. * reduced table

. 
. drop if !inlist(gold, "R", "S")
(2,084 observations deleted)

. 
. noi tab gold valueall

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
         R |     2,720          9          3          0          4         89 |     2,825 
         S |        97         13          1          2         22     11,504 |    11,639 
-----------+------------------------------------------------------------------+----------
     Total |     2,817         22          4          2         26     11,593 |    14,464 


. 
. gen agree = (valueall=="rrr" & gold=="R")|(valueall=="sss" & gold=="S")

. 
. summ agree

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |     14,464    .9834071    .1277448          0          1

. 
. noi di r(sum) " out of " r(N) "results agree between all methods and gold standard"
14224 out of 14464results agree between all methods and gold standard

. 
. noi di r(sum)/r(N)*100
98.340708

. 
. 
. 
. noi di "disagreements by site"
disagreements by site

. 
. noi bysort gold: tab site valueall

----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = R

              |                        valueall
         site |       rrr        rrs        rsr        srs        sss |     Total
--------------+-------------------------------------------------------+----------
ciprofloxacin |       299          0          2          0         15 |       316 
  clindamycin |       180          0          0          0          5 |       185 
 erythromycin |       342          0          0          0          6 |       348 
  fusidicacid |       144          3          0          2         13 |       162 
   gentamicin |        73          1          0          1         19 |        94 
  methicillin |       381          2          0          0          8 |       391 
    mupirocin |         6          0          0          0          0 |         6 
   penicillin |     1,124          2          0          1         10 |     1,137 
   rifampicin |        22          0          1          0          2 |        25 
 tetracycline |       112          1          0          0          5 |       118 
 trimethoprim |        37          0          0          0          6 |        43 
--------------+-------------------------------------------------------+----------
        Total |     2,720          9          3          4         89 |     2,825 


----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = S

              |                             valueall
         site |       rrr        rrs        rsr        rss        srs        sss |     Total
--------------+------------------------------------------------------------------+----------
ciprofloxacin |         4          0          0          0          1      1,031 |     1,036 
  clindamycin |        22          2          0          0          2        253 |       279 
 erythromycin |        11          6          0          0          8        999 |     1,024 
  fusidicacid |         7          1          0          0          1      1,202 |     1,211 
   gentamicin |         3          0          0          0          1      1,275 |     1,279 
  methicillin |         5          0          0          0          0        957 |       962 
    mupirocin |         6          0          0          2          0      1,007 |     1,015 
   penicillin |        32          1          0          0          3        196 |       232 
   rifampicin |         1          0          0          0          1      1,345 |     1,347 
 tetracycline |         6          3          0          0          5      1,240 |     1,254 
 trimethoprim |         0          0          1          0          0        626 |       627 
   vancomycin |         0          0          0          0          0      1,373 |     1,373 
--------------+------------------------------------------------------------------+----------
        Total |        97         13          1          2         22     11,504 |    11,639 



. 
. 
. 
. noi di "discrenpancies"
discrenpancies

. 
. noi list sample site gold valueall if agree!=1

       +------------------------------------------------------------+
       |               sample            site   goldst~d   valueall |
       |------------------------------------------------------------|
   95. |     H113080385-467-2      penicillin          R        sss |
  140. |            C00003115      rifampicin          R        sss |
  141. |  H103360314-241-C0-2      gentamicin          R        sss |
  171. |            C00001443   ciprofloxacin          R        sss |
  185. |     RH11000301-155-1      gentamicin          R        srs |
       |------------------------------------------------------------|
  222. |            C00003420    erythromycin          R        sss |
  307. |  H104340409-219-E0-2      penicillin          R        sss |
  316. |     RH09000012-153-1      gentamicin          R        sss |
  352. |            C00001147    erythromycin          R        sss |
  385. |     H092520302-216-1     methicillin          R        rrs |
       |------------------------------------------------------------|
  484. |            C00009033   ciprofloxacin          R        sss |
  491. |            C00003207     fusidicacid          R        sss |
  518. |            C00003175   ciprofloxacin          R        sss |
  574. |            C00001147      penicillin          R        sss |
  620. |            C00001162    erythromycin          R        sss |
       |------------------------------------------------------------|
  624. |            C00013331      gentamicin          R        sss |
  626. |     H122640061-512-1     fusidicacid          R        sss |
  641. |            C00003396    trimethoprim          R        sss |
  681. |     H105020486-191-2     fusidicacid          R        rrs |
  793. |            C00009021   ciprofloxacin          R        sss |
       |------------------------------------------------------------|
  822. |  H113840385-254-H0-2      gentamicin          R        sss |
  824. |     H113140166-125-2    tetracycline          R        sss |
  832. |            C00003303     fusidicacid          R        rrs |
  867. |            C00013232      penicillin          R        sss |
  891. |  RH10000375-235-E0-2    tetracycline          R        rrs |
       |------------------------------------------------------------|
  893. |     H120860086-386-2     fusidicacid          R        sss |
  970. |            C00003302     fusidicacid          R        rrs |
 1037. |  H113640207-252-F0-2      gentamicin          R        sss |
 1116. |     H112540036-142-1      gentamicin          R        sss |
 1132. |     H101520278-175-2      gentamicin          R        sss |
       |------------------------------------------------------------|
 1159. |     H113140144-468-2     methicillin          R        sss |
 1179. |            C00001162     clindamycin          R        sss |
 1200. |            C00003404    trimethoprim          R        sss |
 1214. |     RH12000363-423-2      penicillin          R        sss |
 1236. |     H102940768-182-2     fusidicacid          R        sss |
       |------------------------------------------------------------|
 1304. |            C00001092   ciprofloxacin          R        sss |
 1307. |            C00001162   ciprofloxacin          R        sss |
 1339. |     H111820058-457-2     fusidicacid          R        sss |
 1379. |     H124860349-210-1     methicillin          R        sss |
 1382. |            C00001224    erythromycin          R        sss |
       |------------------------------------------------------------|
 1389. | H111960080-332-F07-2   ciprofloxacin          R        rsr |
 1450. |            C00003351     fusidicacid          R        srs |
 1472. |     H113540198-126-2    tetracycline          R        sss |
 1498. |  H113800363-253-G0-2     clindamycin          R        sss |
 1506. |     H133520198-647-1    tetracycline          R        sss |
       |------------------------------------------------------------|
 1567. |            C00003115   ciprofloxacin          R        sss |
 1570. |     RH12000540-156-1     methicillin          R        sss |
 1654. |  H113800363-253-G0-2      gentamicin          R        sss |
 1682. |            C00001115      gentamicin          R        sss |
 1715. |     H092520302-216-1      gentamicin          R        rrs |
       |------------------------------------------------------------|
 1718. |            C00003170   ciprofloxacin          R        sss |
 1731. |     H133760113-576-1     clindamycin          R        sss |
 1737. |     H110960065-452-1     fusidicacid          R        sss |
 1790. |            C00003377    trimethoprim          R        sss |
 1796. |  H071160354-264-B1-2    erythromycin          R        sss |
       |------------------------------------------------------------|
 1817. |            C00001091      penicillin          R        rrs |
 1853. |            C00001224     clindamycin          R        sss |
 1873. |            C00003375    trimethoprim          R        sss |
 1919. |  H103300404-218-D0-2     methicillin          R        sss |
 1930. |     H103260058-185-2     fusidicacid          R        sss |
       |------------------------------------------------------------|
 1961. |            C00003340     fusidicacid          R        srs |
 1994. |     H133180046-621-1      gentamicin          R        sss |
 2012. |     H133520197-646-1      gentamicin          R        sss |
 2033. |  H071160354-264-B1-2     fusidicacid          R        sss |
 2041. |     H133520198-647-1      gentamicin          R        sss |
       |------------------------------------------------------------|
 2050. |     H124480843-137-1      gentamicin          R        sss |
 2069. |            C00003404      penicillin          R        sss |
 2111. |     H113140166-125-2      gentamicin          R        sss |
 2117. |            C00001079      penicillin          R        rrs |
 2126. |     H122640061-512-1      rifampicin          R        sss |
       |------------------------------------------------------------|
 2145. |     H100600212-171-2      gentamicin          R        sss |
 2151. |            C00001259     fusidicacid          R        sss |
 2165. |  H100180330-243-E0-2      gentamicin          R        sss |
 2178. |     H120860086-386-2    tetracycline          R        sss |
 2185. |     H102380070-178-2      gentamicin          R        sss |
       |------------------------------------------------------------|
 2201. |     H123100270-554-1    erythromycin          R        sss |
 2226. |  H092820427-242-D0-2      gentamicin          R        sss |
 2231. |            C00003115     methicillin          R        sss |
 2233. |  H071160354-264-B1-2    trimethoprim          R        sss |
 2240. |            C00001115     methicillin          R        sss |
       |------------------------------------------------------------|
 2266. | RH12000362-323-E06-2     methicillin          R        sss |
 2302. |     H122140282-391-2   ciprofloxacin          R        sss |
 2303. |     RH12000364-424-2      penicillin          R        sss |
 2327. |            C00001105   ciprofloxacin          R        sss |
 2353. |            C00003376    trimethoprim          R        sss |
       |------------------------------------------------------------|
 2381. |            C00012780      penicillin          R        sss |
 2388. |            C00001442   ciprofloxacin          R        sss |
 2410. |            C00003397      penicillin          R        sss |
 2422. | H104040516-329-C07-2    tetracycline          R        sss |
 2429. |     RH12000540-156-1      penicillin          R        srs |
       |------------------------------------------------------------|
 2448. |            C00003265     fusidicacid          R        sss |
 2467. |  H094920323-271-A1-2     methicillin          R        rrs |
 2480. |            C00001115   ciprofloxacin          R        sss |
 2488. | H122560310-348-F09-2   ciprofloxacin          R        rsr |
 2565. |     RH09000011-151-1      gentamicin          R        sss |
       |------------------------------------------------------------|
 2603. |            C00003130      rifampicin          R        rsr |
 2641. |            C00001162     methicillin          R        sss |
 2680. |  H114160372-256-B1-2     fusidicacid          R        sss |
 2699. | H104040516-329-C07-2     fusidicacid          R        sss |
 2761. |            C00001109   ciprofloxacin          R        sss |
       |------------------------------------------------------------|
 2763. |     H123100270-554-1     clindamycin          R        sss |
 2781. |            C00003324      penicillin          R        sss |
 2807. |            C00013185   ciprofloxacin          R        sss |
 2817. |            C00001440   ciprofloxacin          R        sss |
 2820. |            C00001276     fusidicacid          R        sss |
       |------------------------------------------------------------|
 2864. |            C00003247     methicillin          S        rrr |
 2955. |     H125000105-833-2       mupirocin          S        rrr |
 3300. |     H121120058-504-1     methicillin          S        rrr |
 3312. |            C00001240    trimethoprim          S        rsr |
 3352. |            C00001405       mupirocin          S        rrr |
       |------------------------------------------------------------|
 3429. | H113140175-334-H07-2     clindamycin          S        rrr |
 3478. |     H111200066-118-2     clindamycin          S        rrr |
 3638. |     H101020134-173-2    erythromycin          S        rrr |
 3697. |            C00003272    erythromycin          S        rrr |
 3770. |            C00013181     fusidicacid          S        rrr |
       |------------------------------------------------------------|
 3778. |            C00001446    erythromycin          S        rrs |
 3996. |            C00001080     methicillin          S        rrr |
 4003. |            C00003419    tetracycline          S        srs |
 4013. |            C00001247    tetracycline          S        rrr |
 4041. |     H121320081-505-1      gentamicin          S        srs |
       |------------------------------------------------------------|
 4136. |     H111820165-458-2     clindamycin          S        rrr |
 4164. |     H121120058-504-1      gentamicin          S        rrr |
 4268. |            C00001266      penicillin          S        rrr |
 4447. |            C00003290    erythromycin          S        srs |
 4499. |            C00001203      penicillin          S        rrr |
       |------------------------------------------------------------|
 4567. |     H112540036-142-1    erythromycin          S        rrr |
 4771. |  H125000105-229-G0-2       mupirocin          S        rrr |
 4911. |     RH08000028-150-1    erythromycin          S        rrr |
 4967. |            C00001080   ciprofloxacin          S        rrr |
 5020. |            C00001148      penicillin          S        rrr |
       |------------------------------------------------------------|
 5077. |            C00003374     fusidicacid          S        rrr |
 5109. |            C00003385    tetracycline          S        rrs |
 5139. |            C00012784    erythromycin          S        srs |
 5201. |     H113640238-143-1    tetracycline          S        rrr |
 5215. |  H102820334-277-G1-2     clindamycin          S        rrr |
       |------------------------------------------------------------|
 5275. |            C00001277      penicillin          S        rrr |
 5301. |     H104600048-190-2     clindamycin          S        rrr |
 5307. |            C00003385    erythromycin          S        srs |
 5341. |     H110820268-195-2    erythromycin          S        rrr |
 5582. |            C00003158    erythromycin          S        srs |
       |------------------------------------------------------------|
 5674. |     RH08000028-150-1    tetracycline          S        rrr |
 5812. |     H113640238-143-1     clindamycin          S        rrr |
 5881. |            C00003377    tetracycline          S        srs |
 5919. |            C00001111      penicillin          S        rrr |
 6290. |            C00003395   ciprofloxacin          S        rrr |
       |------------------------------------------------------------|
 6340. |     H113000047-465-2     clindamycin          S        rrr |
 6422. |     RH10000448-161-1     clindamycin          S        rrr |
 6517. |     H110300192-447-1     clindamycin          S        rrr |
 6710. |            C00012749    erythromycin          S        rrs |
 6743. |            C00001182      penicillin          S        rrr |
       |------------------------------------------------------------|
 6787. |     H111740190-456-2      penicillin          S        rrr |
 6892. |            C00001241      penicillin          S        rrr |
 6893. |            C00001400   ciprofloxacin          S        rrr |
 6959. |     RH09000011-151-1      penicillin          S        rrr |
 6992. |     RH09000012-153-1    tetracycline          S        rrr |
       |------------------------------------------------------------|
 7060. |            C00001222     methicillin          S        rrr |
 7102. |            C00001217      penicillin          S        rrr |
 7127. |            C00001142      penicillin          S        rrr |
 7219. |            C00001189    erythromycin          S        rrr |
 7377. |            C00012796    tetracycline          S        rrr |
       |------------------------------------------------------------|
 7405. |            C00001387       mupirocin          S        rrr |
 7457. |            C00003332     fusidicacid          S        rrs |
 7491. |            C00001158      penicillin          S        rrr |
 7504. |     H110940110-451-1     clindamycin          S        rrr |
 7560. |  H104340409-219-E0-2     clindamycin          S        rrr |
       |------------------------------------------------------------|
 7612. |  RH12000505-239-A0-2    tetracycline          S        srs |
 7647. |            C00003248   ciprofloxacin          S        srs |
 7680. |            C00001387    erythromycin          S        srs |
 7780. |            C00001124      penicillin          S        rrr |
 7867. |     RH11000301-155-1    erythromycin          S        rrs |
       |------------------------------------------------------------|
 7911. |            C00008984    erythromycin          S        rrr |
 8010. |            C00012754      penicillin          S        rrr |
 8145. |            C00001080    erythromycin          S        rrr |
 8244. |     H103440108-442-2     clindamycin          S        rrr |
 8449. |            C00001144      penicillin          S        rrr |
       |------------------------------------------------------------|
 8515. |     H113640238-143-1     fusidicacid          S        rrr |
 8557. | H124420844-355-E10-2    erythromycin          S        rrr |
 8595. |            C00001199      penicillin          S        rrr |
 8663. |     RH11000301-155-1     clindamycin          S        rrs |
 8667. |     H100200151-169-2    tetracycline          S        rrs |
       |------------------------------------------------------------|
 8679. |     RH10000448-161-1       mupirocin          S        rss |
 8719. |  H093620523-269-G1-2      penicillin          S        rrr |
 8806. |     H112540036-142-1     clindamycin          S        rrr |
 8856. |     RH10000292-140-1      penicillin          S        rrr |
 9020. |     H121320081-505-1       mupirocin          S        rss |
       |------------------------------------------------------------|
 9168. |     H113140144-468-2     clindamycin          S        rrr |
 9206. |     H110820268-195-2     clindamycin          S        rrr |
 9311. |            C00001112      penicillin          S        rrr |
 9354. |     RH09000011-151-1    tetracycline          S        rrr |
 9625. |     RH12000540-156-1     clindamycin          S        rrs |
       |------------------------------------------------------------|
 9719. |     H121340220-509-1     fusidicacid          S        rrr |
 9900. |     H122880144-207-1      penicillin          S        rrs |
 9917. |     H120980139-387-2      penicillin          S        rrr |
 9969. |     RH11000301-155-1    tetracycline          S        rrs |
10211. |            C00001192      penicillin          S        rrr |
       |------------------------------------------------------------|
10228. |            C00001128     fusidicacid          S        rrr |
10433. |     RH12000540-156-1    erythromycin          S        rrs |
10437. |     H124940430-401-1     methicillin          S        rrr |
10491. |            C00003301    tetracycline          S        srs |
10532. |     RH08000028-150-1      penicillin          S        srs |
       |------------------------------------------------------------|
10541. |     RH08000028-150-1     clindamycin          S        rrr |
10662. |     H113640238-143-1      gentamicin          S        rrr |
10695. | RH12000344-305-C04-2      penicillin          S        rrr |
10715. |     H121120058-504-1     fusidicacid          S        rrr |
10819. |            C00001093      penicillin          S        rrr |
       |------------------------------------------------------------|
10935. |            C00012793     fusidicacid          S        rrr |
11019. |            C00001080      penicillin          S        rrr |
11105. |            C00001194      penicillin          S        rrr |
11135. |     H111640001-197-2     clindamycin          S        srs |
11195. |            C00012749      penicillin          S        srs |
       |------------------------------------------------------------|
11217. |            C00008638    erythromycin          S        rrs |
11272. |     H110520238-116-2     clindamycin          S        rrr |
11298. |     H124860349-210-1     clindamycin          S        srs |
11509. |  H103300404-218-D0-2     clindamycin          S        rrr |
11667. |     H101020134-173-2     clindamycin          S        rrr |
       |------------------------------------------------------------|
11748. |            C00008960    tetracycline          S        srs |
11792. |  RH12000505-239-A0-2     fusidicacid          S        srs |
11907. |     H104460171-189-2     clindamycin          S        rrr |
12059. |            C00001231      penicillin          S        rrr |
12094. |  H103300404-218-D0-2    erythromycin          S        rrr |
       |------------------------------------------------------------|
12140. |            C00003292    erythromycin          S        srs |
12148. |            C00013249      penicillin          S        rrr |
12190. |     H110740135-193-2      rifampicin          S        srs |
12840. |  H111220168-221-G0-2     clindamycin          S        rrr |
12959. |            C00013228      penicillin          S        rrr |
       |------------------------------------------------------------|
12997. | RH12000342-303-A04-2      penicillin          S        rrr |
13046. |            C00003144      penicillin          S        srs |
13066. |     H124860349-210-1    erythromycin          S        srs |
13448. |     H121120058-504-1       mupirocin          S        rrr |
13647. |     H110300192-447-1       mupirocin          S        rrr |
       |------------------------------------------------------------|
13673. |            C00001092      penicillin          S        rrr |
13834. |     RH10000448-161-1    erythromycin          S        rrr |
13853. |            C00001104      penicillin          S        rrr |
14004. |            C00000820      rifampicin          S        rrr |
14007. |            C00012780    erythromycin          S        rrs |
       |------------------------------------------------------------|
14032. | H104380040-330-D07-2     clindamycin          S        rrr |
14085. |            C00001205      penicillin          S        rrr |
14331. |            C00003386   ciprofloxacin          S        rrr |
14407. |            C00003355    erythromycin          S        srs |
14461. |     RH10000448-161-1      gentamicin          S        rrr |
       +------------------------------------------------------------+

. sort gold valueall sample site

. 
. noi list sample site gold valueall if agree!=1

       +------------------------------------------------------------+
       |               sample            site   goldst~d   valueall |
       |------------------------------------------------------------|
 2721. |            C00001079      penicillin          R        rrs |
 2722. |            C00001091      penicillin          R        rrs |
 2723. |            C00003302     fusidicacid          R        rrs |
 2724. |            C00003303     fusidicacid          R        rrs |
 2725. |     H092520302-216-1      gentamicin          R        rrs |
       |------------------------------------------------------------|
 2726. |     H092520302-216-1     methicillin          R        rrs |
 2727. |  H094920323-271-A1-2     methicillin          R        rrs |
 2728. |     H105020486-191-2     fusidicacid          R        rrs |
 2729. |  RH10000375-235-E0-2    tetracycline          R        rrs |
 2730. |            C00003130      rifampicin          R        rsr |
       |------------------------------------------------------------|
 2731. | H111960080-332-F07-2   ciprofloxacin          R        rsr |
 2732. | H122560310-348-F09-2   ciprofloxacin          R        rsr |
 2733. |            C00003340     fusidicacid          R        srs |
 2734. |            C00003351     fusidicacid          R        srs |
 2735. |     RH11000301-155-1      gentamicin          R        srs |
       |------------------------------------------------------------|
 2736. |     RH12000540-156-1      penicillin          R        srs |
 2737. |            C00001092   ciprofloxacin          R        sss |
 2738. |            C00001105   ciprofloxacin          R        sss |
 2739. |            C00001109   ciprofloxacin          R        sss |
 2740. |            C00001115   ciprofloxacin          R        sss |
       |------------------------------------------------------------|
 2741. |            C00001115      gentamicin          R        sss |
 2742. |            C00001115     methicillin          R        sss |
 2743. |            C00001147    erythromycin          R        sss |
 2744. |            C00001147      penicillin          R        sss |
 2745. |            C00001162   ciprofloxacin          R        sss |
       |------------------------------------------------------------|
 2746. |            C00001162     clindamycin          R        sss |
 2747. |            C00001162    erythromycin          R        sss |
 2748. |            C00001162     methicillin          R        sss |
 2749. |            C00001224     clindamycin          R        sss |
 2750. |            C00001224    erythromycin          R        sss |
       |------------------------------------------------------------|
 2751. |            C00001259     fusidicacid          R        sss |
 2752. |            C00001276     fusidicacid          R        sss |
 2753. |            C00001440   ciprofloxacin          R        sss |
 2754. |            C00001442   ciprofloxacin          R        sss |
 2755. |            C00001443   ciprofloxacin          R        sss |
       |------------------------------------------------------------|
 2756. |            C00003115   ciprofloxacin          R        sss |
 2757. |            C00003115     methicillin          R        sss |
 2758. |            C00003115      rifampicin          R        sss |
 2759. |            C00003170   ciprofloxacin          R        sss |
 2760. |            C00003175   ciprofloxacin          R        sss |
       |------------------------------------------------------------|
 2761. |            C00003207     fusidicacid          R        sss |
 2762. |            C00003265     fusidicacid          R        sss |
 2763. |            C00003324      penicillin          R        sss |
 2764. |            C00003375    trimethoprim          R        sss |
 2765. |            C00003376    trimethoprim          R        sss |
       |------------------------------------------------------------|
 2766. |            C00003377    trimethoprim          R        sss |
 2767. |            C00003396    trimethoprim          R        sss |
 2768. |            C00003397      penicillin          R        sss |
 2769. |            C00003404      penicillin          R        sss |
 2770. |            C00003404    trimethoprim          R        sss |
       |------------------------------------------------------------|
 2771. |            C00003420    erythromycin          R        sss |
 2772. |            C00009021   ciprofloxacin          R        sss |
 2773. |            C00009033   ciprofloxacin          R        sss |
 2774. |            C00012780      penicillin          R        sss |
 2775. |            C00013185   ciprofloxacin          R        sss |
       |------------------------------------------------------------|
 2776. |            C00013232      penicillin          R        sss |
 2777. |            C00013331      gentamicin          R        sss |
 2778. |  H071160354-264-B1-2    erythromycin          R        sss |
 2779. |  H071160354-264-B1-2     fusidicacid          R        sss |
 2780. |  H071160354-264-B1-2    trimethoprim          R        sss |
       |------------------------------------------------------------|
 2781. |  H092820427-242-D0-2      gentamicin          R        sss |
 2782. |  H100180330-243-E0-2      gentamicin          R        sss |
 2783. |     H100600212-171-2      gentamicin          R        sss |
 2784. |     H101520278-175-2      gentamicin          R        sss |
 2785. |     H102380070-178-2      gentamicin          R        sss |
       |------------------------------------------------------------|
 2786. |     H102940768-182-2     fusidicacid          R        sss |
 2787. |     H103260058-185-2     fusidicacid          R        sss |
 2788. |  H103300404-218-D0-2     methicillin          R        sss |
 2789. |  H103360314-241-C0-2      gentamicin          R        sss |
 2790. | H104040516-329-C07-2     fusidicacid          R        sss |
       |------------------------------------------------------------|
 2791. | H104040516-329-C07-2    tetracycline          R        sss |
 2792. |  H104340409-219-E0-2      penicillin          R        sss |
 2793. |     H110960065-452-1     fusidicacid          R        sss |
 2794. |     H111820058-457-2     fusidicacid          R        sss |
 2795. |     H112540036-142-1      gentamicin          R        sss |
       |------------------------------------------------------------|
 2796. |     H113080385-467-2      penicillin          R        sss |
 2797. |     H113140144-468-2     methicillin          R        sss |
 2798. |     H113140166-125-2      gentamicin          R        sss |
 2799. |     H113140166-125-2    tetracycline          R        sss |
 2800. |     H113540198-126-2    tetracycline          R        sss |
       |------------------------------------------------------------|
 2801. |  H113640207-252-F0-2      gentamicin          R        sss |
 2802. |  H113800363-253-G0-2     clindamycin          R        sss |
 2803. |  H113800363-253-G0-2      gentamicin          R        sss |
 2804. |  H113840385-254-H0-2      gentamicin          R        sss |
 2805. |  H114160372-256-B1-2     fusidicacid          R        sss |
       |------------------------------------------------------------|
 2806. |     H120860086-386-2     fusidicacid          R        sss |
 2807. |     H120860086-386-2    tetracycline          R        sss |
 2808. |     H122140282-391-2   ciprofloxacin          R        sss |
 2809. |     H122640061-512-1     fusidicacid          R        sss |
 2810. |     H122640061-512-1      rifampicin          R        sss |
       |------------------------------------------------------------|
 2811. |     H123100270-554-1     clindamycin          R        sss |
 2812. |     H123100270-554-1    erythromycin          R        sss |
 2813. |     H124480843-137-1      gentamicin          R        sss |
 2814. |     H124860349-210-1     methicillin          R        sss |
 2815. |     H133180046-621-1      gentamicin          R        sss |
       |------------------------------------------------------------|
 2816. |     H133520197-646-1      gentamicin          R        sss |
 2817. |     H133520198-647-1      gentamicin          R        sss |
 2818. |     H133520198-647-1    tetracycline          R        sss |
 2819. |     H133760113-576-1     clindamycin          R        sss |
 2820. |     RH09000011-151-1      gentamicin          R        sss |
       |------------------------------------------------------------|
 2821. |     RH09000012-153-1      gentamicin          R        sss |
 2822. | RH12000362-323-E06-2     methicillin          R        sss |
 2823. |     RH12000363-423-2      penicillin          R        sss |
 2824. |     RH12000364-424-2      penicillin          R        sss |
 2825. |     RH12000540-156-1     methicillin          R        sss |
       |------------------------------------------------------------|
 2826. |            C00000820      rifampicin          S        rrr |
 2827. |            C00001080   ciprofloxacin          S        rrr |
 2828. |            C00001080    erythromycin          S        rrr |
 2829. |            C00001080     methicillin          S        rrr |
 2830. |            C00001080      penicillin          S        rrr |
       |------------------------------------------------------------|
 2831. |            C00001092      penicillin          S        rrr |
 2832. |            C00001093      penicillin          S        rrr |
 2833. |            C00001104      penicillin          S        rrr |
 2834. |            C00001111      penicillin          S        rrr |
 2835. |            C00001112      penicillin          S        rrr |
       |------------------------------------------------------------|
 2836. |            C00001124      penicillin          S        rrr |
 2837. |            C00001128     fusidicacid          S        rrr |
 2838. |            C00001142      penicillin          S        rrr |
 2839. |            C00001144      penicillin          S        rrr |
 2840. |            C00001148      penicillin          S        rrr |
       |------------------------------------------------------------|
 2841. |            C00001158      penicillin          S        rrr |
 2842. |            C00001182      penicillin          S        rrr |
 2843. |            C00001189    erythromycin          S        rrr |
 2844. |            C00001192      penicillin          S        rrr |
 2845. |            C00001194      penicillin          S        rrr |
       |------------------------------------------------------------|
 2846. |            C00001199      penicillin          S        rrr |
 2847. |            C00001203      penicillin          S        rrr |
 2848. |            C00001205      penicillin          S        rrr |
 2849. |            C00001217      penicillin          S        rrr |
 2850. |            C00001222     methicillin          S        rrr |
       |------------------------------------------------------------|
 2851. |            C00001231      penicillin          S        rrr |
 2852. |            C00001241      penicillin          S        rrr |
 2853. |            C00001247    tetracycline          S        rrr |
 2854. |            C00001266      penicillin          S        rrr |
 2855. |            C00001277      penicillin          S        rrr |
       |------------------------------------------------------------|
 2856. |            C00001387       mupirocin          S        rrr |
 2857. |            C00001400   ciprofloxacin          S        rrr |
 2858. |            C00001405       mupirocin          S        rrr |
 2859. |            C00003247     methicillin          S        rrr |
 2860. |            C00003272    erythromycin          S        rrr |
       |------------------------------------------------------------|
 2861. |            C00003374     fusidicacid          S        rrr |
 2862. |            C00003386   ciprofloxacin          S        rrr |
 2863. |            C00003395   ciprofloxacin          S        rrr |
 2864. |            C00008984    erythromycin          S        rrr |
 2865. |            C00012754      penicillin          S        rrr |
       |------------------------------------------------------------|
 2866. |            C00012793     fusidicacid          S        rrr |
 2867. |            C00012796    tetracycline          S        rrr |
 2868. |            C00013181     fusidicacid          S        rrr |
 2869. |            C00013228      penicillin          S        rrr |
 2870. |            C00013249      penicillin          S        rrr |
       |------------------------------------------------------------|
 2871. |  H093620523-269-G1-2      penicillin          S        rrr |
 2872. |     H101020134-173-2     clindamycin          S        rrr |
 2873. |     H101020134-173-2    erythromycin          S        rrr |
 2874. |  H102820334-277-G1-2     clindamycin          S        rrr |
 2875. |  H103300404-218-D0-2     clindamycin          S        rrr |
       |------------------------------------------------------------|
 2876. |  H103300404-218-D0-2    erythromycin          S        rrr |
 2877. |     H103440108-442-2     clindamycin          S        rrr |
 2878. |  H104340409-219-E0-2     clindamycin          S        rrr |
 2879. | H104380040-330-D07-2     clindamycin          S        rrr |
 2880. |     H104460171-189-2     clindamycin          S        rrr |
       |------------------------------------------------------------|
 2881. |     H104600048-190-2     clindamycin          S        rrr |
 2882. |     H110300192-447-1     clindamycin          S        rrr |
 2883. |     H110300192-447-1       mupirocin          S        rrr |
 2884. |     H110520238-116-2     clindamycin          S        rrr |
 2885. |     H110820268-195-2     clindamycin          S        rrr |
       |------------------------------------------------------------|
 2886. |     H110820268-195-2    erythromycin          S        rrr |
 2887. |     H110940110-451-1     clindamycin          S        rrr |
 2888. |     H111200066-118-2     clindamycin          S        rrr |
 2889. |  H111220168-221-G0-2     clindamycin          S        rrr |
 2890. |     H111740190-456-2      penicillin          S        rrr |
       |------------------------------------------------------------|
 2891. |     H111820165-458-2     clindamycin          S        rrr |
 2892. |     H112540036-142-1     clindamycin          S        rrr |
 2893. |     H112540036-142-1    erythromycin          S        rrr |
 2894. |     H113000047-465-2     clindamycin          S        rrr |
 2895. |     H113140144-468-2     clindamycin          S        rrr |
       |------------------------------------------------------------|
 2896. | H113140175-334-H07-2     clindamycin          S        rrr |
 2897. |     H113640238-143-1     clindamycin          S        rrr |
 2898. |     H113640238-143-1     fusidicacid          S        rrr |
 2899. |     H113640238-143-1      gentamicin          S        rrr |
 2900. |     H113640238-143-1    tetracycline          S        rrr |
       |------------------------------------------------------------|
 2901. |     H120980139-387-2      penicillin          S        rrr |
 2902. |     H121120058-504-1     fusidicacid          S        rrr |
 2903. |     H121120058-504-1      gentamicin          S        rrr |
 2904. |     H121120058-504-1     methicillin          S        rrr |
 2905. |     H121120058-504-1       mupirocin          S        rrr |
       |------------------------------------------------------------|
 2906. |     H121340220-509-1     fusidicacid          S        rrr |
 2907. | H124420844-355-E10-2    erythromycin          S        rrr |
 2908. |     H124940430-401-1     methicillin          S        rrr |
 2909. |  H125000105-229-G0-2       mupirocin          S        rrr |
 2910. |     H125000105-833-2       mupirocin          S        rrr |
       |------------------------------------------------------------|
 2911. |     RH08000028-150-1     clindamycin          S        rrr |
 2912. |     RH08000028-150-1    erythromycin          S        rrr |
 2913. |     RH08000028-150-1    tetracycline          S        rrr |
 2914. |     RH09000011-151-1      penicillin          S        rrr |
 2915. |     RH09000011-151-1    tetracycline          S        rrr |
       |------------------------------------------------------------|
 2916. |     RH09000012-153-1    tetracycline          S        rrr |
 2917. |     RH10000292-140-1      penicillin          S        rrr |
 2918. |     RH10000448-161-1     clindamycin          S        rrr |
 2919. |     RH10000448-161-1    erythromycin          S        rrr |
 2920. |     RH10000448-161-1      gentamicin          S        rrr |
       |------------------------------------------------------------|
 2921. | RH12000342-303-A04-2      penicillin          S        rrr |
 2922. | RH12000344-305-C04-2      penicillin          S        rrr |
 2923. |            C00001446    erythromycin          S        rrs |
 2924. |            C00003332     fusidicacid          S        rrs |
 2925. |            C00003385    tetracycline          S        rrs |
       |------------------------------------------------------------|
 2926. |            C00008638    erythromycin          S        rrs |
 2927. |            C00012749    erythromycin          S        rrs |
 2928. |            C00012780    erythromycin          S        rrs |
 2929. |     H100200151-169-2    tetracycline          S        rrs |
 2930. |     H122880144-207-1      penicillin          S        rrs |
       |------------------------------------------------------------|
 2931. |     RH11000301-155-1     clindamycin          S        rrs |
 2932. |     RH11000301-155-1    erythromycin          S        rrs |
 2933. |     RH11000301-155-1    tetracycline          S        rrs |
 2934. |     RH12000540-156-1     clindamycin          S        rrs |
 2935. |     RH12000540-156-1    erythromycin          S        rrs |
       |------------------------------------------------------------|
 2936. |            C00001240    trimethoprim          S        rsr |
 2937. |     H121320081-505-1       mupirocin          S        rss |
 2938. |     RH10000448-161-1       mupirocin          S        rss |
 2939. |            C00001387    erythromycin          S        srs |
 2940. |            C00003144      penicillin          S        srs |
       |------------------------------------------------------------|
 2941. |            C00003158    erythromycin          S        srs |
 2942. |            C00003248   ciprofloxacin          S        srs |
 2943. |            C00003290    erythromycin          S        srs |
 2944. |            C00003292    erythromycin          S        srs |
 2945. |            C00003301    tetracycline          S        srs |
       |------------------------------------------------------------|
 2946. |            C00003355    erythromycin          S        srs |
 2947. |            C00003377    tetracycline          S        srs |
 2948. |            C00003385    erythromycin          S        srs |
 2949. |            C00003419    tetracycline          S        srs |
 2950. |            C00008960    tetracycline          S        srs |
       |------------------------------------------------------------|
 2951. |            C00012749      penicillin          S        srs |
 2952. |            C00012784    erythromycin          S        srs |
 2953. |     H110740135-193-2      rifampicin          S        srs |
 2954. |     H111640001-197-2     clindamycin          S        srs |
 2955. |     H121320081-505-1      gentamicin          S        srs |
       |------------------------------------------------------------|
 2956. |     H124860349-210-1     clindamycin          S        srs |
 2957. |     H124860349-210-1    erythromycin          S        srs |
 2958. |     RH08000028-150-1      penicillin          S        srs |
 2959. |  RH12000505-239-A0-2     fusidicacid          S        srs |
 2960. |  RH12000505-239-A0-2    tetracycline          S        srs |
       +------------------------------------------------------------+

. sort site gold valueall 

. 
. noi list sample site gold valueall if agree!=1

       +------------------------------------------------------------+
       |               sample            site   goldst~d   valueall |
       |------------------------------------------------------------|
  300. | H122560310-348-F09-2   ciprofloxacin          R        rsr |
  301. | H111960080-332-F07-2   ciprofloxacin          R        rsr |
  302. |            C00009021   ciprofloxacin          R        sss |
  303. |            C00013185   ciprofloxacin          R        sss |
  304. |            C00001105   ciprofloxacin          R        sss |
       |------------------------------------------------------------|
  305. |            C00001440   ciprofloxacin          R        sss |
  306. |            C00003175   ciprofloxacin          R        sss |
  307. |            C00001162   ciprofloxacin          R        sss |
  308. |            C00009033   ciprofloxacin          R        sss |
  309. |            C00001443   ciprofloxacin          R        sss |
       |------------------------------------------------------------|
  310. |            C00001442   ciprofloxacin          R        sss |
  311. |            C00003170   ciprofloxacin          R        sss |
  312. |            C00003115   ciprofloxacin          R        sss |
  313. |            C00001115   ciprofloxacin          R        sss |
  314. |            C00001109   ciprofloxacin          R        sss |
       |------------------------------------------------------------|
  315. |     H122140282-391-2   ciprofloxacin          R        sss |
  316. |            C00001092   ciprofloxacin          R        sss |
  317. |            C00001400   ciprofloxacin          S        rrr |
  318. |            C00001080   ciprofloxacin          S        rrr |
  319. |            C00003386   ciprofloxacin          S        rrr |
       |------------------------------------------------------------|
  320. |            C00003395   ciprofloxacin          S        rrr |
  321. |            C00003248   ciprofloxacin          S        srs |
 1533. |            C00001224     clindamycin          R        sss |
 1534. |     H123100270-554-1     clindamycin          R        sss |
 1535. |            C00001162     clindamycin          R        sss |
       |------------------------------------------------------------|
 1536. |     H133760113-576-1     clindamycin          R        sss |
 1537. |  H113800363-253-G0-2     clindamycin          R        sss |
 1538. |  H103300404-218-D0-2     clindamycin          S        rrr |
 1539. | H113140175-334-H07-2     clindamycin          S        rrr |
 1540. |     H113640238-143-1     clindamycin          S        rrr |
       |------------------------------------------------------------|
 1541. |  H104340409-219-E0-2     clindamycin          S        rrr |
 1542. | H104380040-330-D07-2     clindamycin          S        rrr |
 1543. |     H104600048-190-2     clindamycin          S        rrr |
 1544. |     H110820268-195-2     clindamycin          S        rrr |
 1545. |     H112540036-142-1     clindamycin          S        rrr |
       |------------------------------------------------------------|
 1546. |     H110940110-451-1     clindamycin          S        rrr |
 1547. |     H113140144-468-2     clindamycin          S        rrr |
 1548. |     H101020134-173-2     clindamycin          S        rrr |
 1549. |     RH10000448-161-1     clindamycin          S        rrr |
 1550. |  H111220168-221-G0-2     clindamycin          S        rrr |
       |------------------------------------------------------------|
 1551. |     H103440108-442-2     clindamycin          S        rrr |
 1552. |     H111200066-118-2     clindamycin          S        rrr |
 1553. |     H110300192-447-1     clindamycin          S        rrr |
 1554. |     RH08000028-150-1     clindamycin          S        rrr |
 1555. |     H104460171-189-2     clindamycin          S        rrr |
       |------------------------------------------------------------|
 1556. |     H111820165-458-2     clindamycin          S        rrr |
 1557. |  H102820334-277-G1-2     clindamycin          S        rrr |
 1558. |     H113000047-465-2     clindamycin          S        rrr |
 1559. |     H110520238-116-2     clindamycin          S        rrr |
 1560. |     RH12000540-156-1     clindamycin          S        rrs |
       |------------------------------------------------------------|
 1561. |     RH11000301-155-1     clindamycin          S        rrs |
 1562. |     H124860349-210-1     clindamycin          S        srs |
 1563. |     H111640001-197-2     clindamycin          S        srs |
 2159. |            C00001224    erythromycin          R        sss |
 2160. |  H071160354-264-B1-2    erythromycin          R        sss |
       |------------------------------------------------------------|
 2161. |            C00001147    erythromycin          R        sss |
 2162. |            C00003420    erythromycin          R        sss |
 2163. |            C00001162    erythromycin          R        sss |
 2164. |     H123100270-554-1    erythromycin          R        sss |
 2165. |     RH10000448-161-1    erythromycin          S        rrr |
       |------------------------------------------------------------|
 2166. |            C00001080    erythromycin          S        rrr |
 2167. |     H110820268-195-2    erythromycin          S        rrr |
 2168. |            C00003272    erythromycin          S        rrr |
 2169. | H124420844-355-E10-2    erythromycin          S        rrr |
 2170. |     H112540036-142-1    erythromycin          S        rrr |
       |------------------------------------------------------------|
 2171. |     RH08000028-150-1    erythromycin          S        rrr |
 2172. |     H101020134-173-2    erythromycin          S        rrr |
 2173. |            C00008984    erythromycin          S        rrr |
 2174. |            C00001189    erythromycin          S        rrr |
 2175. |  H103300404-218-D0-2    erythromycin          S        rrr |
       |------------------------------------------------------------|
 2176. |            C00012780    erythromycin          S        rrs |
 2177. |            C00008638    erythromycin          S        rrs |
 2178. |            C00012749    erythromycin          S        rrs |
 2179. |     RH11000301-155-1    erythromycin          S        rrs |
 2180. |     RH12000540-156-1    erythromycin          S        rrs |
       |------------------------------------------------------------|
 2181. |            C00001446    erythromycin          S        rrs |
 2182. |            C00003385    erythromycin          S        srs |
 2183. |     H124860349-210-1    erythromycin          S        srs |
 2184. |            C00003292    erythromycin          S        srs |
 2185. |            C00003355    erythromycin          S        srs |
       |------------------------------------------------------------|
 2186. |            C00001387    erythromycin          S        srs |
 2187. |            C00012784    erythromycin          S        srs |
 2188. |            C00003158    erythromycin          S        srs |
 2189. |            C00003290    erythromycin          S        srs |
 3333. |            C00003302     fusidicacid          R        rrs |
       |------------------------------------------------------------|
 3334. |            C00003303     fusidicacid          R        rrs |
 3335. |     H105020486-191-2     fusidicacid          R        rrs |
 3336. |            C00003351     fusidicacid          R        srs |
 3337. |            C00003340     fusidicacid          R        srs |
 3338. | H104040516-329-C07-2     fusidicacid          R        sss |
       |------------------------------------------------------------|
 3339. |            C00001276     fusidicacid          R        sss |
 3340. |     H110960065-452-1     fusidicacid          R        sss |
 3341. |     H102940768-182-2     fusidicacid          R        sss |
 3342. |  H071160354-264-B1-2     fusidicacid          R        sss |
 3343. |     H103260058-185-2     fusidicacid          R        sss |
       |------------------------------------------------------------|
 3344. |     H111820058-457-2     fusidicacid          R        sss |
 3345. |     H122640061-512-1     fusidicacid          R        sss |
 3346. |            C00001259     fusidicacid          R        sss |
 3347. |     H120860086-386-2     fusidicacid          R        sss |
 3348. |            C00003207     fusidicacid          R        sss |
       |------------------------------------------------------------|
 3349. |  H114160372-256-B1-2     fusidicacid          R        sss |
 3350. |            C00003265     fusidicacid          R        sss |
 3351. |            C00001128     fusidicacid          S        rrr |
 3352. |            C00003374     fusidicacid          S        rrr |
 3353. |     H113640238-143-1     fusidicacid          S        rrr |
       |------------------------------------------------------------|
 3354. |            C00013181     fusidicacid          S        rrr |
 3355. |     H121340220-509-1     fusidicacid          S        rrr |
 3356. |            C00012793     fusidicacid          S        rrr |
 3357. |     H121120058-504-1     fusidicacid          S        rrr |
 3358. |            C00003332     fusidicacid          S        rrs |
       |------------------------------------------------------------|
 3359. |  RH12000505-239-A0-2     fusidicacid          S        srs |
 4635. |     H092520302-216-1      gentamicin          R        rrs |
 4636. |     RH11000301-155-1      gentamicin          R        srs |
 4637. |     H113140166-125-2      gentamicin          R        sss |
 4638. |  H113640207-252-F0-2      gentamicin          R        sss |
       |------------------------------------------------------------|
 4639. |     H100600212-171-2      gentamicin          R        sss |
 4640. |     H112540036-142-1      gentamicin          R        sss |
 4641. |  H113800363-253-G0-2      gentamicin          R        sss |
 4642. |     H133520198-647-1      gentamicin          R        sss |
 4643. |  H113840385-254-H0-2      gentamicin          R        sss |
       |------------------------------------------------------------|
 4644. |     RH09000011-151-1      gentamicin          R        sss |
 4645. |     H124480843-137-1      gentamicin          R        sss |
 4646. |            C00001115      gentamicin          R        sss |
 4647. |     H133520197-646-1      gentamicin          R        sss |
 4648. |            C00013331      gentamicin          R        sss |
       |------------------------------------------------------------|
 4649. |  H100180330-243-E0-2      gentamicin          R        sss |
 4650. |     H102380070-178-2      gentamicin          R        sss |
 4651. |     H133180046-621-1      gentamicin          R        sss |
 4652. |     RH09000012-153-1      gentamicin          R        sss |
 4653. |     H101520278-175-2      gentamicin          R        sss |
       |------------------------------------------------------------|
 4654. |  H103360314-241-C0-2      gentamicin          R        sss |
 4655. |  H092820427-242-D0-2      gentamicin          R        sss |
 4656. |     RH10000448-161-1      gentamicin          S        rrr |
 4657. |     H121120058-504-1      gentamicin          S        rrr |
 4658. |     H113640238-143-1      gentamicin          S        rrr |
       |------------------------------------------------------------|
 4659. |     H121320081-505-1      gentamicin          S        srs |
 6316. |  H094920323-271-A1-2     methicillin          R        rrs |
 6317. |     H092520302-216-1     methicillin          R        rrs |
 6318. | RH12000362-323-E06-2     methicillin          R        sss |
 6319. |            C00001115     methicillin          R        sss |
       |------------------------------------------------------------|
 6320. |            C00003115     methicillin          R        sss |
 6321. |     H113140144-468-2     methicillin          R        sss |
 6322. |     H124860349-210-1     methicillin          R        sss |
 6323. |            C00001162     methicillin          R        sss |
 6324. |  H103300404-218-D0-2     methicillin          R        sss |
       |------------------------------------------------------------|
 6325. |     RH12000540-156-1     methicillin          R        sss |
 6326. |     H121120058-504-1     methicillin          S        rrr |
 6327. |            C00003247     methicillin          S        rrr |
 6328. |            C00001080     methicillin          S        rrr |
 6329. |     H124940430-401-1     methicillin          S        rrr |
       |------------------------------------------------------------|
 6330. |            C00001222     methicillin          S        rrr |
 7294. |     H125000105-833-2       mupirocin          S        rrr |
 7295. |            C00001387       mupirocin          S        rrr |
 7296. |     H121120058-504-1       mupirocin          S        rrr |
 7297. |            C00001405       mupirocin          S        rrr |
       |------------------------------------------------------------|
 7298. |  H125000105-229-G0-2       mupirocin          S        rrr |
 7299. |     H110300192-447-1       mupirocin          S        rrr |
 7300. |     RH10000448-161-1       mupirocin          S        rss |
 7301. |     H121320081-505-1       mupirocin          S        rss |
 9433. |            C00001091      penicillin          R        rrs |
       |------------------------------------------------------------|
 9434. |            C00001079      penicillin          R        rrs |
 9435. |     RH12000540-156-1      penicillin          R        srs |
 9436. |            C00013232      penicillin          R        sss |
 9437. |     RH12000363-423-2      penicillin          R        sss |
 9438. |            C00003397      penicillin          R        sss |
       |------------------------------------------------------------|
 9439. |            C00001147      penicillin          R        sss |
 9440. |            C00003404      penicillin          R        sss |
 9441. |  H104340409-219-E0-2      penicillin          R        sss |
 9442. |     RH12000364-424-2      penicillin          R        sss |
 9443. |            C00012780      penicillin          R        sss |
       |------------------------------------------------------------|
 9444. |            C00003324      penicillin          R        sss |
 9445. |     H113080385-467-2      penicillin          R        sss |
 9446. |            C00001112      penicillin          S        rrr |
 9447. |            C00001205      penicillin          S        rrr |
 9448. |            C00001231      penicillin          S        rrr |
       |------------------------------------------------------------|
 9449. |            C00001199      penicillin          S        rrr |
 9450. |            C00001266      penicillin          S        rrr |
 9451. | RH12000342-303-A04-2      penicillin          S        rrr |
 9452. |  H093620523-269-G1-2      penicillin          S        rrr |
 9453. |            C00001111      penicillin          S        rrr |
       |------------------------------------------------------------|
 9454. |            C00001158      penicillin          S        rrr |
 9455. |     H120980139-387-2      penicillin          S        rrr |
 9456. |            C00001194      penicillin          S        rrr |
 9457. |            C00013228      penicillin          S        rrr |
 9458. |            C00001124      penicillin          S        rrr |
       |------------------------------------------------------------|
 9459. |     H111740190-456-2      penicillin          S        rrr |
 9460. |            C00001148      penicillin          S        rrr |
 9461. |            C00001277      penicillin          S        rrr |
 9462. |            C00001144      penicillin          S        rrr |
 9463. |            C00001203      penicillin          S        rrr |
       |------------------------------------------------------------|
 9464. |            C00013249      penicillin          S        rrr |
 9465. |            C00001104      penicillin          S        rrr |
 9466. |            C00001092      penicillin          S        rrr |
 9467. |            C00001093      penicillin          S        rrr |
 9468. |            C00001142      penicillin          S        rrr |
       |------------------------------------------------------------|
 9469. |            C00012754      penicillin          S        rrr |
 9470. |            C00001217      penicillin          S        rrr |
 9471. |            C00001192      penicillin          S        rrr |
 9472. |            C00001080      penicillin          S        rrr |
 9473. | RH12000344-305-C04-2      penicillin          S        rrr |
       |------------------------------------------------------------|
 9474. |     RH09000011-151-1      penicillin          S        rrr |
 9475. |     RH10000292-140-1      penicillin          S        rrr |
 9476. |            C00001182      penicillin          S        rrr |
 9477. |            C00001241      penicillin          S        rrr |
 9478. |     H122880144-207-1      penicillin          S        rrs |
       |------------------------------------------------------------|
 9479. |            C00003144      penicillin          S        srs |
 9480. |            C00012749      penicillin          S        srs |
 9481. |     RH08000028-150-1      penicillin          S        srs |
 9700. |            C00003130      rifampicin          R        rsr |
 9701. |            C00003115      rifampicin          R        sss |
       |------------------------------------------------------------|
 9702. |     H122640061-512-1      rifampicin          R        sss |
 9703. |            C00000820      rifampicin          S        rrr |
 9704. |     H110740135-193-2      rifampicin          S        srs |
11162. |  RH10000375-235-E0-2    tetracycline          R        rrs |
11163. |     H113140166-125-2    tetracycline          R        sss |
       |------------------------------------------------------------|
11164. |     H133520198-647-1    tetracycline          R        sss |
11165. | H104040516-329-C07-2    tetracycline          R        sss |
11166. |     H113540198-126-2    tetracycline          R        sss |
11167. |     H120860086-386-2    tetracycline          R        sss |
11168. |            C00012796    tetracycline          S        rrr |
       |------------------------------------------------------------|
11169. |     RH09000011-151-1    tetracycline          S        rrr |
11170. |            C00001247    tetracycline          S        rrr |
11171. |     RH08000028-150-1    tetracycline          S        rrr |
11172. |     H113640238-143-1    tetracycline          S        rrr |
11173. |     RH09000012-153-1    tetracycline          S        rrr |
       |------------------------------------------------------------|
11174. |            C00003385    tetracycline          S        rrs |
11175. |     RH11000301-155-1    tetracycline          S        rrs |
11176. |     H100200151-169-2    tetracycline          S        rrs |
11177. |            C00008960    tetracycline          S        srs |
11178. |  RH12000505-239-A0-2    tetracycline          S        srs |
       |------------------------------------------------------------|
11179. |            C00003419    tetracycline          S        srs |
11180. |            C00003301    tetracycline          S        srs |
11181. |            C00003377    tetracycline          S        srs |
12459. |            C00003376    trimethoprim          R        sss |
12460. |            C00003396    trimethoprim          R        sss |
       |------------------------------------------------------------|
12461. |            C00003404    trimethoprim          R        sss |
12462. |  H071160354-264-B1-2    trimethoprim          R        sss |
12463. |            C00003375    trimethoprim          R        sss |
12464. |            C00003377    trimethoprim          R        sss |
12465. |            C00001240    trimethoprim          S        rsr |
       +------------------------------------------------------------+

. use anti_panel_all, clear

. 
. 
. 
. * in table

. 
. noi tab gold valueall

goldstanda |                             valueall
        rd |       rrr        rrs        rsr        rss        srs        sss |     Total
-----------+------------------------------------------------------------------+----------
         I |         6          0          0          0          0         74 |        80 
        NA |       288          8          0          0          9      1,699 |     2,004 
         R |     2,720          9          3          0          4         89 |     2,825 
         S |        97         13          1          2         22     11,504 |    11,639 
-----------+------------------------------------------------------------------+----------
     Total |     3,111         30          4          2         35     13,366 |    16,548 


. 
. gen agree = (valueall=="rrr")|(valueall=="sss")

. 
. summ agree

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |     16,548    .9957095    .0653636          0          1

. 
. noi di r(sum) " out of " r(N) "results agree between all methods"
16477 out of 16548results agree between all methods

. 
. noi di r(sum)/r(N)*100
99.570945

. 
. noi di "disagreements by site"
disagreements by site

. 
. noi bysort gold: tab site valueall

----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = I

              |       valueall
         site |       rrr        sss |     Total
--------------+----------------------+----------
ciprofloxacin |         1         20 |        21 
  clindamycin |         0          2 |         2 
 erythromycin |         0          1 |         1 
  methicillin |         4         16 |        20 
    mupirocin |         0         24 |        24 
   penicillin |         1          4 |         5 
   rifampicin |         0          1 |         1 
 tetracycline |         0          1 |         1 
 trimethoprim |         0          5 |         5 
--------------+----------------------+----------
        Total |         6         74 |        80 


----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = NA

              |                  valueall
         site |       rrr        rrs        srs        sss |     Total
--------------+--------------------------------------------+----------
ciprofloxacin |         0          0          0          6 |         6 
  clindamycin |       136          5          8        764 |       913 
 erythromycin |         1          0          0          5 |         6 
  fusidicacid |         0          0          0          6 |         6 
   gentamicin |         0          0          0          6 |         6 
  methicillin |         3          0          0          3 |         6 
    mupirocin |         3          0          0        331 |       334 
   penicillin |         4          0          0          1 |         5 
   rifampicin |         0          0          0          6 |         6 
 tetracycline |         3          0          0          3 |         6 
 trimethoprim |       138          3          1        562 |       704 
   vancomycin |         0          0          0          6 |         6 
--------------+--------------------------------------------+----------
        Total |       288          8          9      1,699 |     2,004 


----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = R

              |                        valueall
         site |       rrr        rrs        rsr        srs        sss |     Total
--------------+-------------------------------------------------------+----------
ciprofloxacin |       299          0          2          0         15 |       316 
  clindamycin |       180          0          0          0          5 |       185 
 erythromycin |       342          0          0          0          6 |       348 
  fusidicacid |       144          3          0          2         13 |       162 
   gentamicin |        73          1          0          1         19 |        94 
  methicillin |       381          2          0          0          8 |       391 
    mupirocin |         6          0          0          0          0 |         6 
   penicillin |     1,124          2          0          1         10 |     1,137 
   rifampicin |        22          0          1          0          2 |        25 
 tetracycline |       112          1          0          0          5 |       118 
 trimethoprim |        37          0          0          0          6 |        43 
--------------+-------------------------------------------------------+----------
        Total |     2,720          9          3          4         89 |     2,825 


----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = S

              |                             valueall
         site |       rrr        rrs        rsr        rss        srs        sss |     Total
--------------+------------------------------------------------------------------+----------
ciprofloxacin |         4          0          0          0          1      1,031 |     1,036 
  clindamycin |        22          2          0          0          2        253 |       279 
 erythromycin |        11          6          0          0          8        999 |     1,024 
  fusidicacid |         7          1          0          0          1      1,202 |     1,211 
   gentamicin |         3          0          0          0          1      1,275 |     1,279 
  methicillin |         5          0          0          0          0        957 |       962 
    mupirocin |         6          0          0          2          0      1,007 |     1,015 
   penicillin |        32          1          0          0          3        196 |       232 
   rifampicin |         1          0          0          0          1      1,345 |     1,347 
 tetracycline |         6          3          0          0          5      1,240 |     1,254 
 trimethoprim |         0          0          1          0          0        626 |       627 
   vancomycin |         0          0          0          0          0      1,373 |     1,373 
--------------+------------------------------------------------------------------+----------
        Total |        97         13          1          2         22     11,504 |    11,639 



. 
. 
. 
. noi di "discrenpancies"
discrenpancies

. 
. sort site gold valueall sample site

. 
. noi list sample site valueall if agree!=1

       +-------------------------------------------------+
       |               sample            site   valueall |
       |-------------------------------------------------|
  327. | H111960080-332-F07-2   ciprofloxacin        rsr |
  328. | H122560310-348-F09-2   ciprofloxacin        rsr |
  348. |            C00003248   ciprofloxacin        srs |
 1518. |            C00001446     clindamycin        rrs |
 1519. |            C00003152     clindamycin        rrs |
       |-------------------------------------------------|
 1520. |            C00008638     clindamycin        rrs |
 1521. |            C00012749     clindamycin        rrs |
 1522. |            C00012780     clindamycin        rrs |
 1523. |            C00001387     clindamycin        srs |
 1524. |            C00003158     clindamycin        srs |
       |-------------------------------------------------|
 1525. |            C00003272     clindamycin        srs |
 1526. |            C00003290     clindamycin        srs |
 1527. |            C00003292     clindamycin        srs |
 1528. |            C00003355     clindamycin        srs |
 1529. |            C00003385     clindamycin        srs |
       |-------------------------------------------------|
 1530. |            C00012784     clindamycin        srs |
 2502. |     RH11000301-155-1     clindamycin        rrs |
 2503. |     RH12000540-156-1     clindamycin        rrs |
 2504. |     H111640001-197-2     clindamycin        srs |
 2505. |     H124860349-210-1     clindamycin        srs |
       |-------------------------------------------------|
 3125. |            C00001446    erythromycin        rrs |
 3126. |            C00008638    erythromycin        rrs |
 3127. |            C00012749    erythromycin        rrs |
 3128. |            C00012780    erythromycin        rrs |
 3129. |     RH11000301-155-1    erythromycin        rrs |
       |-------------------------------------------------|
 3130. |     RH12000540-156-1    erythromycin        rrs |
 3131. |            C00001387    erythromycin        srs |
 3132. |            C00003158    erythromycin        srs |
 3133. |            C00003290    erythromycin        srs |
 3134. |            C00003292    erythromycin        srs |
       |-------------------------------------------------|
 3135. |            C00003355    erythromycin        srs |
 3136. |            C00003385    erythromycin        srs |
 3137. |            C00012784    erythromycin        srs |
 3138. |     H124860349-210-1    erythromycin        srs |
 4288. |            C00003302     fusidicacid        rrs |
       |-------------------------------------------------|
 4289. |            C00003303     fusidicacid        rrs |
 4290. |     H105020486-191-2     fusidicacid        rrs |
 4291. |            C00003340     fusidicacid        srs |
 4292. |            C00003351     fusidicacid        srs |
 4313. |            C00003332     fusidicacid        rrs |
       |-------------------------------------------------|
 4314. |  RH12000505-239-A0-2     fusidicacid        srs |
 5596. |     H092520302-216-1      gentamicin        rrs |
 5597. |     RH11000301-155-1      gentamicin        srs |
 5620. |     H121320081-505-1      gentamicin        srs |
 7303. |     H092520302-216-1     methicillin        rrs |
       |-------------------------------------------------|
 7304. |  H094920323-271-A1-2     methicillin        rrs |
 8645. |     H121320081-505-1       mupirocin        rss |
 8646. |     RH10000448-161-1       mupirocin        rss |
10788. |            C00001079      penicillin        rrs |
10789. |            C00001091      penicillin        rrs |
       |-------------------------------------------------|
10790. |     RH12000540-156-1      penicillin        srs |
10833. |     H122880144-207-1      penicillin        rrs |
10834. |            C00003144      penicillin        srs |
10835. |            C00012749      penicillin        srs |
10836. |     RH08000028-150-1      penicillin        srs |
       |-------------------------------------------------|
11062. |            C00003130      rifampicin        rsr |
11066. |     H110740135-193-2      rifampicin        srs |
12531. |  RH10000375-235-E0-2    tetracycline        rrs |
12543. |            C00003385    tetracycline        rrs |
12544. |     H100200151-169-2    tetracycline        rrs |
       |-------------------------------------------------|
12545. |     RH11000301-155-1    tetracycline        rrs |
12546. |            C00003301    tetracycline        srs |
12547. |            C00003377    tetracycline        srs |
12548. |            C00003419    tetracycline        srs |
12549. |            C00008960    tetracycline        srs |
       |-------------------------------------------------|
12550. |  RH12000505-239-A0-2    tetracycline        srs |
13934. |     H114720434-145-1    trimethoprim        rrs |
13935. |     H121120058-504-1    trimethoprim        rrs |
13936. |     RH11000301-155-1    trimethoprim        rrs |
13937. |     H122880144-207-1    trimethoprim        srs |
       |-------------------------------------------------|
14543. |            C00001240    trimethoprim        rsr |
       +-------------------------------------------------+

. list sample site valueall if agree!=1

       +-------------------------------------------------+
       |               sample            site   valueall |
       |-------------------------------------------------|
  327. | H111960080-332-F07-2   ciprofloxacin        rsr |
  328. | H122560310-348-F09-2   ciprofloxacin        rsr |
  348. |            C00003248   ciprofloxacin        srs |
 1518. |            C00001446     clindamycin        rrs |
 1519. |            C00003152     clindamycin        rrs |
       |-------------------------------------------------|
 1520. |            C00008638     clindamycin        rrs |
 1521. |            C00012749     clindamycin        rrs |
 1522. |            C00012780     clindamycin        rrs |
 1523. |            C00001387     clindamycin        srs |
 1524. |            C00003158     clindamycin        srs |
       |-------------------------------------------------|
 1525. |            C00003272     clindamycin        srs |
 1526. |            C00003290     clindamycin        srs |
 1527. |            C00003292     clindamycin        srs |
 1528. |            C00003355     clindamycin        srs |
 1529. |            C00003385     clindamycin        srs |
       |-------------------------------------------------|
 1530. |            C00012784     clindamycin        srs |
 2502. |     RH11000301-155-1     clindamycin        rrs |
 2503. |     RH12000540-156-1     clindamycin        rrs |
 2504. |     H111640001-197-2     clindamycin        srs |
 2505. |     H124860349-210-1     clindamycin        srs |
       |-------------------------------------------------|
 3125. |            C00001446    erythromycin        rrs |
 3126. |            C00008638    erythromycin        rrs |
 3127. |            C00012749    erythromycin        rrs |
 3128. |            C00012780    erythromycin        rrs |
 3129. |     RH11000301-155-1    erythromycin        rrs |
       |-------------------------------------------------|
 3130. |     RH12000540-156-1    erythromycin        rrs |
 3131. |            C00001387    erythromycin        srs |
 3132. |            C00003158    erythromycin        srs |
 3133. |            C00003290    erythromycin        srs |
 3134. |            C00003292    erythromycin        srs |
       |-------------------------------------------------|
 3135. |            C00003355    erythromycin        srs |
 3136. |            C00003385    erythromycin        srs |
 3137. |            C00012784    erythromycin        srs |
 3138. |     H124860349-210-1    erythromycin        srs |
 4288. |            C00003302     fusidicacid        rrs |
       |-------------------------------------------------|
 4289. |            C00003303     fusidicacid        rrs |
 4290. |     H105020486-191-2     fusidicacid        rrs |
 4291. |            C00003340     fusidicacid        srs |
 4292. |            C00003351     fusidicacid        srs |
 4313. |            C00003332     fusidicacid        rrs |
       |-------------------------------------------------|
 4314. |  RH12000505-239-A0-2     fusidicacid        srs |
 5596. |     H092520302-216-1      gentamicin        rrs |
 5597. |     RH11000301-155-1      gentamicin        srs |
 5620. |     H121320081-505-1      gentamicin        srs |
 7303. |     H092520302-216-1     methicillin        rrs |
       |-------------------------------------------------|
 7304. |  H094920323-271-A1-2     methicillin        rrs |
 8645. |     H121320081-505-1       mupirocin        rss |
 8646. |     RH10000448-161-1       mupirocin        rss |
10788. |            C00001079      penicillin        rrs |
10789. |            C00001091      penicillin        rrs |
       |-------------------------------------------------|
10790. |     RH12000540-156-1      penicillin        srs |
10833. |     H122880144-207-1      penicillin        rrs |
10834. |            C00003144      penicillin        srs |
10835. |            C00012749      penicillin        srs |
10836. |     RH08000028-150-1      penicillin        srs |
       |-------------------------------------------------|
11062. |            C00003130      rifampicin        rsr |
11066. |     H110740135-193-2      rifampicin        srs |
12531. |  RH10000375-235-E0-2    tetracycline        rrs |
12543. |            C00003385    tetracycline        rrs |
12544. |     H100200151-169-2    tetracycline        rrs |
       |-------------------------------------------------|
12545. |     RH11000301-155-1    tetracycline        rrs |
12546. |            C00003301    tetracycline        srs |
12547. |            C00003377    tetracycline        srs |
12548. |            C00003419    tetracycline        srs |
12549. |            C00008960    tetracycline        srs |
       |-------------------------------------------------|
12550. |  RH12000505-239-A0-2    tetracycline        srs |
13934. |     H114720434-145-1    trimethoprim        rrs |
13935. |     H121120058-504-1    trimethoprim        rrs |
13936. |     RH11000301-155-1    trimethoprim        rrs |
13937. |     H122880144-207-1    trimethoprim        srs |
       |-------------------------------------------------|
14543. |            C00001240    trimethoprim        rsr |
       +-------------------------------------------------+

. use pipeline_clean_all_values_wide, clear

. 
. 
. 
. ****************************************

. 
. 
. 
. ******************************************************

. 
. noi di _n(5) _dup(80) "=" _n " Overall summary" _n _dup(80) "="





================================================================================
 Overall summary
================================================================================

. 
. **************************

. 
. noi di  "Recall order is  Mykrobe Mykrobe Genefinder"
Recall order is  Mykrobe Mykrobe Genefinder

. 
. 
. 
. 
. 
. noi tab site ValueA, m

               |                                   ValueAll
          site |       AAA        AAP        APA        APP        PAP        PPA        PPP |     Total
---------------+-----------------------------------------------------------------------------+----------
      aac6aph2 |     1,300          0          2          1          0          0         76 |     1,379 
    aaddaph4ia |     1,291          0          2          0          0          0         86 |     1,379 
    aadeant6ia |     1,328          0         28          2          0          0         21 |     1,379 
        ant9ia |     1,227          0          4          3          0          0        145 |     1,379 
        ant9ib |     1,379          0          0          0          0          0          0 |     1,379 
        aph2ic |     1,379          0          0          0          0          0          0 |     1,379 
  apha3aph3iii |     1,327          0          0          1          0          0         51 |     1,379 
          arca |     1,372          0          1          0          0          0          6 |     1,379 
          arcb |     1,373          0          0          0          0          6          0 |     1,379 
          arcc |     1,373          0          0          0          0          6          0 |     1,379 
          arcd |     1,373          0          0          0          0          6          0 |     1,379 
          blaz |       222          0         19          7          0          1      1,130 |     1,379 
           cat |     1,379          0          0          0          0          0          0 |     1,379 
          ccra |     1,009          0          2          3          0          0        365 |     1,379 
          ccrb |     1,010          9          1         22          0          1        336 |     1,379 
         ccrca |     1,338          0          8          1          0          9         23 |     1,379 
         ccrcb |     1,333          0         22          0          0         22          2 |     1,379 
         ccrcc |     1,338          0         16          1          0          6         18 |     1,379 
           cfr |     1,376          0          0          1          0          0          2 |     1,379 
           chp |       449          0          1         46          0          0        883 |     1,379 
          dfra |     1,341          0          3          0          0          1         34 |     1,379 
          dfrb |     1,297          0          0          0          1          0         81 |     1,379 
          dfrc |     1,341          0          0          3          0         34          1 |     1,379 
          dfrd |     1,379          0          0          0          0          0          0 |     1,379 
          dfrg |     1,325          0          1          0          0          0         53 |     1,379 
          dfrk |     1,373          0          0          0          0          0          6 |     1,379 
          erma |     1,229          0          1          5          0          0        144 |     1,379 
          ermb |     1,375          0          1          0          0          0          3 |     1,379 
          ermc |     1,191          0         10          2          0          0        176 |     1,379 
          ermt |     1,359          0          0          0          0          0         20 |     1,379 
          ermy |     1,379          0          0          0          0          0          0 |     1,379 
           eta |     1,338          0          1          0          0          0         40 |     1,379 
           etb |     1,372          0          1          1          0          0          5 |     1,379 
           etd |     1,320          0          1          1          0          0         57 |     1,379 
          fusa |     1,320          0          0          2          0          0         57 |     1,379 
          fusb |     1,355          0          2          0          0          0         22 |     1,379 
          fusc |     1,302          0          1          2          0          0         74 |     1,379 
     grla/gyra |     1,072          0          1          0          2          0        304 |     1,379 
          iles |     1,379          0          0          0          0          0          0 |     1,379 
          isab |     1,379          0          0          0          0          0          0 |     1,379 
          lnua |     1,364          6          0          0          0          0          9 |     1,379 
          lnub |     1,378          0          0          0          0          0          1 |     1,379 
          lukm |     1,370          0          0          0          0          0          9 |     1,379 
         lukmf |     1,370          0          0          0          0          6          3 |     1,379 
        lukpvf |     1,266          0          2          0          0          0        111 |     1,379 
        lukpvs |     1,266          0          3          1          0          0        109 |     1,379 
          meca |       999          0          1          2          0          0        377 |     1,379 
          mecc |     1,362          0          0          0          0          0         17 |     1,379 
          mphc |     1,361          0          1          0          0          0         17 |     1,379 
          msra |     1,360          0          1          0          0          0         18 |     1,379 
          mupa |     1,362          2          0          0          0          0         15 |     1,379 
          mupb |     1,379          0          0          0          0          0          0 |     1,379 
          qaca |     1,333          0          1          1          0          0         44 |     1,379 
          qacb |     1,333          0          2          0          0         44          0 |     1,379 
       qaccsmr |     1,319          0          7          2          0          1         50 |     1,379 
          rpob |     1,354          0          1          0          1          0         23 |     1,379 
           sak |       306          0          3          5          0          0      1,065 |     1,379 
          sasx |     1,364          0          1          0          0         14          0 |     1,379 
          sat4 |     1,327          0          2          1          0          0         49 |     1,379 
           scn |       144          0          3         15          0          0      1,217 |     1,379 
           sea |     1,080          0          1          3          0          0        295 |     1,379 
           seb |     1,267          0          1          2          0          0        109 |     1,379 
           sec |     1,149          0          1          4          0          0        225 |     1,379 
           sed |     1,313          0          0          0          0          0         66 |     1,379 
           see |     1,375          0          0          0          0          0          4 |     1,379 
           seg |       600          0          6         20          0          0        753 |     1,379 
           seh |     1,241          0          2          2          0          0        134 |     1,379 
           sei |       596          0          3         33          0          6        741 |     1,379 
           sej |     1,310          0          0          0          0          0         69 |     1,379 
          selr |     1,312          0          0          0          0          0         67 |     1,379 
           sep |     1,268          0          0          2          0          1        108 |     1,379 
           seu |       595          0          2         57          0          0        725 |     1,379 
           str |     1,375          0          0          0          0          0          4 |     1,379 
          tetk |     1,272          0          4          4          0          0         99 |     1,379 
          tetl |     1,377          0          0          0          0          0          2 |     1,379 
          tetm |     1,339          0          1          1          0          0         38 |     1,379 
          teto |     1,379          0          0          0          0          0          0 |     1,379 
         tsst1 |     1,119          0          1          4          0          0        255 |     1,379 
          vana |     1,379          0          0          0          0          0          0 |     1,379 
          vanb |     1,379          0          0          0          0          0          0 |     1,379 
          vanc |     1,379          0          0          0          0          0          0 |     1,379 
          vgaa |     1,378          0          0          0          0          0          1 |     1,379 
          vgab |     1,379          0          0          0          0          0          0 |     1,379 
          vgba |     1,379          0          0          0          0          0          0 |     1,379 
---------------+-----------------------------------------------------------------------------+----------
         Total |   104,159         17        179        263          4        164     11,050 |   115,836 


. 
. gen agree  = (ValueA=="AAA"| ValueA=="PPP" )

. 
. summ agree

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |    115,836    .9945872    .0733728          0          1

. 
. noi di r(sum) " out of " r(N) " site predictions agree"
115209 out of 115836 site predictions agree

. 
. noi di r(sum)/_N*100
99.458717

. 
. 
. 
. noi di "largest disagreements"
largest disagreements

. 
. noi tab site if agree!=1, sort

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
           seu |         59        9.41        9.41
           chp |         47        7.50       16.91
          qacb |         46        7.34       24.24
         ccrcb |         44        7.02       31.26
           sei |         42        6.70       37.96
          dfrc |         37        5.90       43.86
          ccrb |         33        5.26       49.12
    aadeant6ia |         30        4.78       53.91
          blaz |         27        4.31       58.21
           seg |         26        4.15       62.36
         ccrcc |         23        3.67       66.03
         ccrca |         18        2.87       68.90
           scn |         18        2.87       71.77
          sasx |         15        2.39       74.16
          ermc |         12        1.91       76.08
       qaccsmr |         10        1.59       77.67
           sak |          8        1.28       78.95
          tetk |          8        1.28       80.22
        ant9ia |          7        1.12       81.34
          arcb |          6        0.96       82.30
          arcc |          6        0.96       83.25
          arcd |          6        0.96       84.21
          erma |          6        0.96       85.17
          lnua |          6        0.96       86.12
         lukmf |          6        0.96       87.08
          ccra |          5        0.80       87.88
           sec |          5        0.80       88.68
         tsst1 |          5        0.80       89.47
          dfra |          4        0.64       90.11
        lukpvs |          4        0.64       90.75
           sea |          4        0.64       91.39
           seh |          4        0.64       92.03
      aac6aph2 |          3        0.48       92.50
          fusc |          3        0.48       92.98
     grla/gyra |          3        0.48       93.46
          meca |          3        0.48       93.94
          sat4 |          3        0.48       94.42
           seb |          3        0.48       94.90
           sep |          3        0.48       95.37
    aaddaph4ia |          2        0.32       95.69
           etb |          2        0.32       96.01
           etd |          2        0.32       96.33
          fusa |          2        0.32       96.65
          fusb |          2        0.32       96.97
        lukpvf |          2        0.32       97.29
          mupa |          2        0.32       97.61
          qaca |          2        0.32       97.93
          rpob |          2        0.32       98.25
          tetm |          2        0.32       98.56
  apha3aph3iii |          1        0.16       98.72
          arca |          1        0.16       98.88
           cfr |          1        0.16       99.04
          dfrb |          1        0.16       99.20
          dfrg |          1        0.16       99.36
          ermb |          1        0.16       99.52
           eta |          1        0.16       99.68
          mphc |          1        0.16       99.84
          msra |          1        0.16      100.00
---------------+-----------------------------------
         Total |        627      100.00

. 
. noi tab site ValueA if agree!=1

               |                        ValueAll
          site |       AAP        APA        APP        PAP        PPA |     Total
---------------+-------------------------------------------------------+----------
      aac6aph2 |         0          2          1          0          0 |         3 
    aaddaph4ia |         0          2          0          0          0 |         2 
    aadeant6ia |         0         28          2          0          0 |        30 
        ant9ia |         0          4          3          0          0 |         7 
  apha3aph3iii |         0          0          1          0          0 |         1 
          arca |         0          1          0          0          0 |         1 
          arcb |         0          0          0          0          6 |         6 
          arcc |         0          0          0          0          6 |         6 
          arcd |         0          0          0          0          6 |         6 
          blaz |         0         19          7          0          1 |        27 
          ccra |         0          2          3          0          0 |         5 
          ccrb |         9          1         22          0          1 |        33 
         ccrca |         0          8          1          0          9 |        18 
         ccrcb |         0         22          0          0         22 |        44 
         ccrcc |         0         16          1          0          6 |        23 
           cfr |         0          0          1          0          0 |         1 
           chp |         0          1         46          0          0 |        47 
          dfra |         0          3          0          0          1 |         4 
          dfrb |         0          0          0          1          0 |         1 
          dfrc |         0          0          3          0         34 |        37 
          dfrg |         0          1          0          0          0 |         1 
          erma |         0          1          5          0          0 |         6 
          ermb |         0          1          0          0          0 |         1 
          ermc |         0         10          2          0          0 |        12 
           eta |         0          1          0          0          0 |         1 
           etb |         0          1          1          0          0 |         2 
           etd |         0          1          1          0          0 |         2 
          fusa |         0          0          2          0          0 |         2 
          fusb |         0          2          0          0          0 |         2 
          fusc |         0          1          2          0          0 |         3 
     grla/gyra |         0          1          0          2          0 |         3 
          lnua |         6          0          0          0          0 |         6 
         lukmf |         0          0          0          0          6 |         6 
        lukpvf |         0          2          0          0          0 |         2 
        lukpvs |         0          3          1          0          0 |         4 
          meca |         0          1          2          0          0 |         3 
          mphc |         0          1          0          0          0 |         1 
          msra |         0          1          0          0          0 |         1 
          mupa |         2          0          0          0          0 |         2 
          qaca |         0          1          1          0          0 |         2 
          qacb |         0          2          0          0         44 |        46 
       qaccsmr |         0          7          2          0          1 |        10 
          rpob |         0          1          0          1          0 |         2 
           sak |         0          3          5          0          0 |         8 
          sasx |         0          1          0          0         14 |        15 
          sat4 |         0          2          1          0          0 |         3 
           scn |         0          3         15          0          0 |        18 
           sea |         0          1          3          0          0 |         4 
           seb |         0          1          2          0          0 |         3 
           sec |         0          1          4          0          0 |         5 
           seg |         0          6         20          0          0 |        26 
           seh |         0          2          2          0          0 |         4 
           sei |         0          3         33          0          6 |        42 
           sep |         0          0          2          0          1 |         3 
           seu |         0          2         57          0          0 |        59 
          tetk |         0          4          4          0          0 |         8 
          tetm |         0          1          1          0          0 |         2 
         tsst1 |         0          1          4          0          0 |         5 
---------------+-------------------------------------------------------+----------
         Total |        17        179        263          4        164 |       627 


. 
. 
. 
. summ agree if strpos(type, "Aqu") |strpos(type, "Chro")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |     70,329    .9967439    .0569699          0          1

. 
. noi di r(sum) " out of " r(N) " aquired or chromosonal resistance site predictions agree"
70100 out of 70329 aquired or chromosonal resistance site predictions agree

. 
. noi di r(sum)/r(N)*100
99.674388

. 
. 
. 
. noi tab ValueAll if strpos(type, "Aquired"), sort

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |     60,428       95.26       95.26
        PPP |      2,785        4.39       99.65
        APA |         94        0.15       99.80
        PPA |         81        0.13       99.93
        APP |         38        0.06       99.99
        AAP |          8        0.01      100.00
------------+-----------------------------------
      Total |     63,434      100.00

. 
. summ agree  if strpos(type, "Aquired")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |     63,434    .9965161    .0589224          0          1

. 
. noi di r(sum) " out of " r(N) " predictions are identical between all three methods on aquired resistance prediction"
63213 out of 63434 predictions are identical between all three methods on aquired resistance prediction

. 
. 
. 
. noi tab ValueAll if strpos(type, "Chrom"), sort

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      6,422       93.14       93.14
        PPP |        465        6.74       99.88
        PAP |          4        0.06       99.94
        APA |          2        0.03       99.97
        APP |          2        0.03      100.00
------------+-----------------------------------
      Total |      6,895      100.00

. 
. summ agree  if strpos(type, "Chrom")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |      6,895    .9988397    .0340453          0          1

. 
. noi di r(sum) " out of " r(N) " predictions are identical between all three methods on chromosonal resistance prediction"
6887 out of 6895 predictions are identical between all three methods on chromosonal resistance prediction

. 
. 
. 
. noi tab ValueAll if strpos(type, "ccr"), sort

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |      6,028       87.43       87.43
        PPP |        744       10.79       98.22
        APA |         49        0.71       98.93
        PPA |         38        0.55       99.48
        APP |         27        0.39       99.87
        AAP |          9        0.13      100.00
------------+-----------------------------------
      Total |      6,895      100.00

. 
. summ agree  if strpos(type, "ccr")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |      6,895     .982161    .1323757          0          1

. 
. noi di r(sum) " out of " r(N) " predictions are identical between all three methods on ccr prediction"
6772 out of 6895 predictions are identical between all three methods on ccr prediction

. 
. 
. 
. noi tab ValueAll if strpos(type, "viru"), sort

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |     31,281       81.01       81.01
        PPP |      7,056       18.27       99.29
        APP |        196        0.51       99.80
        PPA |         45        0.12       99.91
        APA |         34        0.09      100.00
------------+-----------------------------------
      Total |     38,612      100.00

. 
. summ agree  if strpos(type, "viru")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |     38,612    .9928779    .0840928          0          1

. 
. noi di r(sum) " out of " r(N) " predictions are identical between all three methods on virulence prediction"
38337 out of 38612 predictions are identical between all three methods on virulence prediction

. 
. 
. 
. 
. 
. noi tab ValueAll if strpos(type, "Chrom")|strpos(type, "Aquired"), sort

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAA |     66,850       95.05       95.05
        PPP |      3,250        4.62       99.67
        APA |         96        0.14       99.81
        PPA |         81        0.12       99.93
        APP |         40        0.06       99.98
        AAP |          8        0.01       99.99
        PAP |          4        0.01      100.00
------------+-----------------------------------
      Total |     70,329      100.00

. 
. summ agree  if strpos(type, "Chrom")|strpos(type, "Aquired")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |     70,329    .9967439    .0569699          0          1

. 
. noi di r(sum) " out of " r(N) " predictions are identical between all three methods on antibiotic prediction"
70100 out of 70329 predictions are identical between all three methods on antibiotic prediction

. 
. 
. 
. 
. 
. *sample discrenpancies

. 
. 
. 
. noi list sample site Value if agree!=1

        +------------------------------------------------+
        |               sample           site   ValueAll |
        |------------------------------------------------|
   245. |     H121320081-505-1       aac6aph2        APA |
  1167. |     RH11000301-155-1       aac6aph2        APA |
  1229. |     H092520302-216-1       aac6aph2        APP |
  1597. |            C00001446     aaddaph4ia        APA |
  2563. |            C00003152     aaddaph4ia        APA |
        |------------------------------------------------|
  2927. | H114140657-280-B01-2     aadeant6ia        APA |
  2956. |     H133120386-618-1     aadeant6ia        APA |
  2999. |     H092520302-216-1     aadeant6ia        APA |
  3078. |     H133960276-571-1     aadeant6ia        APA |
  3117. |            C00003385     aadeant6ia        APP |
        |------------------------------------------------|
  3151. | RH11000090-289-C02-2     aadeant6ia        APA |
  3182. |     H133300151-657-1     aadeant6ia        APA |
  3246. |  H125000105-229-G0-2     aadeant6ia        APA |
  3258. |     H133520197-646-1     aadeant6ia        APA |
  3296. | RH12000340-301-G03-2     aadeant6ia        APA |
        |------------------------------------------------|
  3343. |            C00007083     aadeant6ia        APA |
  3354. |     H125000105-833-2     aadeant6ia        APA |
  3359. |     H133000236-626-1     aadeant6ia        APA |
  3361. |            C00003221     aadeant6ia        APA |
  3375. | H105040039-373-G12-2     aadeant6ia        APA |
        |------------------------------------------------|
  3563. |     H101580214-176-2     aadeant6ia        APA |
  3571. |     H133580080-596-1     aadeant6ia        APA |
  3610. | H124420844-355-E10-2     aadeant6ia        APA |
  3625. | H103560109-371-E12-2     aadeant6ia        APA |
  3709. |     H113640215-127-2     aadeant6ia        APA |
        |------------------------------------------------|
  3719. |            C00012738     aadeant6ia        APA |
  3745. |     H133720214-574-1     aadeant6ia        APA |
  3789. |     H111640001-197-2     aadeant6ia        APA |
  3806. |     H133020301-629-1     aadeant6ia        APA |
  3902. |     H114160352-129-1     aadeant6ia        APA |
        |------------------------------------------------|
  3903. |     H104080090-443-2     aadeant6ia        APA |
  3969. |            C00003377     aadeant6ia        APP |
  3985. |     H133860126-577-1     aadeant6ia        APA |
  4014. |     H133720215-575-1     aadeant6ia        APA |
  4052. |  H082600495-244-F0-2     aadeant6ia        APA |
        |------------------------------------------------|
  4149. |     RH11000301-155-1         ant9ia        APP |
  4294. |  H120420116-223-A0-2         ant9ia        APA |
  4333. |  H120600058-224-B0-2         ant9ia        APA |
  5166. |            C00001446         ant9ia        APA |
  5269. |            C00003152         ant9ia        APP |
        |------------------------------------------------|
  5292. |     H132540570-419-2         ant9ia        APA |
  5497. |            C00008638         ant9ia        APP |
  9307. |            C00003377   apha3aph3iii        APP |
  9700. |  H103360314-241-C0-2           blaz        APA |
  9710. |            C00003320           blaz        APP |
        |------------------------------------------------|
  9796. |            C00001079           blaz        APP |
  9911. |     H114700366-481-1           blaz        APA |
 10007. | RH11000133-292-F02-2           blaz        APA |
 10009. |            C00003144           blaz        APA |
 10035. |  H101740629-240-B0-2           blaz        APA |
        |------------------------------------------------|
 10074. |     RH08000028-150-1           blaz        APA |
 10180. |            C00012749           blaz        APA |
 10281. |     RH12000540-156-1           blaz        APA |
 10340. |     H122660093-513-1           blaz        APA |
 10361. |     H121320082-506-1           blaz        APA |
        |------------------------------------------------|
 10436. | RH11000142-293-G02-2           blaz        APA |
 10468. |  H105140339-248-B0-2           blaz        APA |
 10523. |     H122840129-206-1           blaz        APA |
 10547. |            C00001091           blaz        APP |
 10640. |            C00003393           blaz        APP |
        |------------------------------------------------|
 10666. |  H102840444-246-H0-2           blaz        APA |
 10687. |     RH11000301-155-1           blaz        APP |
 10697. |            C00003406           blaz        PPA |
 10772. |     H122880144-207-1           blaz        APP |
 10788. |     H131660094-412-2           blaz        APA |
        |------------------------------------------------|
 10844. |            C00001080           blaz        APP |
 10943. |     H112540036-142-1           blaz        APA |
 10960. |     H110820268-195-2           blaz        APA |
 10961. |  H105020135-247-A0-2           blaz        APA |
 10981. |  H091100226-245-G0-2           blaz        APA |
        |------------------------------------------------|
 13788. |     RH11000301-155-1            cfr        APP |
 14368. |     H114720434-145-1           dfra        APA |
 14760. |     RH11000301-155-1           dfra        APA |
 14796. |     H121120058-504-1           dfra        APA |
 15066. |     H113640238-143-1           dfra        PPA |
        |------------------------------------------------|
 15201. |     H133960268-568-1           dfrc        PPA |
 15218. | H130240275-357-G10-2           dfrc        PPA |
 15266. |     H123120336-557-1           dfrc        PPA |
 15316. |     H121060252-533-1           dfrc        PPA |
 15355. |     H123100270-554-1           dfrc        PPA |
        |------------------------------------------------|
 15361. |     H123020176-551-1           dfrc        PPA |
 15388. |     H123100271-555-1           dfrc        PPA |
 15395. |     H132280003-416-2           dfrc        PPA |
 15414. |     H121340220-509-1           dfrc        PPA |
 15423. |     H114720434-145-1           dfrc        APP |
        |------------------------------------------------|
 15461. |  H124420845-227-E0-2           dfrc        PPA |
 15465. |     H121800040-510-1           dfrc        PPA |
 15485. | H122560310-348-F09-2           dfrc        PPA |
 15496. |     H123020177-552-1           dfrc        PPA |
 15509. |     H122960028-515-1           dfrc        PPA |
        |------------------------------------------------|
 15516. |     H121320081-505-1           dfrc        PPA |
 15554. |     H113020155-466-2           dfrc        PPA |
 15574. |     H123120337-556-1           dfrc        PPA |
 15587. |     H112060137-461-2           dfrc        PPA |
 15658. |     H133920237-578-1           dfrc        PPA |
        |------------------------------------------------|
 15680. |     H133900439-581-1           dfrc        PPA |
 15716. |     RH11000301-155-1           dfrc        APP |
 15770. | H124420844-355-E10-2           dfrc        PPA |
 15817. | H065060092-367-A12-2           dfrc        PPA |
 15838. |     H121000455-532-1           dfrc        PPA |
        |------------------------------------------------|
 15849. |     H113560219-469-2           dfrc        PPA |
 15853. |     H121120051-535-1           dfrc        PPA |
 15910. |     H133520197-646-1           dfrc        PPA |
 15949. |     H123120338-558-1           dfrc        PPA |
 16077. |     H122960030-517-1           dfrc        PPA |
        |------------------------------------------------|
 16130. |     H103060332-756-2           dfrc        PPA |
 16140. |     H123020178-553-1           dfrc        PPA |
 16284. |     H121120058-504-1           dfrc        APP |
 16309. |     H133960269-569-1           dfrc        PPA |
 16333. |     H123220266-561-1           dfrc        PPA |
        |------------------------------------------------|
 16354. |     H121320099-507-1           dfrc        PPA |
 16402. |     H104420050-188-2           dfrc        PPA |
 18940. |     H122880144-207-1           dfrg        APA |
 20735. |     RH11000301-155-1           erma        APP |
 21006. |     RH12000540-156-1           erma        APP |
        |------------------------------------------------|
 21077. |            C00001446           erma        APP |
 21358. |            C00003152           erma        APP |
 21665. |  H120600058-224-B0-2           erma        APA |
 21814. |            C00008638           erma        APP |
 22648. |            C00003385           ermb        APA |
        |------------------------------------------------|
 23445. |            C00012780           ermc        APP |
 23463. |     H111640001-197-2           ermc        APA |
 23466. |            C00001387           ermc        APA |
 23689. |            C00003290           ermc        APA |
 24225. |            C00013165           ermc        APA |
        |------------------------------------------------|
 24356. |            C00003158           ermc        APA |
 24445. |            C00003272           ermc        APA |
 24587. |            C00012784           ermc        APA |
 24651. |     H124860349-210-1           ermc        APA |
 24661. |            C00003355           ermc        APA |
        |------------------------------------------------|
 24702. |            C00012749           ermc        APP |
 24788. |            C00003292           ermc        APA |
 27599. |  RH12000505-239-A0-2           fusb        APA |
 28619. |            C00003340           fusb        APA |
 29065. |            C00003351           fusc        APA |
        |------------------------------------------------|
 29955. |     H105020486-191-2           fusc        APP |
 30069. |            C00003302           fusc        APP |
 31816. |     H133580080-596-1           lnua        AAP |
 31825. |     H133580086-601-1           lnua        AAP |
 32234. |     H133580087-582-1           lnua        AAP |
        |------------------------------------------------|
 32259. |     H133060079-613-1           lnua        AAP |
 32287. |     H133240054-609-1           lnua        AAP |
 32980. |     H133560609-593-1           lnua        AAP |
 34640. |     RH11000301-155-1           meca        APA |
 35079. |     H092520302-216-1           meca        APP |
        |------------------------------------------------|
 35597. |  H094920323-271-A1-2           meca        APP |
 38556. |     H110820268-195-2           mphc        APA |
 39189. |            C00003272           msra        APA |
 40900. |     H121320081-505-1           mupa        AAP |
 41177. |     RH10000448-161-1           mupa        AAP |
        |------------------------------------------------|
 44011. |     RH11000301-155-1           qaca        APP |
 44029. |     H121300130-139-1           qaca        APA |
 44133. |  H101740329-274-D1-2           qacb        PPA |
 44138. |     H121100042-534-1           qacb        PPA |
 44195. | RH11000029-284-F01-2           qacb        PPA |
        |------------------------------------------------|
 44257. |     H114720434-145-1           qacb        PPA |
 44260. |     H124060094-134-1           qacb        PPA |
 44349. |  H094920323-271-A1-2           qacb        PPA |
 44357. |     H101020134-173-2           qacb        PPA |
 44373. |     H113140144-468-2           qacb        PPA |
        |------------------------------------------------|
 44405. |     H121300130-139-1           qacb        APA |
 44421. |            C00013335           qacb        PPA |
 44443. |  H065120079-263-A1-2           qacb        PPA |
 44447. |     H133580080-596-1           qacb        PPA |
 44532. |            C00013362           qacb        PPA |
        |------------------------------------------------|
 44552. |  H093620523-269-G1-2           qacb        PPA |
 44577. |     H133720215-575-1           qacb        PPA |
 44578. |     H121320082-506-1           qacb        PPA |
 44597. |     RH11000301-155-1           qacb        APA |
 44599. |            C00013231           qacb        PPA |
        |------------------------------------------------|
 44618. |     H133000236-626-1           qacb        PPA |
 44691. |  H120420116-223-A0-2           qacb        PPA |
 44763. |            C00013406           qacb        PPA |
 44788. |     H121320081-505-1           qacb        PPA |
 44898. | H114140657-280-B01-2           qacb        PPA |
        |------------------------------------------------|
 44943. | RH11000044-286-H01-2           qacb        PPA |
 44974. |     H133300151-657-1           qacb        PPA |
 45016. |            C00013401           qacb        PPA |
 45019. |     H113640238-143-1           qacb        PPA |
 45058. |     H120680309-385-2           qacb        PPA |
        |------------------------------------------------|
 45107. |     H113920345-478-1           qacb        PPA |
 45121. |     H133720214-574-1           qacb        PPA |
 45126. |            C00002620           qacb        PPA |
 45134. |     H125000105-833-2           qacb        PPA |
 45223. |     H133020301-629-1           qacb        PPA |
        |------------------------------------------------|
 45264. |     H133120386-618-1           qacb        PPA |
 45281. |            C00013326           qacb        PPA |
 45306. |            C00013213           qacb        PPA |
 45320. | H130240275-357-G10-2           qacb        PPA |
 45323. |  H125000105-229-G0-2           qacb        PPA |
        |------------------------------------------------|
 45342. |     H114160352-129-1           qacb        PPA |
 45367. |     H113880160-476-1           qacb        PPA |
 45377. |     H133960276-571-1           qacb        PPA |
 45408. |  H074780626-266-D1-2           qacb        PPA |
 45449. |     H121320099-507-1           qacb        PPA |
        |------------------------------------------------|
 45483. | H124420844-355-E10-2           qacb        PPA |
 45488. |     H133860126-577-1           qacb        PPA |
 45490. |  H102820334-277-G1-2           qacb        PPA |
 45750. |            C00003155        qaccsmr        APA |
 45946. |            C00003348        qaccsmr        APA |
        |------------------------------------------------|
 46015. |     RH12000366-426-2        qaccsmr        APA |
 46242. |            C00003130        qaccsmr        APA |
 46467. |            C00003419        qaccsmr        APP |
 46512. |            C00003121        qaccsmr        APA |
 46543. |            C00003240        qaccsmr        APA |
        |------------------------------------------------|
 46593. |            C00001100        qaccsmr        PPA |
 46616. |            C00001091        qaccsmr        APP |
 46790. |     H121320081-505-1        qaccsmr        APA |
 47219. |            C00003385           sat4        APA |
 47514. |            C00003377           sat4        APP |
        |------------------------------------------------|
 48049. |     H104420250-444-2           sat4        APA |
 49729. |  RH10000375-235-E0-2           tetk        APP |
 49929. |     RH11000301-155-1           tetk        APP |
 50198. |            C00003301           tetk        APA |
 50211. |  RH12000505-239-A0-2           tetk        APA |
        |------------------------------------------------|
 50328. |     H100200151-169-2           tetk        APP |
 50380. |            C00008960           tetk        APA |
 50520. |            C00003419           tetk        APA |
 50599. |  RH10000389-236-F0-2           tetk        APP |
 53052. |            C00003385           tetm        APP |
        |------------------------------------------------|
 53341. |            C00003377           tetm        APA |
 63689. |            C00001240           dfrb        PAP |
 64922. |            C00003303           fusa        APP |
 66019. |            C00003332           fusa        APP |
 66454. | H111960080-332-F07-2      grla/gyra        PAP |
        |------------------------------------------------|
 67156. | H122560310-348-F09-2      grla/gyra        PAP |
 67456. |            C00003248      grla/gyra        APA |
 69328. |            C00003130           rpob        PAP |
 70204. |     H110740135-193-2           rpob        APA |
 70998. |            C00003248           ccra        APP |
        |------------------------------------------------|
 71057. |            C00003152           ccra        APA |
 71089. |     H110740135-193-2           ccra        APA |
 71391. | H120860096-346-D09-2           ccra        APP |
 71477. |  H094920323-271-A1-2           ccra        APP |
 71745. |     RH11000301-155-1           ccrb        APP |
        |------------------------------------------------|
 71777. | RH12000346-307-E04-2           ccrb        AAP |
 71902. |            C00000790           ccrb        APP |
 71979. |            C00000809           ccrb        APP |
 72027. |            C00003152           ccrb        APA |
 72054. |  H094920323-271-A1-2           ccrb        APP |
        |------------------------------------------------|
 72075. |            C00000785           ccrb        APP |
 72134. |            C00003229           ccrb        AAP |
 72154. |            C00012775           ccrb        AAP |
 72211. |            C00000799           ccrb        APP |
 72245. |            C00000787           ccrb        APP |
        |------------------------------------------------|
 72247. |            C00000800           ccrb        APP |
 72287. |            C00000806           ccrb        APP |
 72303. |            C00013393           ccrb        AAP |
 72391. |            C00000829           ccrb        APP |
 72394. |            C00000815           ccrb        APP |
        |------------------------------------------------|
 72398. |            C00012776           ccrb        AAP |
 72401. |     H101520278-175-2           ccrb        PPA |
 72411. |            C00000786           ccrb        APP |
 72534. |            C00000808           ccrb        APP |
 72541. |            C00000817           ccrb        APP |
        |------------------------------------------------|
 72554. |            C00013235           ccrb        AAP |
 72621. |            C00000784           ccrb        APP |
 72655. |            C00000831           ccrb        APP |
 72780. |            C00013162           ccrb        AAP |
 72791. |            C00013248           ccrb        AAP |
        |------------------------------------------------|
 72854. |            C00013367           ccrb        AAP |
 72893. |            C00000820           ccrb        APP |
 72965. |            C00000818           ccrb        APP |
 73014. |            C00000828           ccrb        APP |
 73032. |            C00000816           ccrb        APP |
        |------------------------------------------------|
 73036. |            C00000789           ccrb        APP |
 73038. |            C00000788           ccrb        APP |
 73099. |     H092520302-216-1          ccrca        APP |
 73128. |     H133180046-621-1          ccrca        PPA |
 73187. |     H133180047-622-1          ccrca        PPA |
        |------------------------------------------------|
 73207. |     H104420250-444-2          ccrca        PPA |
 73271. |     H133760113-576-1          ccrca        APA |
 73365. |     H132540570-419-2          ccrca        PPA |
 73415. |  H114080202-255-A1-2          ccrca        PPA |
 73428. |            C00013230          ccrca        PPA |
        |------------------------------------------------|
 73438. | RH11000072-288-B02-2          ccrca        PPA |
 73609. |            C00003229          ccrca        APA |
 73774. |     H104600048-190-2          ccrca        APA |
 73847. |  H120840083-225-C0-2          ccrca        APA |
 73926. |     H113640238-143-1          ccrca        APA |
        |------------------------------------------------|
 73964. | H122900151-350-H09-2          ccrca        PPA |
 74018. |     H121340220-509-1          ccrca        APA |
 74103. | H114680370-339-E08-2          ccrca        APA |
 74339. | H105260391-374-H12-2          ccrca        PPA |
 74431. | H123700164-353-C10-2          ccrca        APA |
        |------------------------------------------------|
 74533. |     H132540570-419-2          ccrcb        PPA |
 74556. |            C00003315          ccrcb        PPA |
 74645. |     H124940430-401-1          ccrcb        APA |
 74656. |            C00001226          ccrcb        PPA |
 74680. | H114140657-280-B01-2          ccrcb        APA |
        |------------------------------------------------|
 74683. |     H080980484-164-1          ccrcb        APA |
 74728. | RH11000090-289-C02-2          ccrcb        APA |
 74784. |     H133720214-574-1          ccrcb        APA |
 74837. |     H104080090-443-2          ccrcb        APA |
 74863. |     H133000236-626-1          ccrcb        APA |
        |------------------------------------------------|
 74878. |     RH11000301-155-1          ccrcb        APA |
 74894. | RH11000072-288-B02-2          ccrcb        PPA |
 74920. |     H133860126-577-1          ccrcb        APA |
 74939. |     H113640215-127-2          ccrcb        APA |
 74941. |     H133720215-575-1          ccrcb        APA |
        |------------------------------------------------|
 74963. | H122900151-350-H09-2          ccrcb        PPA |
 75009. |     H133580080-596-1          ccrcb        APA |
 75018. | H123700164-353-C10-2          ccrcb        PPA |
 75042. |     H125000105-833-2          ccrcb        APA |
 75089. |     H133960276-571-1          ccrcb        APA |
        |------------------------------------------------|
 75121. |     H104420250-444-2          ccrcb        PPA |
 75151. |     H133300151-657-1          ccrcb        APA |
 75159. |     H114120077-144-1          ccrcb        PPA |
 75167. |            C00013230          ccrcb        PPA |
 75195. |  H101120403-273-C1-2          ccrcb        PPA |
        |------------------------------------------------|
 75214. |     H104600048-190-2          ccrcb        PPA |
 75311. |     H133020301-629-1          ccrcb        APA |
 75313. | H105260391-374-H12-2          ccrcb        PPA |
 75327. |     H092520302-216-1          ccrcb        APA |
 75394. |  H120840083-225-C0-2          ccrcb        PPA |
        |------------------------------------------------|
 75428. |     H110520238-116-2          ccrcb        APA |
 75441. |            C00003093          ccrcb        APA |
 75447. | H114680370-339-E08-2          ccrcb        PPA |
 75489. |     H121340220-509-1          ccrcb        PPA |
 75521. |     H113640238-143-1          ccrcb        PPA |
        |------------------------------------------------|
 75575. |     H131800554-414-2          ccrcb        PPA |
 75576. |  H114080202-255-A1-2          ccrcb        PPA |
 75645. |  RH11000042-258-D1-2          ccrcb        PPA |
 75676. |     H133120386-618-1          ccrcb        APA |
 75694. |            C00003250          ccrcb        PPA |
        |------------------------------------------------|
 75738. |     H114160352-129-1          ccrcb        APA |
 75743. |  H125000105-229-G0-2          ccrcb        APA |
 75783. |     H133180047-622-1          ccrcb        PPA |
 75839. |     H133180046-621-1          ccrcb        PPA |
 75990. |  H120600058-224-B0-2          ccrcc        APA |
        |------------------------------------------------|
 76012. |  RH11000042-258-D1-2          ccrcc        PPA |
 76054. | H114140657-280-B01-2          ccrcc        APA |
 76176. |     H133720214-574-1          ccrcc        APA |
 76205. |     H133760113-576-1          ccrcc        PPA |
 76264. | H122900151-350-H09-2          ccrcc        APP |
        |------------------------------------------------|
 76310. |     H114160352-129-1          ccrcc        APA |
 76334. |     RH11000301-155-1          ccrcc        APA |
 76348. |     H133120386-618-1          ccrcc        APA |
 76351. |     H114120077-144-1          ccrcc        PPA |
 76353. |     H133860126-577-1          ccrcc        APA |
        |------------------------------------------------|
 76456. |  H125000105-229-G0-2          ccrcc        APA |
 76472. |     H133580080-596-1          ccrcc        APA |
 76841. |            C00003248          ccrcc        APA |
 76859. |            C00003229          ccrcc        PPA |
 76876. |  H101120403-273-C1-2          ccrcc        PPA |
        |------------------------------------------------|
 76903. |     H133020301-629-1          ccrcc        APA |
 76960. |     H133720215-575-1          ccrcc        APA |
 77015. |     H125000105-833-2          ccrcc        APA |
 77064. |     H133960276-571-1          ccrcc        APA |
 77066. |     H133300151-657-1          ccrcc        APA |
        |------------------------------------------------|
 77099. |     H133000236-626-1          ccrcc        APA |
 77124. |     H110520238-116-2          ccrcc        PPA |
 78202. |     RH10000448-161-1           arca        APA |
 78847. | H105040039-373-G12-2           arcb        PPA |
 79195. |            C00003272           arcb        PPA |
        |------------------------------------------------|
 79319. |            C00007064           arcb        PPA |
 79347. |            C00013217           arcb        PPA |
 79429. |     H121120058-504-1           arcb        PPA |
 79652. |     H113560219-469-2           arcb        PPA |
 80515. |            C00003272           arcc        PPA |
        |------------------------------------------------|
 80583. |     H113560219-469-2           arcc        PPA |
 80788. |            C00007064           arcc        PPA |
 80978. |     H121120058-504-1           arcc        PPA |
 81199. | H105040039-373-G12-2           arcc        PPA |
 81359. |            C00013217           arcc        PPA |
        |------------------------------------------------|
 81584. |            C00013217           arcd        PPA |
 81867. |     H121120058-504-1           arcd        PPA |
 82002. |            C00007064           arcd        PPA |
 82179. | H105040039-373-G12-2           arcd        PPA |
 82489. |     H113560219-469-2           arcd        PPA |
        |------------------------------------------------|
 82596. |            C00003272           arcd        PPA |
 82786. |            C00003301            chp        APP |
 82823. |            C00003421            chp        APP |
 82851. |            C00003423            chp        APA |
 82934. |            C00003259            chp        APP |
        |------------------------------------------------|
 82943. |            C00003422            chp        APP |
 83004. |            C00003253            chp        APP |
 83011. |            C00013241            chp        APP |
 83037. |            C00003115            chp        APP |
 83110. |            C00003306            chp        APP |
        |------------------------------------------------|
 83113. |            C00003396            chp        APP |
 83123. |            C00003254            chp        APP |
 83151. |            C00003272            chp        APP |
 83156. |     H123100271-555-1            chp        APP |
 83175. |            C00003164            chp        APP |
        |------------------------------------------------|
 83272. |            C00003397            chp        APP |
 83322. |            C00003315            chp        APP |
 83365. |            C00003195            chp        APP |
 83376. |            C00003248            chp        APP |
 83380. |            C00003321            chp        APP |
        |------------------------------------------------|
 83419. |            C00003381            chp        APP |
 83476. |            C00003111            chp        APP |
 83521. |            C00003415            chp        APP |
 83530. |            C00003379            chp        APP |
 83564. |     RH08000028-150-1            chp        APP |
        |------------------------------------------------|
 83589. |            C00002656            chp        APP |
 83603. |            C00003385            chp        APP |
 83607. |            C00000857            chp        APP |
 83637. |            C00003354            chp        APP |
 83639. |            C00003137            chp        APP |
        |------------------------------------------------|
 83641. |            C00003333            chp        APP |
 83686. |            C00003425            chp        APP |
 83699. |            C00003395            chp        APP |
 83710. |            C00013364            chp        APP |
 83750. |     RH11000301-155-1            chp        APP |
        |------------------------------------------------|
 83782. |            C00003176            chp        APP |
 83784. |            C00003134            chp        APP |
 83833. |            C00003319            chp        APP |
 83841. |            C00003411            chp        APP |
 83851. |            C00003382            chp        APP |
        |------------------------------------------------|
 83861. |            C00003320            chp        APP |
 83862. |            C00003337            chp        APP |
 83986. |            C00003307            chp        APP |
 84055. |            C00003125            chp        APP |
 84067. |            C00003252            chp        APP |
        |------------------------------------------------|
 84071. |            C00013195            chp        APP |
 84073. |            C00013221            chp        APP |
 84112. |            C00003122            chp        APP |
 84780. |     H105020486-191-2            eta        APA |
 86046. |            C00013318            etb        APA |
        |------------------------------------------------|
 86839. |     H112660153-200-1            etb        APP |
 87719. |            C00003337            etd        APP |
 87881. |     H110740135-193-2            etd        APA |
 89906. |     RH12000374-434-2          lukmf        PPA |
 89952. | RH11000146-294-H02-2          lukmf        PPA |
        |------------------------------------------------|
 89995. |     RH12000376-436-2          lukmf        PPA |
 90073. |     RH12000381-441-2          lukmf        PPA |
 90275. |  RH07000425-233-C0-2          lukmf        PPA |
 91006. |     RH12000375-435-2          lukmf        PPA |
 91982. |     H122880144-207-1         lukpvf        APA |
        |------------------------------------------------|
 92281. |  H094920323-271-A1-2         lukpvf        APA |
 92948. |            C00003224         lukpvs        APP |
 93103. | H113420072-336-B08-2         lukpvs        APA |
 93290. |  H094920323-271-A1-2         lukpvs        APA |
 93582. |     H122880144-207-1         lukpvs        APA |
        |------------------------------------------------|
 94143. |     H110820268-195-2            sak        APA |
 94691. |            C00003248            sak        APA |
 94751. |     H113640238-143-1            sak        APA |
 94811. |            C00003320            sak        APP |
 94888. |  H094920323-271-A1-2            sak        APP |
        |------------------------------------------------|
 94926. |            C00002656            sak        APP |
 94968. |     RH11000301-155-1            sak        APP |
 94975. |            C00003207            sak        APP |
 95313. |     H133860126-577-1           sasx        PPA |
 95581. |     RH11000301-155-1           sasx        APA |
        |------------------------------------------------|
 95678. |     H133960276-571-1           sasx        PPA |
 95710. |     H133720214-574-1           sasx        PPA |
 95763. |     H114160352-129-1           sasx        PPA |
 95854. |     H133300151-657-1           sasx        PPA |
 95955. |     H113640238-143-1           sasx        PPA |
        |------------------------------------------------|
 96028. |     H133000236-626-1           sasx        PPA |
 96070. |  H125000105-229-G0-2           sasx        PPA |
 96101. |     H133020301-629-1           sasx        PPA |
 96287. |     H133120386-618-1           sasx        PPA |
 96303. |     H133720215-575-1           sasx        PPA |
        |------------------------------------------------|
 96355. |     H125000105-833-2           sasx        PPA |
 96364. |     H133580080-596-1           sasx        PPA |
 96405. | H114140657-280-B01-2           sasx        PPA |
 96564. |            C00003207            scn        APP |
 96741. |            C00003422            scn        APA |
        |------------------------------------------------|
 96822. |            C00003395            scn        APP |
 96936. |            C00003317            scn        APP |
 97071. |            C00003411            scn        APP |
 97123. |            C00003122            scn        APP |
 97186. |     RH11000301-155-1            scn        APP |
        |------------------------------------------------|
 97221. |            C00008638            scn        APP |
 97240. |            C00003092            scn        APP |
 97290. |            C00003242            scn        APP |
 97334. |            C00003396            scn        APP |
 97451. |            C00003423            scn        APA |
        |------------------------------------------------|
 97488. |     H113640238-143-1            scn        APA |
 97515. |            C00003320            scn        APP |
 97558. |            C00003315            scn        APP |
 97586. |     H103440108-442-2            scn        APP |
 97596. |            C00002656            scn        APP |
        |------------------------------------------------|
 97645. |            C00003421            scn        APP |
 98154. |            C00003207            sea        APP |
 98467. |     RH11000301-155-1            sea        APP |
 98889. |     RH08000028-150-1            sea        APA |
 99200. |            C00003165            sea        APP |
        |------------------------------------------------|
 99656. |     H122880144-207-1            seb        APA |
 99931. |            C00001265            seb        APP |
100574. |            C00003306            seb        APP |
101086. |            C00003421            sec        APP |
101207. |     RH11000301-155-1            sec        APP |
        |------------------------------------------------|
101234. |            C00003393            sec        APP |
101357. |     H113640238-143-1            sec        APA |
101576. |            C00003425            sec        APP |
104860. |            C00003140            seg        APP |
104905. |     H122880144-207-1            seg        APA |
        |------------------------------------------------|
104919. |            C00003425            seg        APP |
104962. |            C00003389            seg        APP |
104971. |            C00003415            seg        APA |
104976. |            C00003317            seg        APP |
105000. |            C00003362            seg        APP |
        |------------------------------------------------|
105043. |            C00003314            seg        APP |
105065. |            C00003406            seg        APP |
105083. |            C00003347            seg        APP |
105105. |            C00003382            seg        APP |
105212. |            C00003321            seg        APP |
        |------------------------------------------------|
105354. |            C00001102            seg        APA |
105386. |            C00003393            seg        APP |
105549. |            C00001086            seg        APA |
105635. |            C00003320            seg        APP |
105695. |            C00003421            seg        APP |
        |------------------------------------------------|
105765. |            C00003340            seg        APP |
105895. |            C00003341            seg        APA |
105982. |            C00003315            seg        APP |
105986. |            C00003385            seg        APP |
106001. |            C00003318            seg        APP |
        |------------------------------------------------|
106063. |            C00003248            seg        APA |
106106. |  H094920323-271-A1-2            seg        APP |
106145. |            C00003423            seg        APP |
106177. |            C00003339            seg        APP |
106805. |            C00003134            seh        APP |
        |------------------------------------------------|
107040. | RH12000046-298-D03-2            seh        APP |
107292. |            C00003207            seh        APA |
107401. |  H120420116-223-A0-2            seh        APA |
107596. |     H114720432-482-1            sei        APP |
107597. |            C00003340            sei        APP |
        |------------------------------------------------|
107604. |            C00003425            sei        APP |
107628. |            C00003423            sei        APP |
107629. |            C00000790            sei        PPA |
107674. |            C00003337            sei        APA |
107712. |            C00001086            sei        APA |
        |------------------------------------------------|
107718. |            C00003406            sei        APP |
107726. |            C00003301            sei        APP |
107761. |     RH12000370-430-2            sei        APP |
107784. |            C00000817            sei        PPA |
107786. |            C00003260            sei        APP |
        |------------------------------------------------|
107899. |     H120440759-384-2            sei        APP |
107900. |            C00003315            sei        APP |
107909. |            C00003320            sei        APP |
107937. |            C00003134            sei        APP |
108015. |            C00000785            sei        PPA |
        |------------------------------------------------|
108018. |            C00000815            sei        PPA |
108037. |            C00003339            sei        APP |
108082. |     H132620132-420-2            sei        APP |
108089. |            C00003347            sei        APP |
108098. |            C00000800            sei        PPA |
        |------------------------------------------------|
108116. |  RH12000503-261-G1-2            sei        APP |
108210. |            C00000786            sei        PPA |
108211. |     H103220288-184-2            sei        APA |
108240. |            C00003318            sei        APP |
108292. |  H094920323-271-A1-2            sei        APP |
        |------------------------------------------------|
108439. |     H123120336-557-1            sei        APP |
108467. |     H111740190-456-2            sei        APP |
108468. |            C00003321            sei        APP |
108484. |            C00003385            sei        APP |
108563. |            C00003140            sei        APP |
        |------------------------------------------------|
108565. |     H100140197-167-2            sei        APP |
108566. |            C00003333            sei        APP |
108588. |     H124940430-401-1            sei        APP |
108609. |            C00003341            sei        APP |
108635. |            C00003317            sei        APP |
        |------------------------------------------------|
108648. |            C00003278            sei        APP |
108691. |     RH12000379-439-2            sei        APP |
108822. |            C00003382            sei        APP |
108839. |     H034660053-158-1            sei        APP |
108841. |     H110740135-193-2            sei        APP |
        |------------------------------------------------|
112109. |            C00001265            sep        APP |
112638. |            C00003270            sep        APP |
112759. |            C00003165            sep        PPA |
113084. |     H114720434-145-1            seu        APP |
113107. |     H133200270-608-1            seu        APP |
        |------------------------------------------------|
113117. |            C00003385            seu        APA |
113156. |     H114340058-470-2            seu        APP |
113195. |     H124860349-210-1            seu        APP |
113208. |            C00003317            seu        APP |
113230. |     H130660215-405-2            seu        APP |
        |------------------------------------------------|
113233. |     H120220271-381-2            seu        APP |
113235. |            C00003140            seu        APP |
113254. | RH11000090-289-C02-2            seu        APP |
113275. |     H132620132-420-2            seu        APP |
113297. |     H123120337-556-1            seu        APP |
        |------------------------------------------------|
113307. |            C00003389            seu        APP |
113322. |            C00003315            seu        APP |
113372. |            C00003382            seu        APP |
113381. |     H121320099-507-1            seu        APP |
113420. | RH11000044-286-H01-2            seu        APP |
        |------------------------------------------------|
113438. |     H133920237-578-1            seu        APP |
113474. |     H125280642-841-2            seu        APP |
113496. |     H124720623-209-1            seu        APP |
113508. |            C00003341            seu        APP |
113537. |            C00003414            seu        APP |
        |------------------------------------------------|
113547. |            C00003425            seu        APP |
113566. |            C00003411            seu        APP |
113569. |            C00003423            seu        APP |
113720. |            C00003352            seu        APP |
113786. |            C00003320            seu        APP |
        |------------------------------------------------|
113789. |     H131800573-415-2            seu        APP |
113830. |     H111600186-455-2            seu        APP |
113866. |     H120440759-384-2            seu        APP |
113906. |            C00003318            seu        APP |
113927. |            C00003410            seu        APP |
        |------------------------------------------------|
113948. |  H094920323-271-A1-2            seu        APP |
113982. |            C00003249            seu        APP |
114011. |  H104340410-220-F0-2            seu        APP |
114034. |            C00003314            seu        APP |
114057. |            C00003340            seu        APP |
        |------------------------------------------------|
114097. |            C00003347            seu        APP |
114114. |     H113560219-469-2            seu        APP |
114127. | H125280642-356-F10-2            seu        APP |
114134. |     H123120336-557-1            seu        APP |
114136. |            C00003084            seu        APP |
        |------------------------------------------------|
114169. |            C00003421            seu        APP |
114170. |            C00007096            seu        APP |
114171. |     H121000455-532-1            seu        APP |
114217. |            C00003277            seu        APP |
114244. |            C00003393            seu        APP |
        |------------------------------------------------|
114246. |            C00013224            seu        APP |
114272. |     H133100176-615-1            seu        APP |
114285. |     H100800158-172-2            seu        APP |
114289. |            C00003307            seu        APP |
114317. |            C00003397            seu        APP |
        |------------------------------------------------|
114324. |     H132920375-623-1            seu        APP |
114326. |            C00003406            seu        APP |
114345. |            C00001086            seu        APA |
114376. |            C00003137            seu        APP |
114413. |            C00003223            seu        APP |
        |------------------------------------------------|
114428. |     H111940137-460-2            seu        APP |
114453. |     H110740135-193-2            seu        APP |
114561. |            C00008625          tsst1        APP |
115169. |     H113640238-143-1          tsst1        APA |
115208. |            C00003134          tsst1        APP |
        |------------------------------------------------|
115275. |     RH11000301-155-1          tsst1        APP |
115362. |            C00008949          tsst1        APP |
        +------------------------------------------------+

. use viru_panel_all, clear

. 
. 
. 
. ******************************************************

. 
. noi di _n(5) _dup(80) "=" _n " 1 virulence predictions by site" _n _dup(80) "="





================================================================================
 1 virulence predictions by site
================================================================================

. 
. 
. 
. 
. 
. noi tab site valuea, m

              |                        valueall
         site |       aaa        apa        app        ppa        ppp |     Total
--------------+-------------------------------------------------------+----------
          eta |     1,338          1          0          0         40 |     1,379 
          etb |     1,372          1          0          1          5 |     1,379 
          etd |     1,320          1          0          1         57 |     1,379 
         meca |       999          1          0          2        377 |     1,379 
         mecc |     1,362          0          0          0         17 |     1,379 
          pvl |     1,266          3          0          1        109 |     1,379 
          sea |     1,080          1          0          3        295 |     1,379 
          seb |     1,267          1          0          2        109 |     1,379 
          sec |     1,149          1          0          4        225 |     1,379 
          sed |     1,313          0          0          0         66 |     1,379 
          see |     1,375          0          0          0          4 |     1,379 
          seg |       600          6          0         20        753 |     1,379 
          seh |     1,241          2          0          2        134 |     1,379 
          sei |       596          3          6         33        741 |     1,379 
          sej |     1,310          0          0          0         69 |     1,379 
         selr |     1,312          0          0          0         67 |     1,379 
          sep |     1,268          0          1          2        108 |     1,379 
          seu |       595          2          0         57        725 |     1,379 
        tsst1 |     1,119          1          0          4        255 |     1,379 
--------------+-------------------------------------------------------+----------
        Total |    21,882         24          7        132      4,156 |    26,201 


. 
. gen agree  = (valuea=="ppp"| valuea=="aaa" )

. 
. summ agree

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       agree |     26,201    .9937789      .07863          0          1

. 
. noi di r(sum) " out of " r(N) " virulence predictions agree"
26038 out of 26201 virulence predictions agree

. 
. noi di r(sum)/_N*100
99.377886

. 
. 
. 
. 
. 
. noi di "disagreements by site"
disagreements by site

. 
. noi bysort gold: tab site valueall

----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = A

              |                  valueall
         site |       aaa        apa        ppa        ppp |     Total
--------------+--------------------------------------------+----------
          eta |       187          1          0          0 |       188 
          etb |       202          0          1          0 |       203 
          etd |       192          1          0          0 |       193 
         meca |       175          1          0          1 |       177 
         mecc |       155          0          0          0 |       155 
          pvl |       237          2          0          0 |       239 
          sea |       163          0          1          1 |       165 
          seb |       183          1          0          1 |       185 
          sec |       174          1          1          1 |       177 
          sed |       189          0          0          0 |       189 
          see |       202          0          0          0 |       202 
          seg |       126          1          1          0 |       128 
          seh |       177          1          0          1 |       179 
          sei |       126          0          1          0 |       127 
          sej |       185          0          0          0 |       185 
         selr |       186          0          0         19 |       205 
          sep |       194          0          0         11 |       205 
          seu |       126          0         11         47 |       184 
        tsst1 |       183          1          1          0 |       185 
--------------+--------------------------------------------+----------
        Total |     3,362         10         17         82 |     3,471 


----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = NA

              |                        valueall
         site |       aaa        apa        app        ppa        ppp |     Total
--------------+-------------------------------------------------------+----------
          eta |     1,151          0          0          0         22 |     1,173 
          etb |     1,170          1          0          0          2 |     1,173 
          etd |     1,128          0          0          1         44 |     1,173 
         meca |       824          0          0          1        226 |     1,051 
         mecc |     1,207          0          0          0          4 |     1,211 
          pvl |     1,026          0          0          1         18 |     1,045 
          sea |       914          1          0          2        257 |     1,174 
          seb |     1,084          0          0          2         88 |     1,174 
          sec |       974          0          0          3        197 |     1,174 
          sed |     1,124          0          0          0         50 |     1,174 
          see |     1,173          0          0          0          1 |     1,174 
          seg |       473          5          0         19        677 |     1,174 
          seh |     1,062          1          0          2        109 |     1,174 
          sei |       467          2          6         26        673 |     1,174 
          sej |     1,124          0          0          0         50 |     1,174 
         selr |     1,126          0          0          0         48 |     1,174 
          sep |     1,074          0          1          2         97 |     1,174 
          seu |       469          2          0         43        660 |     1,174 
        tsst1 |       936          0          0          3        233 |     1,172 
--------------+-------------------------------------------------------+----------
        Total |    18,506         12          7        105      3,456 |    22,086 


----------------------------------------------------------------------------------------------------------------------------------
-> goldstandard = P

              |                  valueall
         site |       aaa        apa        ppa        ppp |     Total
--------------+--------------------------------------------+----------
          eta |         0          0          0         18 |        18 
          etb |         0          0          0          3 |         3 
          etd |         0          0          0         13 |        13 
         meca |         0          0          1        150 |       151 
         mecc |         0          0          0         13 |        13 
          pvl |         3          1          0         91 |        95 
          sea |         3          0          0         37 |        40 
          seb |         0          0          0         20 |        20 
          sec |         1          0          0         27 |        28 
          sed |         0          0          0         16 |        16 
          see |         0          0          0          3 |         3 
          seg |         1          0          0         76 |        77 
          seh |         2          0          0         24 |        26 
          sei |         3          1          6         68 |        78 
          sej |         1          0          0         19 |        20 
          seu |         0          0          3         18 |        21 
        tsst1 |         0          0          0         22 |        22 
--------------+--------------------------------------------+----------
        Total |        14          2         10        618 |       644 



. 
. 
. 
. noi di "discrenpancies"
discrenpancies

. 
. sort site gold valueall sample site

. 
. noi list sample site valueall if agree!=1

       +-----------------------------------------+
       |               sample    site   valueall |
       |-----------------------------------------|
  188. |     H105020486-191-2     eta        apa |
 1582. |     H112660153-200-1     etb        ppa |
 2753. |            C00013318     etb        apa |
 2951. |     H110740135-193-2     etd        apa |
 4080. |            C00003337     etd        ppa |
       |-----------------------------------------|
 4313. |     RH11000301-155-1    meca        apa |
 5139. |  H094920323-271-A1-2    meca        ppa |
 5366. |     H092520302-216-1    meca        ppa |
 7133. |  H094920323-271-A1-2     pvl        apa |
 7134. |     H122880144-207-1     pvl        apa |
       |-----------------------------------------|
 8161. |            C00003224     pvl        ppa |
 8183. | H113420072-336-B08-2     pvl        apa |
 8438. |     RH11000301-155-1     sea        ppa |
 9354. |     RH08000028-150-1     sea        apa |
 9355. |            C00003165     sea        ppa |
       |-----------------------------------------|
 9356. |            C00003207     sea        ppa |
 9837. |     H122880144-207-1     seb        apa |
10923. |            C00001265     seb        ppa |
10924. |            C00003306     seb        ppa |
11207. |     H113640238-143-1     sec        apa |
       |-----------------------------------------|
11208. |     RH11000301-155-1     sec        ppa |
12184. |            C00003393     sec        ppa |
12185. |            C00003421     sec        ppa |
12186. |            C00003425     sec        ppa |
15296. |     H122880144-207-1     seg        apa |
       |-----------------------------------------|
15297. |  H094920323-271-A1-2     seg        ppa |
15771. |            C00001086     seg        apa |
15772. |            C00001102     seg        apa |
15773. |            C00003248     seg        apa |
15774. |            C00003341     seg        apa |
       |-----------------------------------------|
15775. |            C00003415     seg        apa |
15776. |            C00003140     seg        ppa |
15777. |            C00003314     seg        ppa |
15778. |            C00003315     seg        ppa |
15779. |            C00003317     seg        ppa |
       |-----------------------------------------|
15780. |            C00003318     seg        ppa |
15781. |            C00003320     seg        ppa |
15782. |            C00003321     seg        ppa |
15783. |            C00003339     seg        ppa |
15784. |            C00003340     seg        ppa |
       |-----------------------------------------|
15785. |            C00003347     seg        ppa |
15786. |            C00003362     seg        ppa |
15787. |            C00003382     seg        ppa |
15788. |            C00003385     seg        ppa |
15789. |            C00003389     seg        ppa |
       |-----------------------------------------|
15790. |            C00003393     seg        ppa |
15791. |            C00003406     seg        ppa |
15792. |            C00003421     seg        ppa |
15793. |            C00003423     seg        ppa |
15794. |            C00003425     seg        ppa |
       |-----------------------------------------|
16726. |  H120420116-223-A0-2     seh        apa |
17790. |            C00003207     seh        apa |
17791. |            C00003134     seh        ppa |
17792. | RH12000046-298-D03-2     seh        ppa |
18054. |  H094920323-271-A1-2     sei        ppa |
       |-----------------------------------------|
18522. |            C00001086     sei        apa |
18523. |            C00003337     sei        apa |
18524. |            C00000785     sei        app |
18525. |            C00000786     sei        app |
18526. |            C00000790     sei        app |
       |-----------------------------------------|
18527. |            C00000800     sei        app |
18528. |            C00000815     sei        app |
18529. |            C00000817     sei        app |
18530. |            C00003134     sei        ppa |
18531. |            C00003140     sei        ppa |
       |-----------------------------------------|
18532. |            C00003260     sei        ppa |
18533. |            C00003278     sei        ppa |
18534. |            C00003301     sei        ppa |
18535. |            C00003315     sei        ppa |
18536. |            C00003317     sei        ppa |
       |-----------------------------------------|
18537. |            C00003318     sei        ppa |
18538. |            C00003320     sei        ppa |
18539. |            C00003321     sei        ppa |
18540. |            C00003333     sei        ppa |
18541. |            C00003339     sei        ppa |
       |-----------------------------------------|
18542. |            C00003340     sei        ppa |
18543. |            C00003341     sei        ppa |
18544. |            C00003347     sei        ppa |
18545. |            C00003382     sei        ppa |
18546. |            C00003385     sei        ppa |
       |-----------------------------------------|
18547. |            C00003406     sei        ppa |
18548. |            C00003423     sei        ppa |
18549. |            C00003425     sei        ppa |
18550. |     H120440759-384-2     sei        ppa |
18551. |     H123120336-557-1     sei        ppa |
       |-----------------------------------------|
18552. |     H124940430-401-1     sei        ppa |
18553. |     H132620132-420-2     sei        ppa |
18554. |     RH12000370-430-2     sei        ppa |
18555. |     RH12000379-439-2     sei        ppa |
19232. |     H103220288-184-2     sei        apa |
       |-----------------------------------------|
19233. |     H034660053-158-1     sei        ppa |
19234. |     H100140197-167-2     sei        ppa |
19235. |     H110740135-193-2     sei        ppa |
19236. |     H111740190-456-2     sei        ppa |
19237. |     H114720432-482-1     sei        ppa |
       |-----------------------------------------|
19238. |  RH12000503-261-G1-2     sei        ppa |
23344. |            C00003165     sep        app |
23345. |            C00001265     sep        ppa |
23346. |            C00003270     sep        ppa |
23570. |  H094920323-271-A1-2     seu        ppa |
       |-----------------------------------------|
23571. |     H100800158-172-2     seu        ppa |
23572. |     H110740135-193-2     seu        ppa |
23573. |     H111600186-455-2     seu        ppa |
23574. |     H111940137-460-2     seu        ppa |
23575. |     H114720434-145-1     seu        ppa |
       |-----------------------------------------|
23576. |     H120220271-381-2     seu        ppa |
23577. |     H124720623-209-1     seu        ppa |
23578. |     H124860349-210-1     seu        ppa |
23579. | RH11000044-286-H01-2     seu        ppa |
23580. | RH11000090-289-C02-2     seu        ppa |
       |-----------------------------------------|
24097. |            C00001086     seu        apa |
24098. |            C00003385     seu        apa |
24099. |            C00003084     seu        ppa |
24100. |            C00003137     seu        ppa |
24101. |            C00003140     seu        ppa |
       |-----------------------------------------|
24102. |            C00003223     seu        ppa |
24103. |            C00003249     seu        ppa |
24104. |            C00003277     seu        ppa |
24105. |            C00003307     seu        ppa |
24106. |            C00003314     seu        ppa |
       |-----------------------------------------|
24107. |            C00003315     seu        ppa |
24108. |            C00003317     seu        ppa |
24109. |            C00003318     seu        ppa |
24110. |            C00003320     seu        ppa |
24111. |            C00003340     seu        ppa |
       |-----------------------------------------|
24112. |            C00003341     seu        ppa |
24113. |            C00003347     seu        ppa |
24114. |            C00003352     seu        ppa |
24115. |            C00003382     seu        ppa |
24116. |            C00003389     seu        ppa |
       |-----------------------------------------|
24117. |            C00003393     seu        ppa |
24118. |            C00003397     seu        ppa |
24119. |            C00003406     seu        ppa |
24120. |            C00003410     seu        ppa |
24121. |            C00003411     seu        ppa |
       |-----------------------------------------|
24122. |            C00003414     seu        ppa |
24123. |            C00003421     seu        ppa |
24124. |            C00003423     seu        ppa |
24125. |            C00003425     seu        ppa |
24126. |            C00007096     seu        ppa |
       |-----------------------------------------|
24127. |            C00013224     seu        ppa |
24128. |     H113560219-469-2     seu        ppa |
24129. |     H114340058-470-2     seu        ppa |
24130. |     H120440759-384-2     seu        ppa |
24131. |     H121000455-532-1     seu        ppa |
       |-----------------------------------------|
24132. |     H121320099-507-1     seu        ppa |
24133. |     H123120336-557-1     seu        ppa |
24134. |     H123120337-556-1     seu        ppa |
24135. |     H130660215-405-2     seu        ppa |
24136. |     H131800573-415-2     seu        ppa |
       |-----------------------------------------|
24137. |     H132620132-420-2     seu        ppa |
24138. |     H132920375-623-1     seu        ppa |
24139. |     H133100176-615-1     seu        ppa |
24140. |     H133200270-608-1     seu        ppa |
24141. |     H133920237-578-1     seu        ppa |
       |-----------------------------------------|
24802. |  H104340410-220-F0-2     seu        ppa |
24803. | H125280642-356-F10-2     seu        ppa |
24804. |     H125280642-841-2     seu        ppa |
25006. |     H113640238-143-1   tsst1        apa |
25007. |     RH11000301-155-1   tsst1        ppa |
       |-----------------------------------------|
25944. |            C00003134   tsst1        ppa |
25945. |            C00008625   tsst1        ppa |
25946. |            C00008949   tsst1        ppa |
       +-----------------------------------------+

. 
. 
. 
. drop agree

. import excel "E:\users\amy.mason\staph_carriage\Inputs\spa_types_donaby.xlsx", sheet("Sheet2") cellrange(B1:D86) clear

. drop C

. rename B spatype

. split D
variable created as string: 
D1

. split D, e(-)
option e() not allowed
r(198);

. help split

. split D, parse(-)
cannot generate new variables using stub D
r(110);

. drop D1

. help split

. split D, parse("-")
variables created as string: 
D1  D2

. rename D1 patid

. raname D2 timepoint
command raname is unrecognized
r(199);

. rename D2 timepoint

. drop D

. save "E:\users\amy.mason\staph_carriage\Datasets\spa_update.dta"
file E:\users\amy.mason\staph_carriage\Datasets\spa_update.dta saved

. import excel "E:\users\amy.mason\staph_carriage\Inputs\spa_types_donaby.xlsx", sheet("repeats for 'new' types") clear

. rename A spatype

. rename B repeats

. rename C spa_lookup

. *************************************************************************************************************

. 
. cd "E:\users\amy.mason\staph_carriage\Datasets"
E:\users\amy.mason\staph_carriage\Datasets

. 
. 
. 
. 
. 
. import excel "E:\users\amy.mason\staph_carriage\Inputs\spa_types_donaby.xlsx", sheet("Sheet2") cellrange(B1:D86) clear

. 
. drop C

. 
. rename B spatype

. 
. split D, parse("-")
variables created as string: 
D1  D2

. 
. rename D1 patid

. 
. rename D2 timepoint

. 
. drop D

. 
. save "E:\users\amy.mason\staph_carriage\Datasets\spa_update.dta", replace
file E:\users\amy.mason\staph_carriage\Datasets\spa_update.dta saved

. 
. 
. 
. import excel "E:\users\amy.mason\staph_carriage\Inputs\spa_types_donaby.xlsx", sheet("repeats for 'new' types") clear

. 
. rename A spatype

. 
. rename B repeats

. 
. rename C spa_lookup

. 
. 
. 
. merge 1:m spatype using spa_update, update
(note: variable spatype was str4, now str5 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                            73
        from master                         4  (_merge==1)
        from using                         69  (_merge==2)

    matched                                17
        not updated                        17  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. assert _merge ==2 | _merge==3
4 contradictions in 90 observations
assertion is false
r(9);

. 
. 
. 
. replace spatype=spa_lookup if _merge==3 & !inlist(spa_lookup, "unknown", "")
variable spatype was str5 now str6
(6 real changes made)

. drop if _merge==1
(4 observations deleted)

. replace spatype=="undeterminable" if spatype==""
== invalid name
r(198);

. replace spatype="undeterminable" if spatype==""
variable spatype was str6 now str14
(2 real changes made)

. cd "E:\users\amy.mason\staph_carriage\Datasets"
E:\users\amy.mason\staph_carriage\Datasets

. 
. 
. 
. 
. 
. import excel "E:\users\amy.mason\staph_carriage\Inputs\spa_types_donaby.xlsx", sheet("Sheet2") cellrange(B1:D86) clear

. 
. drop C

. 
. rename B spatype

. 
. split D, parse("-")
variables created as string: 
D1  D2

. 
. rename D1 patid

. 
. rename D2 timepoint

. 
. drop D

. 
. save "E:\users\amy.mason\staph_carriage\Datasets\spa_update.dta", replace
file E:\users\amy.mason\staph_carriage\Datasets\spa_update.dta saved

. 
. 
. 
. import excel "E:\users\amy.mason\staph_carriage\Inputs\spa_types_donaby.xlsx", sheet("repeats for 'new' types") clear

. 
. rename A spatype

. 
. rename B repeats

. 
. rename C spa_lookup

. 
. 
. 
. merge 1:m spatype using spa_update, update
(note: variable spatype was str4, now str5 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                            73
        from master                         4  (_merge==1)
        from using                         69  (_merge==2)

    matched                                17
        not updated                        17  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==1
(4 observations deleted)

. 
. assert _merge ==2 | _merge==3

. 
. 
. 
. replace spatype=spa_lookup if _merge==3 & !inlist(spa_lookup, "unknown", "")
variable spatype was str5 now str6
(6 real changes made)

. 
. replace spatype="undeterminable" if spatype==""
variable spatype was str6 now str14
(2 real changes made)

. 
. * note this is not always the case, but was in these two cases.

. 
. save "E:\users\amy.mason\staph_carriage\Datasets\spa_update2.dta", replace
(note: file E:\users\amy.mason\staph_carriage\Datasets\spa_update2.dta not found)
file E:\users\amy.mason\staph_carriage\Datasets\spa_update2.dta saved

. * Cleans up main dataset

. 
. 
. 
. set li 130

. 
. 
. 
. cap log close
