Run by AMM on  2 May 2017 12:02:01





================================================================================
 1 Combine all predictive sets
================================================================================
combine
395178 results
on 109 sites
from 1429 samples





================================================================================
 1 Remove samples that were contaminated for all methods
================================================================================
153983 sample sites
10 samples contaminated
file problem_samples.dta saved
2820 values for contaminated samples dropped from study
(2,820 observations deleted)





================================================================================
consolidate names/ spelling errors for various sites
================================================================================
combining numbered variants into single sites

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
          ccra |      2,758       16.67       16.67
          ccrb |      2,758       16.67       33.33
          erma |      2,758       16.67       50.00
           sea |      2,758       16.67       66.67
           seh |      2,758       16.67       83.33
           seu |      2,758       16.67      100.00
---------------+-----------------------------------
         Total |     16,548      100.00

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
        ccra_1 |      2,758        5.88        5.88
        ccra_2 |      2,758        5.88       11.76
        ccra_3 |      2,758        5.88       17.65
        ccra_4 |      2,758        5.88       23.53
        ccrb_1 |      2,758        5.88       29.41
        ccrb_2 |      2,758        5.88       35.29
        ccrb_3 |      2,758        5.88       41.18
        ccrb_4 |      2,758        5.88       47.06
        ccrb_6 |      2,758        5.88       52.94
        erma_1 |      2,758        5.88       58.82
        erma_2 |      2,758        5.88       64.71
         sea_1 |      2,758        5.88       70.59
         sea_2 |      2,758        5.88       76.47
         seh_1 |      2,758        5.88       82.35
         seh_2 |      2,758        5.88       88.24
         seu_1 |      2,758        5.88       94.12
         seu_2 |      2,758        5.88      100.00
---------------+-----------------------------------
         Total |     46,886      100.00

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
      aac6aph2 |      4,177        1.34        1.34
    aaddaph4ia |      4,177        1.34        2.68
    aadeant6ia |      4,177        1.34        4.02
allelicprofile |      1,379        0.44        4.46
        ant9ia |      4,177        1.34        5.80
        ant9ib |      4,177        1.34        7.14
        aph2ic |      4,177        1.34        8.48
  apha3aph3iii |      4,177        1.34        9.82
            ar |      1,419        0.45       10.27
          arca |      4,177        1.34       11.61
          arcb |      4,177        1.34       12.95
          arcc |      4,177        1.34       14.29
          arcd |      4,177        1.34       15.63
          blaz |      4,177        1.34       16.97
           cat |      4,177        1.34       18.31
         ccrca |      4,177        1.34       19.65
         ccrcb |      4,177        1.34       20.99
         ccrcc |      4,177        1.34       22.32
           cfr |      4,177        1.34       23.66
           chp |      4,177        1.34       25.00
          dfra |      4,177        1.34       26.34
          dfrb |      4,177        1.34       27.68
          dfrc |      4,177        1.34       29.02
          dfrd |      4,177        1.34       30.36
          dfrg |      4,177        1.34       31.70
          dfrk |      4,177        1.34       33.04
          ermb |      4,177        1.34       34.38
          ermc |      4,177        1.34       35.72
          ermt |      4,177        1.34       37.06
          ermy |      4,177        1.34       38.40
           eta |      4,177        1.34       39.73
           etb |      4,177        1.34       41.07
           etd |      4,177        1.34       42.41
          fusa |      4,177        1.34       43.75
          fusb |      4,177        1.34       45.09
          fusc |      4,177        1.34       46.43
          grla |      4,177        1.34       47.77
          gyra |      4,177        1.34       49.11
          iles |      2,758        0.88       49.99
          isab |      4,177        1.34       51.33
          lnua |      4,177        1.34       52.67
          lnub |      4,177        1.34       54.01
           luk |      1,419        0.45       54.47
          lukm |      4,177        1.34       55.81
         lukmf |      4,177        1.34       57.14
        lukpvf |      4,177        1.34       58.48
        lukpvs |      4,177        1.34       59.82
          meca |      4,177        1.34       61.16
          mecc |      4,177        1.34       62.50
          mlst |      2,758        0.88       63.39
          mphc |      4,177        1.34       64.73
          msra |      4,177        1.34       66.06
          mupa |      4,177        1.34       67.40
          mupb |      4,177        1.34       68.74
          qaca |      4,177        1.34       70.08
          qacb |      4,177        1.34       71.42
       qaccsmr |      4,177        1.34       72.76
          rpob |      4,177        1.34       74.10
           sak |      4,177        1.34       75.44
          sasx |      4,177        1.34       76.78
          sat4 |      4,177        1.34       78.12
           scn |      4,177        1.34       79.46
           seb |      4,177        1.34       80.80
           sec |      4,177        1.34       82.14
           sed |      4,177        1.34       83.47
           str |      4,177        1.34       84.81
          tetk |      4,177        1.34       86.15
          tetl |      4,177        1.34       87.49
          tetm |      4,177        1.34       88.83
          teto |      4,177        1.34       90.17
         tsst1 |      4,177        1.34       91.51
          vana |      4,177        1.34       92.85
          vanb |      4,177        1.34       94.19
          vanc |      4,177        1.34       95.53
          vgaa |      4,177        1.34       96.87
        vgaalc |      1,419        0.45       97.32
          vgab |      4,177        1.34       98.66
          vgba |      4,177        1.34      100.00
---------------+-----------------------------------
         Total |    311,896      100.00
127590 sample sites
1419 samples
90 sites
127590 sample sites

                  type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Aquired Resistance |     65,274       52.91       52.91
Chromosomal Resistance |      8,474        6.87       59.78
                   ccr |      7,095        5.75       65.53
                  mlst |      1,379        1.12       66.65
             virulence |     41,151       33.35      100.00
-----------------------+-----------------------------------
                 Total |    123,373      100.00
1419 samples
90 sites

                  type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                       |          3        3.33        3.33
    Aquired Resistance |         46       51.11       54.44
Chromosomal Resistance |          6        6.67       61.11
                   ccr |          5        5.56       66.67
                  mlst |          1        1.11       67.78
             virulence |         29       32.22      100.00
-----------------------+-----------------------------------
                 Total |         90      100.00

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
allelicprofile |      1,379       32.70       32.70
            ar |      1,419       33.65       66.35
        vgaalc |      1,419       33.65      100.00
---------------+-----------------------------------
         Total |      4,217      100.00





================================================================================
 2 Missing data between methods
================================================================================
sample-sites missing values - key (typewriter mykrobe genefinder)
172 not called by any method; people missing from T/G and called blank by mycrobe - see 010 bonus people below
7445 Called only by mykrobe

               |    new
          site |       010 |     Total
---------------+-----------+----------
        vgaalc |     1,419 |     1,419 
---------------+-----------+----------
         Total |     1,419 |     1,419 

1419 vgaalc only supplied by mykrobe, drop from database
(1,419 observations deleted)
126171 sample sites remaining

               |          new
          site |       010        111 |     Total
---------------+----------------------+----------
           luk |     1,419          0 |     1,419 
          lukm |        40      1,379 |     1,419 
         lukmf |        40      1,379 |     1,419 
        lukpvf |        40      1,379 |     1,419 
        lukpvs |        40      1,379 |     1,419 
---------------+----------------------+----------
         Total |     1,579      5,516 |     7,095 

1419 luk only supplied by mykrobe, drop from database
(1,419 observations deleted)
124752 sample sites remaining

               |          new
          site |       010        111 |     Total
---------------+----------------------+----------
            ar |     1,419          0 |     1,419 
          arca |        40      1,379 |     1,419 
          arcb |        40      1,379 |     1,419 
          arcc |        40      1,379 |     1,419 
          arcd |        40      1,379 |     1,419 
---------------+----------------------+----------
         Total |     1,579      5,516 |     7,095 

1419ar only supplied by mykrobe, drop from database
(1,419 observations deleted)
123333 sample sites remaining

                     |          new
           Sample_id |       000        010 |     Total
---------------------+----------------------+----------
           C00001125 |         5         79 |        84 
           C00003094 |         5         79 |        84 
           C00003117 |         5         79 |        84 
           C00003123 |         5         79 |        84 
           C00003214 |         4         80 |        84 
           C00003273 |         5         79 |        84 
           C00003293 |         5         79 |        84 
           C00003342 |         5         79 |        84 
           C00009009 |         4         80 |        84 
           C00011569 |         4         80 |        84 
           C00011570 |         3         81 |        84 
           C00011571 |         5         79 |        84 
           C00011572 |         3         81 |        84 
           C00011581 |         5         79 |        84 
           C00011582 |         5         79 |        84 
           C00011584 |         5         79 |        84 
           C00011593 |         5         79 |        84 
           C00011594 |         2         82 |        84 
           C00011595 |         3         81 |        84 
           C00011596 |         3         81 |        84 
           C00011605 |         3         81 |        84 
           C00011606 |         5         79 |        84 
           C00011607 |         3         81 |        84 
           C00011608 |         5         79 |        84 
           C00011617 |         4         80 |        84 
           C00011618 |         5         79 |        84 
           C00011619 |         4         80 |        84 
           C00011620 |         5         79 |        84 
           C00011629 |         4         80 |        84 
           C00011630 |         5         79 |        84 
           C00011631 |         5         79 |        84 
           C00011632 |         5         79 |        84 
           C00011641 |         3         81 |        84 
           C00011642 |         5         79 |        84 
           C00011643 |         3         81 |        84 
           C00011644 |         3         81 |        84 
           C00011653 |         5         79 |        84 
           C00011654 |         5         79 |        84 
           C00011655 |         4         80 |        84 
           C00011656 |         5         79 |        84 
---------------------+----------------------+----------
               Total |       172      3,188 |     3,360 

40 samples are only processed by mykrobe - drop from comparision set
3360 sample sites affected
1379Called only by genefinder
sites in sample-sites only supplied by genefinder

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
allelicprofile |      1,379      100.00      100.00
---------------+-----------------------------------
         Total |      1,379      100.00

               |    new
          site |       001 |     Total
---------------+-----------+----------
allelicprofile |     1,379 |     1,379 
---------------+-----------+----------
         Total |     1,379 |     1,379 

1379 allelicprofile only supplied by genefinder, drop from database
(1,379 observations deleted)
118594 sample sites remaining
8793 no value in mykrobe, eg fusa

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
          dfrb |      1,298       14.76       14.76
          fusa |      1,318       14.99       29.75
          grla |        979       11.13       40.88
          gyra |      1,085       12.34       53.22
          iles |      1,379       15.68       68.91
          mlst |      1,379       15.68       84.59
          rpob |      1,355       15.41      100.00
---------------+-----------------------------------
         Total |      8,793      100.00

                              zam value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                 fus_E468V-GAA601104GTA |          1        1.64        1.64
                 fus_G452S-GGT601056AGT |          1        1.64        3.28
                 fus_H457Q-CAC601071CAA |          1        1.64        4.92
                 fus_H457Y-CAC601071TAC |          4        6.56       11.48
fus_H457Y-CAC601071TACfus_A67T-GCA599.. |          2        3.28       14.75
                 fus_L461F-TTA601083TTT |          1        1.64       16.39
                 fus_L461K-TTA601083AAA |         22       36.07       52.46
                 fus_L461S-TTA601083TCA |         17       27.87       80.33
fus_P404L-CCA600912CTAfus_L461F-TTA60.. |          1        1.64       81.97
                 fus_P404Q-CCA600912CAA |          1        1.64       83.61
                 fus_P406L-CCA600918CTA |          1        1.64       85.25
fus_P406L-CCA600918CTAfus_A67T-GCA599.. |          1        1.64       86.89
                  fus_V90I-GTA599970ATA |          8       13.11      100.00
----------------------------------------+-----------------------------------
                                  Total |         61      100.00

                      |         typewriter value
     genefinder value | 404:P=>..   656:T=>S         wt |     Total
----------------------+---------------------------------+----------
161:P-X;461:L-X;473.. |         1          0          0 |         1 
              373:D-G |         0          0          1 |         1 
              656:T-S |         0          1          0 |         1 
       71:A-X;160:A-X |         0          0          1 |         1 
71:A-X;373:D-X;456:.. |         0          0          2 |         2 
       71:A-X;456:L-X |         0          0          3 |         3 
                   wt |         0          0      1,309 |     1,309 
----------------------+---------------------------------+----------
                Total |         1          1      1,316 |     1,318 

 problem is that mykrobe is not reporting absence of mutation as other than blank
solution: replace 7414 blanks in these sites in mykroke with wt -  not mlst which is not a mutation site
(7,414 real changes made)

        new |      Freq.     Percent        Cum.
------------+-----------------------------------
        101 |      1,379        1.16        1.16
        111 |    117,215       98.84      100.00
------------+-----------------------------------
      Total |    118,594      100.00
all remaining sample sites are either complete accross all three methods or mlst (mykrobe absent)
mlst agreement between typewriter and genefinder in 1370 cases out of 1379
value missing for all mykrobe
rest

                      |   typewriter value
     genefinder value |        NF  Saur-ST.. |     Total
----------------------+----------------------+----------
                  182 |         1          0 |         1 
                   22 |         1          0 |         1 
                 2415 |         1          0 |         1 
                 2416 |         1          0 |         1 
                 2889 |         1          0 |         1 
                  425 |         1          0 |         1 
                    7 |         1          0 |         1 
                   80 |         1          0 |         1 
                Novel |         0          1 |         1 
----------------------+----------------------+----------
                Total |         8          1 |         9 

dropping 1379 mlst sites
(1,379 observations deleted)
1379 iles site reports dropped due to not being in Claire's gene panel on paper
115836 sample sites
1379 samples
84 sites

               |                    type
          site | Aquired..  Chromos..        ccr  virulence |     Total
---------------+--------------------------------------------+----------
      aac6aph2 |         1          0          0          0 |         1 
    aaddaph4ia |         1          0          0          0 |         1 
    aadeant6ia |         1          0          0          0 |         1 
        ant9ia |         1          0          0          0 |         1 
        ant9ib |         1          0          0          0 |         1 
        aph2ic |         1          0          0          0 |         1 
  apha3aph3iii |         1          0          0          0 |         1 
          arca |         0          0          0          1 |         1 
          arcb |         0          0          0          1 |         1 
          arcc |         0          0          0          1 |         1 
          arcd |         0          0          0          1 |         1 
          blaz |         1          0          0          0 |         1 
           cat |         1          0          0          0 |         1 
          ccra |         0          0          1          0 |         1 
          ccrb |         0          0          1          0 |         1 
         ccrca |         0          0          1          0 |         1 
         ccrcb |         0          0          1          0 |         1 
         ccrcc |         0          0          1          0 |         1 
           cfr |         1          0          0          0 |         1 
           chp |         0          0          0          1 |         1 
          dfra |         1          0          0          0 |         1 
          dfrb |         0          1          0          0 |         1 
          dfrc |         1          0          0          0 |         1 
          dfrd |         1          0          0          0 |         1 
          dfrg |         1          0          0          0 |         1 
          dfrk |         1          0          0          0 |         1 
          erma |         1          0          0          0 |         1 
          ermb |         1          0          0          0 |         1 
          ermc |         1          0          0          0 |         1 
          ermt |         1          0          0          0 |         1 
          ermy |         1          0          0          0 |         1 
           eta |         0          0          0          1 |         1 
           etb |         0          0          0          1 |         1 
           etd |         0          0          0          1 |         1 
          fusa |         0          1          0          0 |         1 
          fusb |         1          0          0          0 |         1 
          fusc |         1          0          0          0 |         1 
          grla |         0          1          0          0 |         1 
          gyra |         0          1          0          0 |         1 
          isab |         1          0          0          0 |         1 
          lnua |         1          0          0          0 |         1 
          lnub |         1          0          0          0 |         1 
          lukm |         0          0          0          1 |         1 
         lukmf |         0          0          0          1 |         1 
        lukpvf |         0          0          0          1 |         1 
        lukpvs |         0          0          0          1 |         1 
          meca |         1          0          0          0 |         1 
          mecc |         1          0          0          0 |         1 
          mphc |         1          0          0          0 |         1 
          msra |         1          0          0          0 |         1 
          mupa |         1          0          0          0 |         1 
          mupb |         1          0          0          0 |         1 
          qaca |         1          0          0          0 |         1 
          qacb |         1          0          0          0 |         1 
       qaccsmr |         1          0          0          0 |         1 
          rpob |         0          1          0          0 |         1 
           sak |         0          0          0          1 |         1 
          sasx |         0          0          0          1 |         1 
          sat4 |         1          0          0          0 |         1 
           scn |         0          0          0          1 |         1 
           sea |         0          0          0          1 |         1 
           seb |         0          0          0          1 |         1 
           sec |         0          0          0          1 |         1 
           sed |         0          0          0          1 |         1 
           see |         0          0          0          1 |         1 
           seg |         0          0          0          1 |         1 
           seh |         0          0          0          1 |         1 
           sei |         0          0          0          1 |         1 
           sej |         0          0          0          1 |         1 
          selr |         0          0          0          1 |         1 
           sep |         0          0          0          1 |         1 
           seu |         0          0          0          1 |         1 
           str |         1          0          0          0 |         1 
          tetk |         1          0          0          0 |         1 
          tetl |         1          0          0          0 |         1 
          tetm |         1          0          0          0 |         1 
          teto |         1          0          0          0 |         1 
         tsst1 |         0          0          0          1 |         1 
          vana |         1          0          0          0 |         1 
          vanb |         1          0          0          0 |         1 
          vanc |         1          0          0          0 |         1 
          vgaa |         1          0          0          0 |         1 
          vgab |         1          0          0          0 |         1 
          vgba |         1          0          0          0 |         1 
---------------+--------------------------------------------+----------
         Total |        46          5          5         28 |        84 

84 sites not including Phenotype results and mlst





================================================================================
 4 Match to antibiotic prediction
================================================================================
missing values
2 values have N/A or equivalent values, set these all to A

        +--------------+
        | site   value |
        |--------------|
131659. | gyra      ND |
328708. |  etd       X |
        +--------------+
(2 real changes made)
all values equal A or P, unless chromosonal
767 replace => with - to create uniform recording of mutations
(767 real changes made)
4 remove all spaces in value reports
(4 real changes made)
18278replace WT with A in typewriter/ genewriter/ zam  reports on chromosonal mutations
(18,278 real changes made)
mutations: if count!=1 then no considered positive as not in panal on clare's paper
fusa mutations

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
161:P-X;461:L-X;473.. |         0          1 |         1 
              326:T-I |         0          2 |         2 
              373:D-G |         0          1 |         1 
376:A-T;404:P-L;461.. |         1          0 |         1 
404:P-?,406:P-?NONC.. |         0          1 |         1 
      404:P-L,461:L-F |         1          0 |         1 
     404:P-L; 461:L-F |         1          0 |         1 
              404:P-Q |         3          0 |         3 
              406:P-L |         4          0 |         4 
      406:P-L; 67:A-T |         1          0 |         1 
              452:G-S |         3          0 |         3 
              457:H-Q |         3          0 |         3 
              457:H-Y |        14          0 |        14 
      457:H-Y; 67:A-T |         2          0 |         2 
              461:L-F |         0          3 |         3 
              461:L-K |        66          0 |        66 
              461:L-S |        51          0 |        51 
              468:E-V |         0          1 |         1 
              656:T-S |         0          2 |         2 
       67:A-T;406:P-L |         1          0 |         1 
       67:A-T;457:H-Y |         2          0 |         2 
       71:A-X;160:A-X |         0          1 |         1 
71:A-X;373:D-X;456:.. |         0          2 |         2 
       71:A-X;456:L-X |         0          3 |         3 
               90:V-I |        22          0 |        22 
----------------------+----------------------+----------
                Total |       175         17 |       192 


                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
161:P-X;461:L-X;473.. |         0          1 |         1 
              326:T-I |         0          2 |         2 
              373:D-G |         0          1 |         1 
404:P-?,406:P-?NONC.. |         0          1 |         1 
              461:L-F |         0          3 |         3 
              468:E-V |         0          1 |         1 
              656:T-S |         0          2 |         2 
       71:A-X;160:A-X |         0          1 |         1 
71:A-X;373:D-X;456:.. |         0          2 |         2 
       71:A-X;456:L-X |         0          3 |         3 
                    A |         0      3,945 |     3,945 
                    P |       175          0 |       175 
----------------------+----------------------+----------
                Total |       175      3,962 |     4,137 

rpob mutations
0 possible insertions in rpob mutations; check

                      |   count
                value |         1 |     Total
----------------------+-----------+----------
              464:S-P |         3 |         3 
              468:Q-R |         1 |         1 
              477:A-D |         3 |         3 
              481:H-N |        48 |        48 
              481:H-Y |        17 |        17 
----------------------+-----------+----------
                Total |        72 |        72 

(72 real changes made)

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
                    A |         0      4,065 |     4,065 
                    P |        72          0 |        72 
----------------------+----------------------+----------
                Total |        72      4,065 |     4,137 

dfrb mutations

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
              150:H-R |        18          0 |        18 
       21:L-V; 99:F-Y |         1          0 |         1 
        21:L-V;99:F-Y |         1          0 |         1 
               31:H-N |         2          0 |         2 
               41:L-F |         3          0 |         3 
               99:F-X |         0          1 |         1 
               99:F-Y |       220          0 |       220 
----------------------+----------------------+----------
                Total |       245          1 |       246 

(245 real changes made)

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
               99:F-X |         0          1 |         1 
                    A |         0      3,891 |     3,891 
                    P |       245          0 |       245 
----------------------+----------------------+----------
                Total |       245      3,892 |     4,137 

gyra and grla mutations

----------------------------------------------------------------------------------------------------------------------------------
-> count = 1

                      |                       gyra value
           grla value |    84:S-A     84:S-L     84:S-V     84:S-X          A |     Total
----------------------+-------------------------------------------------------+----------
               45:I-M |         0          1          0          0          0 |         1 
               80:S-F |         3        858          1          1         33 |       896 
        80:S-F;84:E-K |         0          3          0          0          0 |         3 
               80:S-Y |         0          9          0          0          3 |        12 
                    A |         0          5          0          0          0 |         5 
----------------------+-------------------------------------------------------+----------
                Total |         3        876          1          1         36 |       917 


----------------------------------------------------------------------------------------------------------------------------------
-> count = .

                      |            gyra value
           grla value |    84:S-X  84:S-X;..          A |     Total
----------------------+---------------------------------+----------
               45:I-M |         0          0         99 |        99 
       45:I-M; 84:E-G |         0          0          1 |         1 
               84:E-G |         0          0          1 |         1 
                    A |         1          1      3,117 |     3,119 
----------------------+---------------------------------+----------
                Total |         1          1      3,218 |     3,220 



                       value |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                           A |      3,117       75.34       75.34
                           P |        917       22.17       97.51
        grla: 45:I-M gyra: A |         99        2.39       99.90
grla: 45:I-M; 84:E-G gyra: A |          1        0.02       99.93
        grla: 84:E-G gyra: A |          1        0.02       99.95
        grla: A gyra: 84:S-X |          1        0.02       99.98
 grla: A gyra: 84:S-X;88:E-X |          1        0.02      100.00
-----------------------------+-----------------------------------
                       Total |      4,137      100.00
r(9);

. display _N
339234

. 
. noi di _n(5) _dup(80) "=" _n " 4 Match to antibiotic prediction" _n _dup(80) "="





================================================================================
 4 Match to antibiotic prediction
================================================================================

. 
. 
. *clean up non binary values

. use temp4, clear

. reshape long
(note: j = genefinder typewriter zam)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                   115836   ->  347508
Number of variables                   8   ->       7
j variable (3 values)                     ->   method
xij variables:
valuegenefinder valuetypewriter valuezam  ->   value
-----------------------------------------------------------------------------

. 
. 
.  noi di "missing values"
missing values

. replace value = upper(value)
(19,140 real changes made)

. gen ambi = 1 if inlist(value, "ND", "NT", "LOW COV", "MIXED")
(347,507 missing values generated)

. replace ambi=1 if inlist(value, "NOT DONE", "N/A", "NF", "NA", "-", "X")
(1 real change made)

. summ ambi if ambi ==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ambi |          2           1           0          1          1

. noi di r(N) " values have N/A or equivalent values, set these all to A"
2 values have N/A or equivalent values, set these all to A

. noi list site value if ambi==1

        +--------------+
        | site   value |
        |--------------|
131659. | gyra      ND |
328708. |  etd       X |
        +--------------+

. noi replace value = "A" if ambi==1
(2 real changes made)

. tab site if ambi ==1

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
           etd |          1       50.00       50.00
          gyra |          1       50.00      100.00
---------------+-----------------------------------
         Total |          2      100.00

. drop ambi

. 
. noi di "all values equal A or P, unless chromosonal"
all values equal A or P, unless chromosonal

. replace value=upper(value)
(0 real changes made)

. 
. assert inlist(value, "A", "P") if !strpos(type, "Chro")

. 
. ***************

. gen count = 1 if strpos(value, "=>")
(346,741 missing values generated)

. summ count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |        767           1           0          1          1

. noi di r(N) " replace => with - to create uniform recording of mutations"
767 replace => with - to create uniform recording of mutations

. noi replace value = subinstr(value, "=>", "-",.)
(767 real changes made)

. drop count 

. 
. 
. gen count = 1 if strpos(value," ")
(347,504 missing values generated)

. summ count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |          4           1           0          1          1

. noi di r(N) " remove all spaces in value reports"
4 remove all spaces in value reports

. noi replace value = subinstr(value, " ", "",.)
(4 real changes made)

. drop count 

. 
. * fix new mykrobe output to same format as typewriter/genefinder 

. gen start=strpos(value,"_")

. gen end= strpos(value, "-")

. gen value2= value

. replace value2= substr(value,start+2,end-start-3)+":"+substr(value,start+1,1)+"-" +substr(value,end-1,1) ///
invalid syntax
r(198);

. if inlist(site, "fusa", "gyra", "grla", "rpob", "dfrb") & method=="zam" & value!="WT"
{ required
r(100);

. 
. 
. 
. replace value = substr(value, end+1, .)
(2,406 real changes made)

. drop start end

. gen start=strpos(value,"_")

. gen end= strpos(value, "-")

. gen value3= substr(value,start+2,end-start-3)+":"+substr(value,start+1,1)+"-" +substr(value,end-1,1) ///
invalid syntax
r(198);

. if inlist(site, "fusa", "gyra", "grla", "rpob", "dfrb") & method=="zam" & value!="WT" & start!=0
{ required
r(100);

. replace value = substr(value, end+1, .)
(24 real changes made)

. drop start end

. gen start=strpos(value,"_")

. gen end= strpos(value, "-")

. assert start==0

. replace value = value2 + "; " + value3 if value3!=""
value3 not found
r(111);

. replace value = value2 if value2!="" & value3==""
value3 not found
r(111);

. drop value2 value3 start end
variable value3 not found
r(111);

. 
. 
. 
. *swap to binary the point mutations

. * clarify absenses

. gen count = 1  if value=="WT" & strpos(type, "Chromo")
(329,230 missing values generated)

. summ count if count==1 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |     18,278           1           0          1          1

. noi di r(N) "replace WT with A in typewriter/ genewriter/ zam  reports on chromosonal mutations"
18278replace WT with A in typewriter/ genewriter/ zam  reports on chromosonal mutations

. noi replace value = "A" if count==1 
(18,278 real changes made)

. drop count

. 
. * clarify point mutations based on clare's paper *NOTE: need to do as strpos not inlist as there are multiple variations reporte
> d

. noi di "mutations: if count!=1 then no considered positive as not in panal on clare's paper"
mutations: if count!=1 then no considered positive as not in panal on clare's paper

. 
. 
. 
. * fusa

. noi di "fusa mutations"
fusa mutations

. 
. gen count =1 if strpos(value, "434:B-N")  & strpos(site, "fusa")
(347,508 missing values generated)

. replace count =1 if strpos(value, "461:L-K")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-K") & strpos(value, "457:H-Q")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-K") & strpos(value, "473:C-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "67:A-T" ) & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "70:A-V" ) & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "67:R-C" ) & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-K")  & strpos(value, "457:H-Q") & strpos(value, "655:A-V") & strpos(value, "90:V-I") & 
> strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-F")  & strpos(value, "376:A-V") & strpos(value, "655:A-P") & strpos(value, "463:D-G") &
>  strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Q")  & strpos(value, "461:L-F") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "90:V-I")   & strpos(value, "457:H-Q") & strpos(value, "461:L-K") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-S")  & strpos(value, "404:P-L") & strpos(value, "71:A-V")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-S")  & strpos(value, "90:V-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "161:M-I") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "416:S-F") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "373:D-N") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "115:Q-L")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "436:T-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "452:G-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "456:L-F")  & strpos(value, "376:A-V") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-F")  & strpos(value, "444:E-K") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "444:E-K")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "556:G-S" ) & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "659:R-L")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "404:P-L")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "451:G-V")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y")  & strpos(value, "659:R-L") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y")  & strpos(value, "556:G-S") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-S")  & strpos(value, "233:E-Q") & strpos(value, "90:V-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "655:A-E")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "452:G-C")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "114:P-H")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "659:R-C")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "659:R-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "438:H-N")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "478:P-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "659:R-H")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "67:A-T")   & strpos(value, "406:P-L") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "71:A-V")   & strpos(value, "404:P-L") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "652:F-S")  & strpos(value, "654:Y-N") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "71:A-V")   & strpos(value, "189:D-G") &  strpos(value, "406:P-L") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "456:L-F")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "453:M-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "464:R-C")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "90:V-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "406:P-L")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "464:R-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "464:R-H")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "617:G-D")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "664:G-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Q")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "385:T-N")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "656:T-K")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "651:M-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "404:P-Q")  & strpos(site, "fusa")
(0 real changes made)

. * from the mutations where MIC no described part of the table

. replace count =1 if strpos(value, "376:A-V")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "441:F-Y")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "70:A-V")   & strpos(value, "160:A-V")  & strpos(value, "457:H-Y") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "607:V-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "90:V-A")   & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "387:T-I")  & strpos(value, "449:E-K")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "189:D-V")  & strpos(value, "430:L-S")  &strpos(site, "fusa")
(0 real changes made)

. 
. 
. noi tab value count if site=="fusa" & strpos(value, "-") , m

                      |   count
                value |         . |     Total
----------------------+-----------+----------
            L;461:L-F |         1 |         1 
            X;456:L-X |         2 |         2 
            X;473:C-X |         1 |         1 
----------------------+-----------+----------
                Total |         4 |         4 


. replace value = "P" if count ==1
(0 real changes made)

. noi tab value count if site=="fusa" , m

                      |   count
                value |         . |     Total
----------------------+-----------+----------
       ?NONCONTIGUOUS |         1 |         1 
                    A |     3,945 |     3,945 
         CAC601071CAA |         1 |         1 
         CAC601071TAC |         4 |         4 
         CCA600912CAA |         1 |         1 
         CCA600918CTA |         1 |         1 
                    F |         3 |         3 
                    G |         1 |         1 
         GAA601104GTA |         1 |         1 
         GCA599901ACA |         3 |         3 
         GGT601056AGT |         1 |         1 
         GTA599970ATA |         8 |         8 
                    I |        16 |        16 
                    K |        44 |        44 
                    L |         4 |         4 
            L;461:L-F |         1 |         1 
                    Q |         4 |         4 
                    S |        38 |        38 
         TTA601083AAA |        22 |        22 
         TTA601083TCA |        17 |        17 
         TTA601083TTT |         2 |         2 
                    X |         4 |         4 
            X;456:L-X |         2 |         2 
            X;473:C-X |         1 |         1 
                    Y |        12 |        12 
----------------------+-----------+----------
                Total |     4,137 |     4,137 


. drop count 

. 
. 
. *rpob

. noi di "rpob mutations"
rpob mutations

. 
. gen count =1 if strpos(value, "468:Q-K") & strpos(site, "rpob")
(347,508 missing values generated)

. replace count =1 if strpos(value, "471:D-Y") & strpos(value, "486:S-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "486:S-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "473:A-T") & strpos(value, "477:A-T") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "527:I-M") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "468:Q-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "565:Q-R") & strpos(value, "529:S-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "466:L-S") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-Y") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "529:S-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "527:I-M") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-D") & strpos(value, "468:Q-K") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-D") & strpos(value, "527:I-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-D") & strpos(value, "529:S-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "468:Q-R") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "456:Q-K") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "484:R-H") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-D") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "477:A-D") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "550:D-G") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-D") & strpos(value, "477:A-T") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "470:M-T") & strpos(value, "471:D-G") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "463:S-P") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "471:D-Y") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "464:S-P") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "527:I-F") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "477:A-V") & strpos(site, "rpob")
(0 real changes made)

. 
. * check insertion 

. gen insert =1 if strpos(site, "rpob") & (strpos(value,"475H") | strpos(value, "G475")) 
(347,508 missing values generated)

. summ insert

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      insert |          0

. noi di r(sum) " possible insertions in rpob mutations; check"
0 possible insertions in rpob mutations; check

. noi list site value count if insert==1

. 
. noi tab value count if site=="rpob" & strpos(value, "-") , m
no observations

. noi replace value = "P" if count ==1
(0 real changes made)

. noi tab value count if site=="rpob" , m

                      |   count
                value |         . |     Total
----------------------+-----------+----------
                    A |     4,065 |     4,065 
         CAA592232CGA |         1 |         1 
         CAT592271AAT |        16 |        16 
         CAT592271TAT |         5 |         5 
                    D |         2 |         2 
         GCT592259GAT |         1 |         1 
                    N |        32 |        32 
                    P |         2 |         2 
         TCT592220CCT |         1 |         1 
                    Y |        12 |        12 
----------------------+-----------+----------
                Total |     4,137 |     4,137 


. drop count insert

. 
. 
. 
. 
. *dfrb

. noi di "dfrb mutations"
dfrb mutations

. gen count =1 if  strpos(value, "99:F-Y" ) & strpos(value, "31:H-N" ) & strpos(site, "dfrb")
(347,508 missing values generated)

. replace count =1 if  strpos(value, "99:F-Y") & strpos(value, "150:H-R") & strpos(site, "dfrb")
(0 real changes made)

. replace count =1 if  strpos(value, "99:F-Y") & strpos(value, "21:L-V") & strpos(value, "60:N-I") & strpos(site, "dfrb")
(0 real changes made)

. replace count =1 if  strpos(value, "31:H-N" ) & strpos(site, "dfrb")
(0 real changes made)

. replace count =1 if  strpos(value, "99:F-Y") & strpos(site, "dfrb")
(0 real changes made)

. replace count =1 if  strpos(value, "150:H-R") & strpos(site, "dfrb")
(0 real changes made)

. replace count =1 if  strpos(value, "99:F-S") & strpos(site, "dfrb")
(0 real changes made)

. replace count =1 if  strpos(value, "41:L-F") & strpos(site, "dfrb")
(0 real changes made)

. replace count =1 if  strpos(value, "99:F-I" ) & strpos(site, "dfrb")
(0 real changes made)

. noi tab value count if site=="dfrb" & strpos(value, "-") , m
no observations

. noi replace value = "P" if count ==1
(0 real changes made)

. noi tab value count if site=="dfrb" , m

                      |   count
                value |         . |     Total
----------------------+-----------+----------
                    A |     3,891 |     3,891 
        AAA1497289ATA |        74 |        74 
        ATG1497136ACG |         6 |         6 
                    F |         2 |         2 
                    N |         2 |         2 
                    R |        12 |        12 
        TAA1497463GAA |         1 |         1 
                    X |         1 |         1 
                    Y |       148 |       148 
----------------------+-----------+----------
                Total |     4,137 |     4,137 


. drop count 

. 
. preserve

. 
. *gyra and grla

. noi di "gyra and grla mutations"
gyra and grla mutations

. 
. * gyra and grla need to be done on same site

. keep if inlist(site, "gyra", "grla")
(339,234 observations deleted)

. reshape wide value, i(sample method set type ) j(site) string
(note: j = grla gyra)
variable value2 not constant within sample method set type
    Your data are currently long.  You are performing a reshape wide.  You typed something like

        . reshape wide a b, i(sample method set type) j(site)

    There are variables other than a, b, sample method set type, site in your data.  They must be constant within sample method
    set type because that is the only way they can fit into wide data without loss of information.

    The variable or variables listed above are not constant within sample method set type.  Perhaps the values are in error.
    Type reshape error for a list of the problem observations.

    Either that, or the values vary because they should vary, in which case you must either add the variables to the list of xij
    variables to be reshaped, or drop them.
r(9);

. 
. gen count =1 if strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-V") & strpos(valuegyra, "88:E-K") 
valuegrla not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-G")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "85:S-P") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegyra, "84:S-L")
variable count not found
r(111);

. *replace count =1 if  strpos(valuegyra, "84:S-A") 

. * not included on main table 2

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-L")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "85:S-P") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-G")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "88:E-K") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "85:S-P") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegyra, "84:S-L")  & strpos(valuegyra, "85:S-P") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-G")  & strpos(valuegyra, "84:S-L") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "108:S-N") & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "85:S-P") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-G")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "88:E-L") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "48:A-T")  & strpos(valuegyra, "84:S-L") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "85:S-P") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegyra, "84:S-L")  & strpos(valuegyra, "88:E-K") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-K") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-G")  & strpos(valuegyra, "84:S-L")
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegyra, "84:S-L")
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "84:S-L")
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegyra, "88:E-K")
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L")
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "84:S-L")  & strpos(valuegyra, "88:E-K") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-V")  & strpos(valuegyra, "84:S-L") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "83:Y-N")  & strpos(valuegyra, "84:S-L") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "88:E-G") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegyra, "85:S-P") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "84:S-L")  & strpos(valuegyra, "85:S-P") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "116:A-E") & strpos(valuegyra, "84:S-L") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegyra, "88:E-K") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "88:E-G") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "88:E-K") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "432:D-G") & strpos(valuegyra, "84:S-L") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "79:D-V")  & strpos(valuegrla, "80:S-Y")  & strpos(valuegyra, "84:S-L") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "41:V-G")  & strpos(valuegrla, "45:I-M") & strpos(valuegyr
> a, "84:S-L")
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "84:S-L")  & strpos(valuegyra, "106:G-D")
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegyra, "88:E-G")
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "79:D-V")  & strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "88:E-K") 
variable count not found
r(111);

. replace count =1 if  strpos(valuegrla, "80:S-Y")  
variable count not found
r(111);

. 
. noi bysort count: tab valuegrla valuegyra
variable count not found
r(111);

. 
. noi di _n(5) _dup(80) "=" _n " 4 Match to antibiotic prediction" _n _dup(80) "="





================================================================================
 4 Match to antibiotic prediction
================================================================================

. 
. 
. *clean up non binary values

. use temp4, clear

. reshape long
(note: j = genefinder typewriter zam)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                   115836   ->  347508
Number of variables                   8   ->       7
j variable (3 values)                     ->   method
xij variables:
valuegenefinder valuetypewriter valuezam  ->   value
-----------------------------------------------------------------------------

. 
. 
.  noi di "missing values"
missing values

. replace value = upper(value)
(19,140 real changes made)

. gen ambi = 1 if inlist(value, "ND", "NT", "LOW COV", "MIXED")
(347,507 missing values generated)

. replace ambi=1 if inlist(value, "NOT DONE", "N/A", "NF", "NA", "-", "X")
(1 real change made)

. summ ambi if ambi ==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ambi |          2           1           0          1          1

. noi di r(N) " values have N/A or equivalent values, set these all to A"
2 values have N/A or equivalent values, set these all to A

. noi list site value if ambi==1

        +--------------+
        | site   value |
        |--------------|
131659. | gyra      ND |
328708. |  etd       X |
        +--------------+

. noi replace value = "A" if ambi==1
(2 real changes made)

. tab site if ambi ==1

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
           etd |          1       50.00       50.00
          gyra |          1       50.00      100.00
---------------+-----------------------------------
         Total |          2      100.00

. drop ambi

. 
. noi di "all values equal A or P, unless chromosonal"
all values equal A or P, unless chromosonal

. replace value=upper(value)
(0 real changes made)

. 
. assert inlist(value, "A", "P") if !strpos(type, "Chro")

. 
. ***************

. gen count = 1 if strpos(value, "=>")
(346,741 missing values generated)

. summ count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |        767           1           0          1          1

. noi di r(N) " replace => with - to create uniform recording of mutations"
767 replace => with - to create uniform recording of mutations

. noi replace value = subinstr(value, "=>", "-",.)
(767 real changes made)

. drop count 

. 
. 
. gen count = 1 if strpos(value," ")
(347,504 missing values generated)

. summ count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |          4           1           0          1          1

. noi di r(N) " remove all spaces in value reports"
4 remove all spaces in value reports

. noi replace value = subinstr(value, " ", "",.)
(4 real changes made)

. drop count 

. 
. * fix new mykrobe output to same format as typewriter/genefinder 

. gen start=strpos(value,"_")

. gen end= strpos(value, "-")

. gen value2= value

. replace value2= substr(value,start+2,end-start-3)+":"+substr(value,start+1,1)+"-" +substr(value,end-1,1) ///
invalid syntax
r(198);

. if inlist(site, "fusa", "gyra", "grla", "rpob", "dfrb") & method=="zam" & value!="WT"
{ required
r(100);

. 
. 
. 
. replace value = substr(value, end+1, .)
(2,406 real changes made)

. drop start end

. gen start=strpos(value,"_")

. gen end= strpos(value, "-")

. gen value3= substr(value,start+2,end-start-3)+":"+substr(value,start+1,1)+"-" +substr(value,end-1,1) ///
invalid syntax
r(198);

. if inlist(site, "fusa", "gyra", "grla", "rpob", "dfrb") & method=="zam" & value!="WT" & start!=0
{ required
r(100);

. replace value = substr(value, end+1, .)
(24 real changes made)

. drop start end

. gen start=strpos(value,"_")

. gen end= strpos(value, "-")

. assert start==0

. replace value = value2 + "; " + value3 if value3!=""
value3 not found
r(111);

. replace value = value2 if value2!="" & value3==""
value3 not found
r(111);

. drop value2 value3 start end
variable value3 not found
r(111);

. 
. 
. 
. *swap to binary the point mutations

. * clarify absenses

. gen count = 1  if value=="WT" & strpos(type, "Chromo")
(329,230 missing values generated)

. summ count if count==1 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |     18,278           1           0          1          1

. noi di r(N) "replace WT with A in typewriter/ genewriter/ zam  reports on chromosonal mutations"
18278replace WT with A in typewriter/ genewriter/ zam  reports on chromosonal mutations

. noi replace value = "A" if count==1 
(18,278 real changes made)

. drop count

. 
. * clarify point mutations based on clare's paper *NOTE: need to do as strpos not inlist as there are multiple variations reporte
> d

. noi di "mutations: if count!=1 then no considered positive as not in panal on clare's paper"
mutations: if count!=1 then no considered positive as not in panal on clare's paper

. 
. 
. 
. * fusa

. noi di "fusa mutations"
fusa mutations

. 
. gen count =1 if strpos(value, "434:B-N")  & strpos(site, "fusa")
(347,508 missing values generated)

. replace count =1 if strpos(value, "461:L-K")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-K") & strpos(value, "457:H-Q")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-K") & strpos(value, "473:C-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "67:A-T" ) & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "70:A-V" ) & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "67:R-C" ) & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-K")  & strpos(value, "457:H-Q") & strpos(value, "655:A-V") & strpos(value, "90:V-I") & 
> strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-F")  & strpos(value, "376:A-V") & strpos(value, "655:A-P") & strpos(value, "463:D-G") &
>  strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Q")  & strpos(value, "461:L-F") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "90:V-I")   & strpos(value, "457:H-Q") & strpos(value, "461:L-K") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-S")  & strpos(value, "404:P-L") & strpos(value, "71:A-V")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-S")  & strpos(value, "90:V-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "161:M-I") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "416:S-F") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "373:D-N") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "115:Q-L")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "436:T-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "452:G-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "456:L-F")  & strpos(value, "376:A-V") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-F")  & strpos(value, "444:E-K") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "444:E-K")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "556:G-S" ) & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "659:R-L")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "404:P-L")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "451:G-V")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y")  & strpos(value, "659:R-L") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y")  & strpos(value, "556:G-S") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-S")  & strpos(value, "233:E-Q") & strpos(value, "90:V-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "655:A-E")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "452:G-C")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "114:P-H")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "659:R-C")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "659:R-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "438:H-N")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "478:P-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "659:R-H")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "67:A-T")   & strpos(value, "406:P-L") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "71:A-V")   & strpos(value, "404:P-L") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "652:F-S")  & strpos(value, "654:Y-N") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "71:A-V")   & strpos(value, "189:D-G") &  strpos(value, "406:P-L") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "456:L-F")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "453:M-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "464:R-C")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "90:V-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "406:P-L")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "464:R-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "464:R-H")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "617:G-D")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "664:G-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Q")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "385:T-N")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "656:T-K")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "651:M-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "404:P-Q")  & strpos(site, "fusa")
(0 real changes made)

. * from the mutations where MIC no described part of the table

. replace count =1 if strpos(value, "376:A-V")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "441:F-Y")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "70:A-V")   & strpos(value, "160:A-V")  & strpos(value, "457:H-Y") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "607:V-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "90:V-A")   & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "387:T-I")  & strpos(value, "449:E-K")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "189:D-V")  & strpos(value, "430:L-S")  &strpos(site, "fusa")
(0 real changes made)

. 
. 
. noi tab value count if site=="fusa" & strpos(value, "-") , m

                      |   count
                value |         . |     Total
----------------------+-----------+----------
            L;461:L-F |         1 |         1 
            X;456:L-X |         2 |         2 
            X;473:C-X |         1 |         1 
----------------------+-----------+----------
                Total |         4 |         4 


. replace value = "P" if count ==1
(0 real changes made)

. noi tab value count if site=="fusa" , m
--Break--
r(1);

. drop count 

. 
. 
. *rpob

. noi di "rpob mutations"
rpob mutations

. 
. gen count =1 if strpos(value, "468:Q-K") & strpos(site, "rpob")
--Break--
r(1);

. replace count =1 if strpos(value, "471:D-Y") & strpos(value, "486:S-L") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "486:S-L") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "473:A-T") & strpos(value, "477:A-T") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "527:I-M") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "468:Q-L") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "565:Q-R") & strpos(value, "529:S-L") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "466:L-S") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "481:H-Y") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "529:S-L") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "527:I-M") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "481:H-D") & strpos(value, "468:Q-K") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "481:H-D") & strpos(value, "527:I-L") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "481:H-D") & strpos(value, "529:S-L") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "468:Q-R") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "456:Q-K") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "484:R-H") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "481:H-D") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "477:A-D") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "550:D-G") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "481:H-D") & strpos(value, "477:A-T") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "470:M-T") & strpos(value, "471:D-G") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "463:S-P") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "471:D-Y") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "464:S-P") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "527:I-F") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "481:H-N") & strpos(site, "rpob")
variable count not found
r(111);

. replace count =1 if strpos(value, "477:A-V") & strpos(site, "rpob")
variable count not found
r(111);

. 
. * check insertion 

. gen insert =1 if strpos(site, "rpob") & (strpos(value,"475H") | strpos(value, "G475")) 
--Break--
r(1);

. summ insert
variable insert not found
r(111);

. noi di r(sum) " possible insertions in rpob mutations; check"
. possible insertions in rpob mutations; check

. noi list site value count if insert==1
variable count not found
r(111);

. 
. noi tab value count if site=="rpob" & strpos(value, "-") , m
variable count not found
r(111);

. noi replace value = "P" if count ==1
count not found
r(111);

. noi tab value count if site=="rpob" , m
variable count not found
r(111);

. drop count insert
variable count not found
r(111);

. 
. 
. 
. 
. *dfrb

. noi di "dfrb mutations"
dfrb mutations

. gen count =1 if  strpos(value, "99:F-Y" ) & strpos(value, "31:H-N" ) & strpos(site, "dfrb")
--Break--
r(1);

. replace count =1 if  strpos(value, "99:F-Y") & strpos(value, "150:H-R") & strpos(site, "dfrb")
variable count not found
r(111);

. replace count =1 if  strpos(value, "99:F-Y") & strpos(value, "21:L-V") & strpos(value, "60:N-I") & strpos(site, "dfrb")
variable count not found
r(111);

. replace count =1 if  strpos(value, "31:H-N" ) & strpos(site, "dfrb")
variable count not found
r(111);

. replace count =1 if  strpos(value, "99:F-Y") & strpos(site, "dfrb")
variable count not found
r(111);

. replace count =1 if  strpos(value, "150:H-R") & strpos(site, "dfrb")
variable count not found
r(111);

. replace count =1 if  strpos(value, "99:F-S") & strpos(site, "dfrb")
variable count not found
r(111);

. replace count =1 if  strpos(value, "41:L-F") & strpos(site, "dfrb")
variable count not found
r(111);

. replace count =1 if  strpos(value, "99:F-I" ) & strpos(site, "dfrb")
variable count not found
r(111);

. noi tab value count if site=="dfrb" & strpos(value, "-") , m
variable count not found
r(111);

. noi replace value = "P" if count ==1
count not found
r(111);

. noi tab value count if site=="dfrb" , m
variable count not found
r(111);

. drop count 
variable count not found
r(111);

. 
. preserve
already preserved
r(621);

. restore

. use temp4, clear

. reshape long
(note: j = genefinder typewriter zam)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                   115836   ->  347508
Number of variables                   8   ->       7
j variable (3 values)                     ->   method
xij variables:
valuegenefinder valuetypewriter valuezam  ->   value
-----------------------------------------------------------------------------

. tab marker
no observations

. 
. * how many values are missing

. use temp3, clear

. 
. * create absence markers

. gen  zbyte=( valuezam!="")

. gen  tbyte=( valuetypewriter !="")

. gen  gbyte=( valuegenefinder   !="")

. gen new= string( tbyte ) + string(zbyte) + string(gbyte)

. replace new ="Phenotype" if type=="Phenotype"
(0 real changes made)

. noi di "sample-sites missing values - key (typewriter mykrobe genefinder)"
sample-sites missing values - key (typewriter mykrobe genefinder)

. table new

----------------------
      new |      Freq.
----------+-----------
      000 |        172
      001 |      1,379
      010 |      7,445
      101 |      8,793
      111 |    109,801
----------------------

. 
. 
. *000

. summ zbyte if new=="000"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |        172           0           0          0          0

. noi di r(N) " not called by any method; people missing from T/G and called blank by mycrobe - see 010 bonus people below"
172 not called by any method; people missing from T/G and called blank by mycrobe - see 010 bonus people below

. 
. 
. *010

. summ zbyte if new== "010"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      7,445           1           0          1          1

. noi di r(N) " Called only by mykrobe"
7445 Called only by mykrobe

. * vgaalc

. noi tab site new if inlist(site, "vgaalc"), m

               |    new
          site |       010 |     Total
---------------+-----------+----------
        vgaalc |     1,419 |     1,419 
---------------+-----------+----------
         Total |     1,419 |     1,419 


. summ zbyte if inlist(site, "vgaalc")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      1,419           1           0          1          1

. noi di r(N) " vgaalc only supplied by mykrobe, drop from database"
1419 vgaalc only supplied by mykrobe, drop from database

. noi drop if inlist(site, "vgaalc")
(1,419 observations deleted)

. noi di _N " sample sites remaining" 
126171 sample sites remaining

. * luk

. noi tab site new if strpos(site, "luk"), m

               |          new
          site |       010        111 |     Total
---------------+----------------------+----------
           luk |     1,419          0 |     1,419 
          lukm |        40      1,379 |     1,419 
         lukmf |        40      1,379 |     1,419 
        lukpvf |        40      1,379 |     1,419 
        lukpvs |        40      1,379 |     1,419 
---------------+----------------------+----------
         Total |     1,579      5,516 |     7,095 


. summ zbyte if inlist(site, "luk")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      1,419           1           0          1          1

. noi di r(N) " luk only supplied by mykrobe, drop from database"
1419 luk only supplied by mykrobe, drop from database

. noi drop if inlist(site, "luk")
(1,419 observations deleted)

. noi di _N " sample sites remaining" 
124752 sample sites remaining

. * ar

. noi tab site new if strpos(site, "ar"), m

               |          new
          site |       010        111 |     Total
---------------+----------------------+----------
            ar |     1,419          0 |     1,419 
          arca |        40      1,379 |     1,419 
          arcb |        40      1,379 |     1,419 
          arcc |        40      1,379 |     1,419 
          arcd |        40      1,379 |     1,419 
---------------+----------------------+----------
         Total |     1,579      5,516 |     7,095 


. summ zbyte if inlist(site, "ar")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      1,419           1           0          1          1

. noi di r(N) "ar only supplied by mykrobe, drop from database"
1419ar only supplied by mykrobe, drop from database

. noi drop if inlist(site, "ar")
(1,419 observations deleted)

. noi di _N " sample sites remaining" 
123333 sample sites remaining

. 
. 
. * samples not in other sets

. vallist sample if new=="010", local(list)
C00003123 C00003117 C00011606 C00003214 C00011596 C00011656 C00011655 C00011617 C00011569 C00011654 C00011608 C00003293 C00011653 
> C00011620 C00009009 C00011644 C00011593 C00011595 C00011631 C00011642 C00003342 C00003094 C00011619 C00011594 C00011632 C0001157
> 2 C00003273 C00011630 C00011629 C00011618 C00011605 C00011570 C00011581 C00011643 C00001125 C00011641 C00011607 C00011582 C00011
> 584 C00011571

. noi tab sample new if strpos("`list'", sample)

                     |          new
           Sample_id |       000        010 |     Total
---------------------+----------------------+----------
           C00001125 |         5         79 |        84 
           C00003094 |         5         79 |        84 
           C00003117 |         5         79 |        84 
           C00003123 |         5         79 |        84 
           C00003214 |         4         80 |        84 
           C00003273 |         5         79 |        84 
           C00003293 |         5         79 |        84 
           C00003342 |         5         79 |        84 
           C00009009 |         4         80 |        84 
           C00011569 |         4         80 |        84 
           C00011570 |         3         81 |        84 
           C00011571 |         5         79 |        84 
           C00011572 |         3         81 |        84 
           C00011581 |         5         79 |        84 
           C00011582 |         5         79 |        84 
           C00011584 |         5         79 |        84 
           C00011593 |         5         79 |        84 
           C00011594 |         2         82 |        84 
           C00011595 |         3         81 |        84 
           C00011596 |         3         81 |        84 
           C00011605 |         3         81 |        84 
           C00011606 |         5         79 |        84 
           C00011607 |         3         81 |        84 
           C00011608 |         5         79 |        84 
           C00011617 |         4         80 |        84 
           C00011618 |         5         79 |        84 
           C00011619 |         4         80 |        84 
           C00011620 |         5         79 |        84 
           C00011629 |         4         80 |        84 
           C00011630 |         5         79 |        84 
           C00011631 |         5         79 |        84 
           C00011632 |         5         79 |        84 
           C00011641 |         3         81 |        84 
           C00011642 |         5         79 |        84 
           C00011643 |         3         81 |        84 
           C00011644 |         3         81 |        84 
           C00011653 |         5         79 |        84 
           C00011654 |         5         79 |        84 
           C00011655 |         4         80 |        84 
           C00011656 |         5         79 |        84 
---------------------+----------------------+----------
               Total |       172      3,188 |     3,360 


. bysort sample: gen count =1 if _n==1
(121,914 missing values generated)

. summ zbyte if strpos("`list'", sample) & count==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |         40         .95    .2207214          0          1

. noi di r(N) " samples are only processed by mykrobe - drop from comparision set"
40 samples are only processed by mykrobe - drop from comparision set

. summ zbyte if strpos("`list'", sample) 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      3,360    .9488095    .2204189          0          1

. noi di r(N) " sample sites affected"
3360 sample sites affected

. drop if strpos("`list'", sample)
(3,360 observations deleted)

. drop count 

. 
. *001

. summ gbyte if new =="001"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       gbyte |      1,379           1           0          1          1

. noi di r(N) "Called only by genefinder"
1379Called only by genefinder

. noi di "sites in sample-sites only supplied by genefinder"
sites in sample-sites only supplied by genefinder

. noi tab site if new =="001"

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
allelicprofile |      1,379      100.00      100.00
---------------+-----------------------------------
         Total |      1,379      100.00

. * allelicprofile - drop

. noi tab site new if inlist(site, "allelicprofile"), m

               |    new
          site |       001 |     Total
---------------+-----------+----------
allelicprofile |     1,379 |     1,379 
---------------+-----------+----------
         Total |     1,379 |     1,379 


. summ zbyte if inlist(site, "allelicprofile")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      1,379           0           0          0          0

. noi di r(N) " allelicprofile only supplied by genefinder, drop from database"
1379 allelicprofile only supplied by genefinder, drop from database

. noi drop if inlist(site, "allelicprofile")
(1,379 observations deleted)

. noi di _N " sample sites remaining" 
118594 sample sites remaining

. assert new!="001"

. 
. 
. 
. * 101

. summ zbyte if new =="101"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      8,793           0           0          0          0

. noi di r(N) " no value in mykrobe, eg fusa"
8793 no value in mykrobe, eg fusa

. noi tab site if new=="101"

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
          dfrb |      1,298       14.76       14.76
          fusa |      1,318       14.99       29.75
          grla |        979       11.13       40.88
          gyra |      1,085       12.34       53.22
          iles |      1,379       15.68       68.91
          mlst |      1,379       15.68       84.59
          rpob |      1,355       15.41      100.00
---------------+-----------------------------------
         Total |      8,793      100.00

. noi tab valuezam if site=="fusa"

                              zam value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                 fus_E468V-GAA601104GTA |          1        1.64        1.64
                 fus_G452S-GGT601056AGT |          1        1.64        3.28
                 fus_H457Q-CAC601071CAA |          1        1.64        4.92
                 fus_H457Y-CAC601071TAC |          4        6.56       11.48
fus_H457Y-CAC601071TACfus_A67T-GCA599.. |          2        3.28       14.75
                 fus_L461F-TTA601083TTT |          1        1.64       16.39
                 fus_L461K-TTA601083AAA |         22       36.07       52.46
                 fus_L461S-TTA601083TCA |         17       27.87       80.33
fus_P404L-CCA600912CTAfus_L461F-TTA60.. |          1        1.64       81.97
                 fus_P404Q-CCA600912CAA |          1        1.64       83.61
                 fus_P406L-CCA600918CTA |          1        1.64       85.25
fus_P406L-CCA600918CTAfus_A67T-GCA599.. |          1        1.64       86.89
                  fus_V90I-GTA599970ATA |          8       13.11      100.00
----------------------------------------+-----------------------------------
                                  Total |         61      100.00

. noi tab valuegenefinder valuetypewriter if site=="fusa" & valuezam==""

                      |         typewriter value
     genefinder value | 404:P=>..   656:T=>S         wt |     Total
----------------------+---------------------------------+----------
161:P-X;461:L-X;473.. |         1          0          0 |         1 
              373:D-G |         0          0          1 |         1 
              656:T-S |         0          1          0 |         1 
       71:A-X;160:A-X |         0          0          1 |         1 
71:A-X;373:D-X;456:.. |         0          0          2 |         2 
       71:A-X;456:L-X |         0          0          3 |         3 
                   wt |         0          0      1,309 |     1,309 
----------------------+---------------------------------+----------
                Total |         1          1      1,316 |     1,318 


. noi di " problem is that mykrobe is not reporting absence of mutation as other than blank"
 problem is that mykrobe is not reporting absence of mutation as other than blank

. vallist site if new=="101" & site!="mlst", local(list)
fusa dfrb rpob iles grla gyra

. summ zbyte if strpos("`list'", site) & valuezam==""

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       zbyte |      7,414           0           0          0          0

. noi di "solution: replace " r(N) " blanks in these sites in mykroke with wt -  not mlst which is not a mutation site"
solution: replace 7414 blanks in these sites in mykroke with wt -  not mlst which is not a mutation site

. noi replace valuezam="wt" if  strpos("`list'", site) & valuezam==""
(7,414 real changes made)

. 
. * regen new

. drop new

. drop *byte

. gen  zbyte=( valuezam!="")

. gen  tbyte=( valuetypewriter !="")

. gen  gbyte=( valuegenefinder   !="")

. gen new= string( tbyte ) + string(zbyte) + string(gbyte)

. noi tab new

        new |      Freq.     Percent        Cum.
------------+-----------------------------------
        101 |      1,379        1.16        1.16
        111 |    117,215       98.84      100.00
------------+-----------------------------------
      Total |    118,594      100.00

. * mslt

. noi assert site=="mlst" if new=="101" 

. assert new =="111" if (type!="Phenotype" & site!="mlst")

. noi di "all remaining sample sites are either complete accross all three methods or mlst (mykrobe absent)"
all remaining sample sites are either complete accross all three methods or mlst (mykrobe absent)

. 
. * save mlst results and drop

. preserve

. keep if site =="mlst"
(117,215 observations deleted)

. gen ident =  strpos(valuetypewriter, valuegene) >0

. replace ident = 1 if valueg=="Novel" & valuet=="NF"
(111 real changes made)

. summ ident 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       ident |      1,379    .9934735    .0805517          0          1

. noi di "mlst agreement between typewriter and genefinder in " r(sum) " cases out of " r(N)
mlst agreement between typewriter and genefinder in 1370 cases out of 1379

. noi di "value missing for all mykrobe"
value missing for all mykrobe

. noi di "rest"
rest

. noi tab valueg valuet if ident==0

                      |   typewriter value
     genefinder value |        NF  Saur-ST.. |     Total
----------------------+----------------------+----------
                  182 |         1          0 |         1 
                   22 |         1          0 |         1 
                 2415 |         1          0 |         1 
                 2416 |         1          0 |         1 
                 2889 |         1          0 |         1 
                  425 |         1          0 |         1 
                    7 |         1          0 |         1 
                   80 |         1          0 |         1 
                Novel |         0          1 |         1 
----------------------+----------------------+----------
                Total |         8          1 |         9 


. keep sample valueg valuet ident

. save mlst, replace
file mlst.dta saved

. restore

. gen marker =1 if site=="mlst"
(117,215 missing values generated)

. summ marker

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      marker |      1,379           1           0          1          1

. noi di "dropping " r(sum) " mlst sites"
dropping 1379 mlst sites

. noi drop if marker==1
(1,379 observations deleted)

. drop marker

. 
. * IleS unsuitable for resistance reporting - drop this 

. gen marker =1 if site=="iles"
(115,836 missing values generated)

. summ marker

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      marker |      1,379           1           0          1          1

. noi di r(sum) " iles site reports dropped due to not being in Claire's gene panel on paper"
1379 iles site reports dropped due to not being in Claire's gene panel on paper

. drop if marker==1
(1,379 observations deleted)

. drop marker

. 
. * count how many sample sites left

. 
. noi display _N " sample sites"
115836 sample sites

. bysort sample: gen count1=1 if _n==1
(114,457 missing values generated)

. summ count1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count1 |      1,379           1           0          1          1

. noi di r(sum) " samples"
1379 samples

. bysort site: gen count2=1 if _n==1
(115,752 missing values generated)

. summ count2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count2 |         84           1           0          1          1

. noi di r(sum) " sites"
84 sites

. noi tab site type if count2==1 

               |                    type
          site | Aquired..  Chromos..        ccr  virulence |     Total
---------------+--------------------------------------------+----------
      aac6aph2 |         1          0          0          0 |         1 
    aaddaph4ia |         1          0          0          0 |         1 
    aadeant6ia |         1          0          0          0 |         1 
        ant9ia |         1          0          0          0 |         1 
        ant9ib |         1          0          0          0 |         1 
        aph2ic |         1          0          0          0 |         1 
  apha3aph3iii |         1          0          0          0 |         1 
          arca |         0          0          0          1 |         1 
          arcb |         0          0          0          1 |         1 
          arcc |         0          0          0          1 |         1 
          arcd |         0          0          0          1 |         1 
          blaz |         1          0          0          0 |         1 
           cat |         1          0          0          0 |         1 
          ccra |         0          0          1          0 |         1 
          ccrb |         0          0          1          0 |         1 
         ccrca |         0          0          1          0 |         1 
         ccrcb |         0          0          1          0 |         1 
         ccrcc |         0          0          1          0 |         1 
           cfr |         1          0          0          0 |         1 
           chp |         0          0          0          1 |         1 
          dfra |         1          0          0          0 |         1 
          dfrb |         0          1          0          0 |         1 
          dfrc |         1          0          0          0 |         1 
          dfrd |         1          0          0          0 |         1 
          dfrg |         1          0          0          0 |         1 
          dfrk |         1          0          0          0 |         1 
          erma |         1          0          0          0 |         1 
          ermb |         1          0          0          0 |         1 
          ermc |         1          0          0          0 |         1 
          ermt |         1          0          0          0 |         1 
          ermy |         1          0          0          0 |         1 
           eta |         0          0          0          1 |         1 
           etb |         0          0          0          1 |         1 
           etd |         0          0          0          1 |         1 
          fusa |         0          1          0          0 |         1 
          fusb |         1          0          0          0 |         1 
          fusc |         1          0          0          0 |         1 
          grla |         0          1          0          0 |         1 
          gyra |         0          1          0          0 |         1 
          isab |         1          0          0          0 |         1 
          lnua |         1          0          0          0 |         1 
          lnub |         1          0          0          0 |         1 
          lukm |         0          0          0          1 |         1 
         lukmf |         0          0          0          1 |         1 
        lukpvf |         0          0          0          1 |         1 
        lukpvs |         0          0          0          1 |         1 
          meca |         1          0          0          0 |         1 
          mecc |         1          0          0          0 |         1 
          mphc |         1          0          0          0 |         1 
          msra |         1          0          0          0 |         1 
          mupa |         1          0          0          0 |         1 
          mupb |         1          0          0          0 |         1 
          qaca |         1          0          0          0 |         1 
          qacb |         1          0          0          0 |         1 
       qaccsmr |         1          0          0          0 |         1 
          rpob |         0          1          0          0 |         1 
           sak |         0          0          0          1 |         1 
          sasx |         0          0          0          1 |         1 
          sat4 |         1          0          0          0 |         1 
           scn |         0          0          0          1 |         1 
           sea |         0          0          0          1 |         1 
           seb |         0          0          0          1 |         1 
           sec |         0          0          0          1 |         1 
           sed |         0          0          0          1 |         1 
           see |         0          0          0          1 |         1 
           seg |         0          0          0          1 |         1 
           seh |         0          0          0          1 |         1 
           sei |         0          0          0          1 |         1 
           sej |         0          0          0          1 |         1 
          selr |         0          0          0          1 |         1 
           sep |         0          0          0          1 |         1 
           seu |         0          0          0          1 |         1 
           str |         1          0          0          0 |         1 
          tetk |         1          0          0          0 |         1 
          tetl |         1          0          0          0 |         1 
          tetm |         1          0          0          0 |         1 
          teto |         1          0          0          0 |         1 
         tsst1 |         0          0          0          1 |         1 
          vana |         1          0          0          0 |         1 
          vanb |         1          0          0          0 |         1 
          vanc |         1          0          0          0 |         1 
          vgaa |         1          0          0          0 |         1 
          vgab |         1          0          0          0 |         1 
          vgba |         1          0          0          0 |         1 
---------------+--------------------------------------------+----------
         Total |        46          5          5         28 |        84 


. bysort site: gen count3=1 if _n==1 & site!="mlst" & type!="Phenotype"
(115,752 missing values generated)

. summ count3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count3 |         84           1           0          1          1

. noi di r(sum) " sites not including Phenotype results and mlst"
84 sites not including Phenotype results and mlst

. drop count* new *byte

. 
. 
.  
. save temp4, replace
file temp4.dta saved

. 
. *clean up non binary values

. use temp4, clear

. reshape long
(note: j = genefinder typewriter zam)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                   115836   ->  347508
Number of variables                   7   ->       6
j variable (3 values)                     ->   method
xij variables:
valuegenefinder valuetypewriter valuezam  ->   value
-----------------------------------------------------------------------------

. 
.  noi di "missing values"
missing values

. replace value = upper(value)
(19,140 real changes made)

. gen ambi = 1 if inlist(value, "ND", "NT", "LOW COV", "MIXED")
(347,507 missing values generated)

. replace ambi=1 if inlist(value, "NOT DONE", "N/A", "NF", "NA", "-", "X")
(1 real change made)

. summ ambi if ambi ==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ambi |          2           1           0          1          1

. noi di r(N) " values have N/A or equivalent values, set these all to A"
2 values have N/A or equivalent values, set these all to A

. noi list site value if ambi==1

        +--------------+
        | site   value |
        |--------------|
131659. | gyra      ND |
328708. |  etd       X |
        +--------------+

. noi replace value = "A" if ambi==1
(2 real changes made)

. tab site if ambi ==1

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
           etd |          1       50.00       50.00
          gyra |          1       50.00      100.00
---------------+-----------------------------------
         Total |          2      100.00

. drop ambi

. 
. noi di "all values equal A or P, unless chromosonal"
all values equal A or P, unless chromosonal

. replace value=upper(value)
(0 real changes made)

. 
. assert inlist(value, "A", "P") if !strpos(type, "Chro")

. tab value

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                150:H-R |          6        0.00        0.00
                               150:H=>R |          6        0.00        0.00
                161:P-X;461:L-X;473:C-X |          1        0.00        0.00
                          21:L-V;99:F-Y |          1        0.00        0.00
                                 31:H-N |          1        0.00        0.00
                                31:H=>N |          1        0.00        0.00
                             326:T=>I   |          2        0.00        0.01
                                373:D-G |          1        0.00        0.01
                376:A-T;404:P-L;461:L-F |          1        0.00        0.01
                                404:P-Q |          1        0.00        0.01
     404:P=>? , 406:P=>? NON CONTIGUOUS |          1        0.00        0.01
                     404:P=>L, 461:L=>F |          1        0.00        0.01
                               404:P=>Q |          1        0.00        0.01
                                406:P-L |          1        0.00        0.01
                               406:P=>L |          2        0.00        0.01
                                 41:L-F |          1        0.00        0.01
                                41:L=>F |          1        0.00        0.01
                                452:G-S |          1        0.00        0.01
                               452:G=>S |          1        0.00        0.01
                                457:H-Q |          1        0.00        0.01
                                457:H-Y |          4        0.00        0.01
                               457:H=>Q |          1        0.00        0.01
                               457:H=>Y |          6        0.00        0.01
                                461:L-F |          1        0.00        0.01
                                461:L-K |         22        0.01        0.02
                                461:L-S |         17        0.00        0.02
                               461:L=>F |          1        0.00        0.02
                               461:L=>K |         22        0.01        0.03
                               461:L=>S |         17        0.00        0.04
                                464:S-P |          1        0.00        0.04
                               464:S=>P |          1        0.00        0.04
                                477:A-D |          1        0.00        0.04
                               477:A=>D |          1        0.00        0.04
                                481:H-N |         16        0.00        0.04
                                481:H-Y |          6        0.00        0.04
                               481:H=>N |         16        0.00        0.05
                               481:H=>Y |          6        0.00        0.05
                                656:T-S |          1        0.00        0.05
                               656:T=>S |          1        0.00        0.05
                         67:A-T;406:P-L |          1        0.00        0.05
                         67:A-T;457:H-Y |          2        0.00        0.05
                         71:A-X;160:A-X |          1        0.00        0.05
                 71:A-X;373:D-X;456:L-X |          2        0.00        0.05
                         71:A-X;456:L-X |          3        0.00        0.05
                                 80:S-F |        299        0.09        0.14
                          80:S-F;84:E-K |          3        0.00        0.14
                                 80:S-Y |          4        0.00        0.14
                                80:S=>F |        302        0.09        0.23
                                80:S=>Y |          4        0.00        0.23
                                 84:E-G |          1        0.00        0.23
                                 84:S-A |          1        0.00        0.23
                                 84:S-L |        291        0.08        0.31
                                 84:S-V |          1        0.00        0.31
                                 84:S-X |          2        0.00        0.31
                          84:S-X;88:E-X |          1        0.00        0.31
                                84:S=>A |          1        0.00        0.31
                                84:S=>L |        292        0.08        0.40
                                 90:V-I |          8        0.00        0.40
                                90:V=>I |          6        0.00        0.40
                                 99:F-X |          1        0.00        0.40
                                 99:F-Y |         73        0.02        0.42
                                99:F=>Y |         74        0.02        0.44
                                      A |    294,025       84.61       85.05
                DFRB_F99Y-AAA1497289ATA |         73        0.02       85.08
               DFRB_H150R-ATG1497136ACG |          6        0.00       85.08
DFRB_L21V-TAA1497523TACDFRB_F99Y-AAA1.. |          1        0.00       85.08
                DFRB_L41F-TAA1497463GAA |          1        0.00       85.08
                 FUS_E468V-GAA601104GTA |          1        0.00       85.08
                 FUS_G452S-GGT601056AGT |          1        0.00       85.08
                 FUS_H457Q-CAC601071CAA |          1        0.00       85.08
                 FUS_H457Y-CAC601071TAC |          4        0.00       85.08
FUS_H457Y-CAC601071TACFUS_A67T-GCA599.. |          2        0.00       85.08
                 FUS_L461F-TTA601083TTT |          1        0.00       85.08
                 FUS_L461K-TTA601083AAA |         22        0.01       85.09
                 FUS_L461S-TTA601083TCA |         17        0.00       85.09
FUS_P404L-CCA600912CTAFUS_L461F-TTA60.. |          1        0.00       85.09
                 FUS_P404Q-CCA600912CAA |          1        0.00       85.09
                 FUS_P406L-CCA600918CTA |          1        0.00       85.09
FUS_P406L-CCA600918CTAFUS_A67T-GCA599.. |          1        0.00       85.09
                  FUS_V90I-GTA599970ATA |          8        0.00       85.10
                GRLA_I45M-ATT1419892ATG |        100        0.03       85.12
GRLA_I45M-ATT1419892ATGGRLA_E84G-GAA1.. |          1        0.00       85.12
                GRLA_S80F-TCC1419997TTC |        295        0.08       85.21
                GRLA_S80Y-TCC1419997TAC |          4        0.00       85.21
                   GYRA_S84A-TCA7254GCA |          1        0.00       85.21
                   GYRA_S84L-TCA7254TTA |        293        0.08       85.30
                                      P |     32,799        9.44       94.73
                RPOB_A477D-GCT592259GAT |          1        0.00       94.73
                RPOB_H481N-CAT592271AAT |         16        0.00       94.74
                RPOB_H481Y-CAT592271TAT |          5        0.00       94.74
                RPOB_Q468R-CAA592232CGA |          1        0.00       94.74
                RPOB_S464P-TCT592220CCT |          1        0.00       94.74
                                     WT |     18,278        5.26      100.00
----------------------------------------+-----------------------------------
                                  Total |    347,508      100.00

. tab site

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
      aac6aph2 |      4,137        1.19        1.19
    aaddaph4ia |      4,137        1.19        2.38
    aadeant6ia |      4,137        1.19        3.57
        ant9ia |      4,137        1.19        4.76
        ant9ib |      4,137        1.19        5.95
        aph2ic |      4,137        1.19        7.14
  apha3aph3iii |      4,137        1.19        8.33
          arca |      4,137        1.19        9.52
          arcb |      4,137        1.19       10.71
          arcc |      4,137        1.19       11.90
          arcd |      4,137        1.19       13.10
          blaz |      4,137        1.19       14.29
           cat |      4,137        1.19       15.48
          ccra |      4,137        1.19       16.67
          ccrb |      4,137        1.19       17.86
         ccrca |      4,137        1.19       19.05
         ccrcb |      4,137        1.19       20.24
         ccrcc |      4,137        1.19       21.43
           cfr |      4,137        1.19       22.62
           chp |      4,137        1.19       23.81
          dfra |      4,137        1.19       25.00
          dfrb |      4,137        1.19       26.19
          dfrc |      4,137        1.19       27.38
          dfrd |      4,137        1.19       28.57
          dfrg |      4,137        1.19       29.76
          dfrk |      4,137        1.19       30.95
          erma |      4,137        1.19       32.14
          ermb |      4,137        1.19       33.33
          ermc |      4,137        1.19       34.52
          ermt |      4,137        1.19       35.71
          ermy |      4,137        1.19       36.90
           eta |      4,137        1.19       38.10
           etb |      4,137        1.19       39.29
           etd |      4,137        1.19       40.48
          fusa |      4,137        1.19       41.67
          fusb |      4,137        1.19       42.86
          fusc |      4,137        1.19       44.05
          grla |      4,137        1.19       45.24
          gyra |      4,137        1.19       46.43
          isab |      4,137        1.19       47.62
          lnua |      4,137        1.19       48.81
          lnub |      4,137        1.19       50.00
          lukm |      4,137        1.19       51.19
         lukmf |      4,137        1.19       52.38
        lukpvf |      4,137        1.19       53.57
        lukpvs |      4,137        1.19       54.76
          meca |      4,137        1.19       55.95
          mecc |      4,137        1.19       57.14
          mphc |      4,137        1.19       58.33
          msra |      4,137        1.19       59.52
          mupa |      4,137        1.19       60.71
          mupb |      4,137        1.19       61.90
          qaca |      4,137        1.19       63.10
          qacb |      4,137        1.19       64.29
       qaccsmr |      4,137        1.19       65.48
          rpob |      4,137        1.19       66.67
           sak |      4,137        1.19       67.86
          sasx |      4,137        1.19       69.05
          sat4 |      4,137        1.19       70.24
           scn |      4,137        1.19       71.43
           sea |      4,137        1.19       72.62
           seb |      4,137        1.19       73.81
           sec |      4,137        1.19       75.00
           sed |      4,137        1.19       76.19
           see |      4,137        1.19       77.38
           seg |      4,137        1.19       78.57
           seh |      4,137        1.19       79.76
           sei |      4,137        1.19       80.95
           sej |      4,137        1.19       82.14
          selr |      4,137        1.19       83.33
           sep |      4,137        1.19       84.52
           seu |      4,137        1.19       85.71
           str |      4,137        1.19       86.90
          tetk |      4,137        1.19       88.10
          tetl |      4,137        1.19       89.29
          tetm |      4,137        1.19       90.48
          teto |      4,137        1.19       91.67
         tsst1 |      4,137        1.19       92.86
          vana |      4,137        1.19       94.05
          vanb |      4,137        1.19       95.24
          vanc |      4,137        1.19       96.43
          vgaa |      4,137        1.19       97.62
          vgab |      4,137        1.19       98.81
          vgba |      4,137        1.19      100.00
---------------+-----------------------------------
         Total |    347,508      100.00

. 
. ***************

. gen count = 1 if strpos(value, "=>")
(346,741 missing values generated)

. summ count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |        767           1           0          1          1

. noi di r(N) " replace => with - to create uniform recording of mutations"
767 replace => with - to create uniform recording of mutations

. noi replace value = subinstr(value, "=>", "-",.)
(767 real changes made)

. drop count 

. 
. 
. gen count = 1 if strpos(value," ")
(347,504 missing values generated)

. summ count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |          4           1           0          1          1

. noi di r(N) " remove all spaces in value reports"
4 remove all spaces in value reports

. noi replace value = subinstr(value, " ", "",.)
(4 real changes made)

. drop count 

. 
. * fix new mykrobe output to same format as typewriter/genefinder 

. gen start=strpos(value,"_")

. gen end= strpos(value, "-")

. gen value2= value

. replace value2= substr(value,start+2,end-start-3)+":"+substr(value,start+1,1)+"-" +substr(value,end-1,1) ///
invalid syntax
r(198);

. if inlist(site, "fusa", "gyra", "grla", "rpob", "dfrb") & method=="zam" & value!="WT"
{ required
r(100);

. replace value2= substr(value,start+2,end-start-3)+":"+substr(value,start+1,1)+"-" +substr(value,end-1,1) if inlist(site, "fusa",
>  "gyra", "grla", "rpob", "dfrb") & method=="zam" & value!="WT"
(860 real changes made)

. replace value = substr(value, end+1, .)
(2,406 real changes made)

. drop start end

. gen start=strpos(value,"_")

. gen end= strpos(value, "-")

. gen value3= substr(value,start+2,end-start-3)+":"+substr(value,start+1,1)+"-" +substr(value,end-1,1) if inlist(site, "fusa", "gy
> ra", "grla", "rpob", "dfrb") & method=="zam" & value!="WT" & start!=0
(347,502 missing values generated)

. replace value = substr(value, end+1, .)
(24 real changes made)

. drop start end

. gen start=strpos(value,"_")

. gen end= strpos(value, "-")

. assert start==0

. replace value = value2 + "; " + value3 if value3!=""
(6 real changes made)

. replace value = value2 if value2!="" & value3==""
(2,400 real changes made)

. drop value2 value3 start end

. 
. *swap to binary the point mutations

. * clarify absenses

. gen count = 1  if value=="WT" & strpos(type, "Chromo")
(329,230 missing values generated)

. summ count if count==1 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |     18,278           1           0          1          1

. noi di r(N) "replace WT with A in typewriter/ genewriter/ zam  reports on chromosonal mutations"
18278replace WT with A in typewriter/ genewriter/ zam  reports on chromosonal mutations

. noi replace value = "A" if count==1 
(18,278 real changes made)

. drop count

. 
. * clarify point mutations based on clare's paper *NOTE: need to do as strpos not inlist as there are multiple variations reporte
> d

. noi di "mutations: if count!=1 then no considered positive as not in panal on clare's paper"
mutations: if count!=1 then no considered positive as not in panal on clare's paper

. 
. * fusa

. noi di "fusa mutations"
fusa mutations

. 
. gen count =1 if strpos(value, "434:B-N")  & strpos(site, "fusa")
(347,508 missing values generated)

. replace count =1 if strpos(value, "461:L-K")  & strpos(site, "fusa")
(66 real changes made)

. replace count =1 if strpos(value, "461:L-K") & strpos(value, "457:H-Q")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-K") & strpos(value, "473:C-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "67:A-T" ) & strpos(site, "fusa")
(4 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "70:A-V" ) & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "67:R-C" ) & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-K")  & strpos(value, "457:H-Q") & strpos(value, "655:A-V") & strpos(value, "90:V-I") & 
> strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-F")  & strpos(value, "376:A-V") & strpos(value, "655:A-P") & strpos(value, "463:D-G") &
>  strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Q")  & strpos(value, "461:L-F") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "90:V-I")   & strpos(value, "457:H-Q") & strpos(value, "461:L-K") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(site, "fusa")
(14 real changes made)

. replace count =1 if strpos(value, "461:L-S")  & strpos(value, "404:P-L") & strpos(value, "71:A-V")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-S")  & strpos(value, "90:V-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "161:M-I") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "416:S-F") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "373:D-N") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "115:Q-L")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "436:T-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "452:G-S")  & strpos(site, "fusa")
(3 real changes made)

. replace count =1 if strpos(value, "456:L-F")  & strpos(value, "376:A-V") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-F")  & strpos(value, "444:E-K") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "444:E-K")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "556:G-S" ) & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "659:R-L")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "404:P-L")  & strpos(site, "fusa")
(3 real changes made)

. replace count =1 if strpos(value, "451:G-V")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y")  & strpos(value, "659:R-L") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y")  & strpos(value, "556:G-S") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-S")  & strpos(value, "233:E-Q") & strpos(value, "90:V-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "655:A-E")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "452:G-C")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "114:P-H")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "659:R-C")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "659:R-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "438:H-N")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "478:P-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "659:R-H")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "67:A-T")   & strpos(value, "406:P-L") & strpos(site, "fusa")
(2 real changes made)

. replace count =1 if strpos(value, "71:A-V")   & strpos(value, "404:P-L") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "652:F-S")  & strpos(value, "654:Y-N") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "71:A-V")   & strpos(value, "189:D-G") &  strpos(value, "406:P-L") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "456:L-F")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "453:M-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-S")  & strpos(site, "fusa")
(51 real changes made)

. replace count =1 if strpos(value, "464:R-C")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "90:V-I")  & strpos(site, "fusa")
(22 real changes made)

. replace count =1 if strpos(value, "406:P-L")  & strpos(site, "fusa")
(4 real changes made)

. replace count =1 if strpos(value, "464:R-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "464:R-H")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "617:G-D")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "664:G-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Q")  & strpos(site, "fusa")
(3 real changes made)

. replace count =1 if strpos(value, "385:T-N")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "656:T-K")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "651:M-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "404:P-Q")  & strpos(site, "fusa")
(3 real changes made)

. * from the mutations where MIC no described part of the table

. replace count =1 if strpos(value, "376:A-V")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "441:F-Y")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "70:A-V")   & strpos(value, "160:A-V")  & strpos(value, "457:H-Y") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "607:V-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "90:V-A")   & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "387:T-I")  & strpos(value, "449:E-K")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "189:D-V")  & strpos(value, "430:L-S")  &strpos(site, "fusa")
(0 real changes made)

. 
. 
. noi tab value count if site=="fusa" & strpos(value, "-") , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
161:P-X;461:L-X;473.. |         0          1 |         1 
              326:T-I |         0          2 |         2 
              373:D-G |         0          1 |         1 
376:A-T;404:P-L;461.. |         1          0 |         1 
404:P-?,406:P-?NONC.. |         0          1 |         1 
      404:P-L,461:L-F |         1          0 |         1 
     404:P-L; 461:L-F |         1          0 |         1 
              404:P-Q |         3          0 |         3 
              406:P-L |         4          0 |         4 
      406:P-L; 67:A-T |         1          0 |         1 
              452:G-S |         3          0 |         3 
              457:H-Q |         3          0 |         3 
              457:H-Y |        14          0 |        14 
      457:H-Y; 67:A-T |         2          0 |         2 
              461:L-F |         0          3 |         3 
              461:L-K |        66          0 |        66 
              461:L-S |        51          0 |        51 
              468:E-V |         0          1 |         1 
              656:T-S |         0          2 |         2 
       67:A-T;406:P-L |         1          0 |         1 
       67:A-T;457:H-Y |         2          0 |         2 
       71:A-X;160:A-X |         0          1 |         1 
71:A-X;373:D-X;456:.. |         0          2 |         2 
       71:A-X;456:L-X |         0          3 |         3 
               90:V-I |        22          0 |        22 
----------------------+----------------------+----------
                Total |       175         17 |       192 


. replace value = "P" if count ==1
(175 real changes made)

. noi tab value count if site=="fusa" , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
161:P-X;461:L-X;473.. |         0          1 |         1 
              326:T-I |         0          2 |         2 
              373:D-G |         0          1 |         1 
404:P-?,406:P-?NONC.. |         0          1 |         1 
              461:L-F |         0          3 |         3 
              468:E-V |         0          1 |         1 
              656:T-S |         0          2 |         2 
       71:A-X;160:A-X |         0          1 |         1 
71:A-X;373:D-X;456:.. |         0          2 |         2 
       71:A-X;456:L-X |         0          3 |         3 
                    A |         0      3,945 |     3,945 
                    P |       175          0 |       175 
----------------------+----------------------+----------
                Total |       175      3,962 |     4,137 


. drop count 

. 
. 
. *rpob

. noi di "rpob mutations"
rpob mutations

. 
. gen count =1 if strpos(value, "468:Q-K") & strpos(site, "rpob")
(347,508 missing values generated)

. replace count =1 if strpos(value, "471:D-Y") & strpos(value, "486:S-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "486:S-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "473:A-T") & strpos(value, "477:A-T") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "527:I-M") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "468:Q-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "565:Q-R") & strpos(value, "529:S-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "466:L-S") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-Y") & strpos(site, "rpob")
(17 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "529:S-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "527:I-M") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-D") & strpos(value, "468:Q-K") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-D") & strpos(value, "527:I-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-D") & strpos(value, "529:S-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "468:Q-R") & strpos(site, "rpob")
(1 real change made)

. replace count =1 if strpos(value, "456:Q-K") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "484:R-H") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-D") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "477:A-D") & strpos(site, "rpob")
(3 real changes made)

. replace count =1 if strpos(value, "550:D-G") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-D") & strpos(value, "477:A-T") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "470:M-T") & strpos(value, "471:D-G") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "463:S-P") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "471:D-Y") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "464:S-P") & strpos(site, "rpob")
(3 real changes made)

. replace count =1 if strpos(value, "527:I-F") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(site, "rpob")
(48 real changes made)

. replace count =1 if strpos(value, "477:A-V") & strpos(site, "rpob")
(0 real changes made)

. 
. * check insertion 

. gen insert =1 if strpos(site, "rpob") & (strpos(value,"475H") | strpos(value, "G475")) 
(347,508 missing values generated)

. summ insert

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      insert |          0

. noi di r(sum) " possible insertions in rpob mutations; check"
0 possible insertions in rpob mutations; check

. noi list site value count if insert==1

. 
. noi tab value count if site=="rpob" & strpos(value, "-") , m

                      |   count
                value |         1 |     Total
----------------------+-----------+----------
              464:S-P |         3 |         3 
              468:Q-R |         1 |         1 
              477:A-D |         3 |         3 
              481:H-N |        48 |        48 
              481:H-Y |        17 |        17 
----------------------+-----------+----------
                Total |        72 |        72 


. noi replace value = "P" if count ==1
(72 real changes made)

. noi tab value count if site=="rpob" , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
                    A |         0      4,065 |     4,065 
                    P |        72          0 |        72 
----------------------+----------------------+----------
                Total |        72      4,065 |     4,137 


. drop count insert

. 
. 
. 
. *dfrb

. noi di "dfrb mutations"
dfrb mutations

. gen count =1 if  strpos(value, "99:F-Y" ) & strpos(value, "31:H-N" ) & strpos(site, "dfrb")
(347,508 missing values generated)

. replace count =1 if  strpos(value, "99:F-Y") & strpos(value, "150:H-R") & strpos(site, "dfrb")
(0 real changes made)

. replace count =1 if  strpos(value, "99:F-Y") & strpos(value, "21:L-V") & strpos(value, "60:N-I") & strpos(site, "dfrb")
(0 real changes made)

. replace count =1 if  strpos(value, "31:H-N" ) & strpos(site, "dfrb")
(2 real changes made)

. replace count =1 if  strpos(value, "99:F-Y") & strpos(site, "dfrb")
(222 real changes made)

. replace count =1 if  strpos(value, "150:H-R") & strpos(site, "dfrb")
(18 real changes made)

. replace count =1 if  strpos(value, "99:F-S") & strpos(site, "dfrb")
(0 real changes made)

. replace count =1 if  strpos(value, "41:L-F") & strpos(site, "dfrb")
(3 real changes made)

. replace count =1 if  strpos(value, "99:F-I" ) & strpos(site, "dfrb")
(0 real changes made)

. noi tab value count if site=="dfrb" & strpos(value, "-") , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
              150:H-R |        18          0 |        18 
       21:L-V; 99:F-Y |         1          0 |         1 
        21:L-V;99:F-Y |         1          0 |         1 
               31:H-N |         2          0 |         2 
               41:L-F |         3          0 |         3 
               99:F-X |         0          1 |         1 
               99:F-Y |       220          0 |       220 
----------------------+----------------------+----------
                Total |       245          1 |       246 


. noi replace value = "P" if count ==1
(245 real changes made)

. noi tab value count if site=="dfrb" , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
               99:F-X |         0          1 |         1 
                    A |         0      3,891 |     3,891 
                    P |       245          0 |       245 
----------------------+----------------------+----------
                Total |       245      3,892 |     4,137 


. drop count 

. 
. preserve

. 
. *gyra and grla

. noi di "gyra and grla mutations"
gyra and grla mutations

. 
. * gyra and grla need to be done on same site

. keep if inlist(site, "gyra", "grla")
(339,234 observations deleted)

. reshape wide value, i(sample method set type ) j(site) string
(note: j = grla gyra)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     8274   ->    4137
Number of variables                   6   ->       6
j variable (2 values)              site   ->   (dropped)
xij variables:
                                  value   ->   valuegrla valuegyra
-----------------------------------------------------------------------------

. 
. gen count =1 if strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-V") & strpos(valuegyra, "88:E-K") 
(4,137 missing values generated)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-G")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "85:S-P") 
(0 real changes made)

. replace count =1 if  strpos(valuegyra, "84:S-L")
(876 real changes made)

. *replace count =1 if  strpos(valuegyra, "84:S-A") 

. * not included on main table 2

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-L")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "85:S-P") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-G")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "88:E-K") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "85:S-P") 
(0 real changes made)

. replace count =1 if  strpos(valuegyra, "84:S-L")  & strpos(valuegyra, "85:S-P") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-G")  & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "108:S-N") & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "85:S-P") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-G")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "88:E-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "48:A-T")  & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "85:S-P") 
(0 real changes made)

. replace count =1 if  strpos(valuegyra, "84:S-L")  & strpos(valuegyra, "88:E-K") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-K") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-G")  & strpos(valuegyra, "84:S-L")
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegyra, "84:S-L")
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "84:S-L")
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegyra, "88:E-K")
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L")
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  
(38 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "84:S-L")  & strpos(valuegyra, "88:E-K") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-V")  & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "83:Y-N")  & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "88:E-G") 
(0 real changes made)

. replace count =1 if  strpos(valuegyra, "85:S-P") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "84:S-L")  & strpos(valuegyra, "85:S-P") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "116:A-E") & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegyra, "88:E-K") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "88:E-G") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "88:E-K") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "432:D-G") & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "79:D-V")  & strpos(valuegrla, "80:S-Y")  & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "41:V-G")  & strpos(valuegrla, "45:I-M") & strpos(valuegyr
> a, "84:S-L")
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "84:S-L")  & strpos(valuegyra, "106:G-D")
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegyra, "88:E-G")
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "79:D-V")  & strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "88:E-K") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  
(3 real changes made)

. 
. noi bysort count: tab valuegrla valuegyra

----------------------------------------------------------------------------------------------------------------------------------
-> count = 1

                      |                       gyra value
           grla value |    84:S-A     84:S-L     84:S-V     84:S-X          A |     Total
----------------------+-------------------------------------------------------+----------
               45:I-M |         0          1          0          0          0 |         1 
               80:S-F |         3        858          1          1         33 |       896 
        80:S-F;84:E-K |         0          3          0          0          0 |         3 
               80:S-Y |         0          9          0          0          3 |        12 
                    A |         0          5          0          0          0 |         5 
----------------------+-------------------------------------------------------+----------
                Total |         3        876          1          1         36 |       917 


----------------------------------------------------------------------------------------------------------------------------------
-> count = .

                      |            gyra value
           grla value |    84:S-X  84:S-X;..          A |     Total
----------------------+---------------------------------+----------
               45:I-M |         0          0         99 |        99 
       45:I-M; 84:E-G |         0          0          1 |         1 
               84:E-G |         0          0          1 |         1 
                    A |         1          1      3,117 |     3,119 
----------------------+---------------------------------+----------
                Total |         1          1      3,218 |     3,220 



. 
. gen value ="P" if count==1
(3,220 missing values generated)

. replace value= "A" if count==. 
(3,220 real changes made)

. replace value = "grla: " + valuegrla + " gyra: " +valuegyra if (valuegrla!="A" | valuegyra!="A") & count==. 
variable value was str1 now str28
(103 real changes made)

. drop count

. noi tab value, m

                       value |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                           A |      3,117       75.34       75.34
                           P |        917       22.17       97.51
        grla: 45:I-M gyra: A |         99        2.39       99.90
grla: 45:I-M; 84:E-G gyra: A |          1        0.02       99.93
        grla: 84:E-G gyra: A |          1        0.02       99.95
        grla: A gyra: 84:S-X |          1        0.02       99.98
 grla: A gyra: 84:S-X;88:E-X |          1        0.02      100.00
-----------------------------+-----------------------------------
                       Total |      4,137      100.00

. 
. gen site = "grla/gyra"

. drop valueg*

. assert _N==4137

. save grla_results, replace
file grla_results.dta saved

. 
. restore

. 
. drop if inlist(site, "grla", "gyra")
(8,274 observations deleted)

. assert _N==343371
assertion is false
r(9);

. append using grla_results

. restore
nothing to restore
r(622);

. use temp4, clear

. reshape long
(note: j = genefinder typewriter zam)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                   115836   ->  347508
Number of variables                   7   ->       6
j variable (3 values)                     ->   method
xij variables:
valuegenefinder valuetypewriter valuezam  ->   value
-----------------------------------------------------------------------------

.  noi di "missing values"
missing values

. replace value = upper(value)
(19,140 real changes made)

. gen ambi = 1 if inlist(value, "ND", "NT", "LOW COV", "MIXED")
(347,507 missing values generated)

. replace ambi=1 if inlist(value, "NOT DONE", "N/A", "NF", "NA", "-", "X")
(1 real change made)

. summ ambi if ambi ==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ambi |          2           1           0          1          1

. noi di r(N) " values have N/A or equivalent values, set these all to A"
2 values have N/A or equivalent values, set these all to A

. noi list site value if ambi==1

        +--------------+
        | site   value |
        |--------------|
131659. | gyra      ND |
328708. |  etd       X |
        +--------------+

. noi replace value = "A" if ambi==1
(2 real changes made)

. tab site if ambi ==1

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
           etd |          1       50.00       50.00
          gyra |          1       50.00      100.00
---------------+-----------------------------------
         Total |          2      100.00

. drop ambi

. noi di "all values equal A or P, unless chromosonal"
all values equal A or P, unless chromosonal

. replace value=upper(value)
(0 real changes made)

. assert inlist(value, "A", "P") if !strpos(type, "Chro")

. tab value

                                  value |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                150:H-R |          6        0.00        0.00
                               150:H=>R |          6        0.00        0.00
                161:P-X;461:L-X;473:C-X |          1        0.00        0.00
                          21:L-V;99:F-Y |          1        0.00        0.00
                                 31:H-N |          1        0.00        0.00
                                31:H=>N |          1        0.00        0.00
                             326:T=>I   |          2        0.00        0.01
                                373:D-G |          1        0.00        0.01
                376:A-T;404:P-L;461:L-F |          1        0.00        0.01
                                404:P-Q |          1        0.00        0.01
     404:P=>? , 406:P=>? NON CONTIGUOUS |          1        0.00        0.01
                     404:P=>L, 461:L=>F |          1        0.00        0.01
                               404:P=>Q |          1        0.00        0.01
                                406:P-L |          1        0.00        0.01
                               406:P=>L |          2        0.00        0.01
                                 41:L-F |          1        0.00        0.01
                                41:L=>F |          1        0.00        0.01
                                452:G-S |          1        0.00        0.01
                               452:G=>S |          1        0.00        0.01
                                457:H-Q |          1        0.00        0.01
                                457:H-Y |          4        0.00        0.01
                               457:H=>Q |          1        0.00        0.01
                               457:H=>Y |          6        0.00        0.01
                                461:L-F |          1        0.00        0.01
                                461:L-K |         22        0.01        0.02
                                461:L-S |         17        0.00        0.02
                               461:L=>F |          1        0.00        0.02
                               461:L=>K |         22        0.01        0.03
                               461:L=>S |         17        0.00        0.04
                                464:S-P |          1        0.00        0.04
                               464:S=>P |          1        0.00        0.04
                                477:A-D |          1        0.00        0.04
                               477:A=>D |          1        0.00        0.04
                                481:H-N |         16        0.00        0.04
                                481:H-Y |          6        0.00        0.04
                               481:H=>N |         16        0.00        0.05
                               481:H=>Y |          6        0.00        0.05
                                656:T-S |          1        0.00        0.05
                               656:T=>S |          1        0.00        0.05
                         67:A-T;406:P-L |          1        0.00        0.05
                         67:A-T;457:H-Y |          2        0.00        0.05
                         71:A-X;160:A-X |          1        0.00        0.05
                 71:A-X;373:D-X;456:L-X |          2        0.00        0.05
                         71:A-X;456:L-X |          3        0.00        0.05
                                 80:S-F |        299        0.09        0.14
                          80:S-F;84:E-K |          3        0.00        0.14
                                 80:S-Y |          4        0.00        0.14
                                80:S=>F |        302        0.09        0.23
                                80:S=>Y |          4        0.00        0.23
                                 84:E-G |          1        0.00        0.23
                                 84:S-A |          1        0.00        0.23
                                 84:S-L |        291        0.08        0.31
                                 84:S-V |          1        0.00        0.31
                                 84:S-X |          2        0.00        0.31
                          84:S-X;88:E-X |          1        0.00        0.31
                                84:S=>A |          1        0.00        0.31
                                84:S=>L |        292        0.08        0.40
                                 90:V-I |          8        0.00        0.40
                                90:V=>I |          6        0.00        0.40
                                 99:F-X |          1        0.00        0.40
                                 99:F-Y |         73        0.02        0.42
                                99:F=>Y |         74        0.02        0.44
                                      A |    294,025       84.61       85.05
                DFRB_F99Y-AAA1497289ATA |         73        0.02       85.08
               DFRB_H150R-ATG1497136ACG |          6        0.00       85.08
DFRB_L21V-TAA1497523TACDFRB_F99Y-AAA1.. |          1        0.00       85.08
                DFRB_L41F-TAA1497463GAA |          1        0.00       85.08
                 FUS_E468V-GAA601104GTA |          1        0.00       85.08
                 FUS_G452S-GGT601056AGT |          1        0.00       85.08
                 FUS_H457Q-CAC601071CAA |          1        0.00       85.08
                 FUS_H457Y-CAC601071TAC |          4        0.00       85.08
FUS_H457Y-CAC601071TACFUS_A67T-GCA599.. |          2        0.00       85.08
                 FUS_L461F-TTA601083TTT |          1        0.00       85.08
                 FUS_L461K-TTA601083AAA |         22        0.01       85.09
                 FUS_L461S-TTA601083TCA |         17        0.00       85.09
FUS_P404L-CCA600912CTAFUS_L461F-TTA60.. |          1        0.00       85.09
                 FUS_P404Q-CCA600912CAA |          1        0.00       85.09
                 FUS_P406L-CCA600918CTA |          1        0.00       85.09
FUS_P406L-CCA600918CTAFUS_A67T-GCA599.. |          1        0.00       85.09
                  FUS_V90I-GTA599970ATA |          8        0.00       85.10
                GRLA_I45M-ATT1419892ATG |        100        0.03       85.12
GRLA_I45M-ATT1419892ATGGRLA_E84G-GAA1.. |          1        0.00       85.12
                GRLA_S80F-TCC1419997TTC |        295        0.08       85.21
                GRLA_S80Y-TCC1419997TAC |          4        0.00       85.21
                   GYRA_S84A-TCA7254GCA |          1        0.00       85.21
                   GYRA_S84L-TCA7254TTA |        293        0.08       85.30
                                      P |     32,799        9.44       94.73
                RPOB_A477D-GCT592259GAT |          1        0.00       94.73
                RPOB_H481N-CAT592271AAT |         16        0.00       94.74
                RPOB_H481Y-CAT592271TAT |          5        0.00       94.74
                RPOB_Q468R-CAA592232CGA |          1        0.00       94.74
                RPOB_S464P-TCT592220CCT |          1        0.00       94.74
                                     WT |     18,278        5.26      100.00
----------------------------------------+-----------------------------------
                                  Total |    347,508      100.00

. tab site

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
      aac6aph2 |      4,137        1.19        1.19
    aaddaph4ia |      4,137        1.19        2.38
    aadeant6ia |      4,137        1.19        3.57
        ant9ia |      4,137        1.19        4.76
        ant9ib |      4,137        1.19        5.95
        aph2ic |      4,137        1.19        7.14
  apha3aph3iii |      4,137        1.19        8.33
          arca |      4,137        1.19        9.52
          arcb |      4,137        1.19       10.71
          arcc |      4,137        1.19       11.90
          arcd |      4,137        1.19       13.10
          blaz |      4,137        1.19       14.29
           cat |      4,137        1.19       15.48
          ccra |      4,137        1.19       16.67
          ccrb |      4,137        1.19       17.86
         ccrca |      4,137        1.19       19.05
         ccrcb |      4,137        1.19       20.24
         ccrcc |      4,137        1.19       21.43
           cfr |      4,137        1.19       22.62
           chp |      4,137        1.19       23.81
          dfra |      4,137        1.19       25.00
          dfrb |      4,137        1.19       26.19
          dfrc |      4,137        1.19       27.38
          dfrd |      4,137        1.19       28.57
          dfrg |      4,137        1.19       29.76
          dfrk |      4,137        1.19       30.95
          erma |      4,137        1.19       32.14
          ermb |      4,137        1.19       33.33
          ermc |      4,137        1.19       34.52
          ermt |      4,137        1.19       35.71
          ermy |      4,137        1.19       36.90
           eta |      4,137        1.19       38.10
           etb |      4,137        1.19       39.29
           etd |      4,137        1.19       40.48
          fusa |      4,137        1.19       41.67
          fusb |      4,137        1.19       42.86
          fusc |      4,137        1.19       44.05
          grla |      4,137        1.19       45.24
          gyra |      4,137        1.19       46.43
          isab |      4,137        1.19       47.62
          lnua |      4,137        1.19       48.81
          lnub |      4,137        1.19       50.00
          lukm |      4,137        1.19       51.19
         lukmf |      4,137        1.19       52.38
        lukpvf |      4,137        1.19       53.57
        lukpvs |      4,137        1.19       54.76
          meca |      4,137        1.19       55.95
          mecc |      4,137        1.19       57.14
          mphc |      4,137        1.19       58.33
          msra |      4,137        1.19       59.52
          mupa |      4,137        1.19       60.71
          mupb |      4,137        1.19       61.90
          qaca |      4,137        1.19       63.10
          qacb |      4,137        1.19       64.29
       qaccsmr |      4,137        1.19       65.48
          rpob |      4,137        1.19       66.67
           sak |      4,137        1.19       67.86
          sasx |      4,137        1.19       69.05
          sat4 |      4,137        1.19       70.24
           scn |      4,137        1.19       71.43
           sea |      4,137        1.19       72.62
           seb |      4,137        1.19       73.81
           sec |      4,137        1.19       75.00
           sed |      4,137        1.19       76.19
           see |      4,137        1.19       77.38
           seg |      4,137        1.19       78.57
           seh |      4,137        1.19       79.76
           sei |      4,137        1.19       80.95
           sej |      4,137        1.19       82.14
          selr |      4,137        1.19       83.33
           sep |      4,137        1.19       84.52
           seu |      4,137        1.19       85.71
           str |      4,137        1.19       86.90
          tetk |      4,137        1.19       88.10
          tetl |      4,137        1.19       89.29
          tetm |      4,137        1.19       90.48
          teto |      4,137        1.19       91.67
         tsst1 |      4,137        1.19       92.86
          vana |      4,137        1.19       94.05
          vanb |      4,137        1.19       95.24
          vanc |      4,137        1.19       96.43
          vgaa |      4,137        1.19       97.62
          vgab |      4,137        1.19       98.81
          vgba |      4,137        1.19      100.00
---------------+-----------------------------------
         Total |    347,508      100.00

. ***************

. gen count = 1 if strpos(value, "=>")
(346,741 missing values generated)

. summ count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |        767           1           0          1          1

. noi di r(N) " replace => with - to create uniform recording of mutations"
767 replace => with - to create uniform recording of mutations

. noi replace value = subinstr(value, "=>", "-",.)
(767 real changes made)

. drop count 

. gen count = 1 if strpos(value," ")
(347,504 missing values generated)

. summ count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |          4           1           0          1          1

. noi di r(N) " remove all spaces in value reports"
4 remove all spaces in value reports

. noi replace value = subinstr(value, " ", "",.)
(4 real changes made)

. drop count 

. * fix new mykrobe output to same format as typewriter/genefinder 

. gen start=strpos(value,"_")

. gen end= strpos(value, "-")

. gen value2= value

. replace value2= substr(value,start+2,end-start-3)+":"+substr(value,start+1,1)+"-" +substr(value,end-1,1) ///
invalid syntax
r(198);

. if inlist(site, "fusa", "gyra", "grla", "rpob", "dfrb") & method=="zam" & value!="WT"
{ required
r(100);

. replace value2= substr(value,start+2,end-start-3)+":"+substr(value,start+1,1)+"-" +substr(value,end-1,1) if inlist(site, "fusa",
>  "gyra", "grla", "rpob", "dfrb") & method=="zam" & value!="WT"
(860 real changes made)

. replace value = substr(value, end+1, .)
(2,406 real changes made)

. drop start end

. gen start=strpos(value,"_")

. gen end= strpos(value, "-")

. gen value3= substr(value,start+2,end-start-3)+":"+substr(value,start+1,1)+"-" +substr(value,end-1,1) if inlist(site, "fusa", "gy
> ra", "grla", "rpob", "dfrb") & method=="zam" & value!="WT" & start!=0
(347,502 missing values generated)

. replace value = substr(value, end+1, .)
(24 real changes made)

. drop start end

. gen start=strpos(value,"_")

. gen end= strpos(value, "-")

. assert start==0

. replace value = value2 + "; " + value3 if value3!=""
(6 real changes made)

. replace value = value2 if value2!="" & value3==""
(2,400 real changes made)

. drop value2 value3 start end

. *swap to binary the point mutations

. * clarify absenses

. gen count = 1  if value=="WT" & strpos(type, "Chromo")
(329,230 missing values generated)

. summ count if count==1 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |     18,278           1           0          1          1

. noi di r(N) "replace WT with A in typewriter/ genewriter/ zam  reports on chromosonal mutations"
18278replace WT with A in typewriter/ genewriter/ zam  reports on chromosonal mutations

. noi replace value = "A" if count==1 
(18,278 real changes made)

. drop count

. * clarify point mutations based on clare's paper *NOTE: need to do as strpos not inlist as there are multiple variations reporte
> d

. noi di "mutations: if count!=1 then no considered positive as not in panal on clare's paper"
mutations: if count!=1 then no considered positive as not in panal on clare's paper

. * fusa

. noi di "fusa mutations"
fusa mutations

. gen count =1 if strpos(value, "434:B-N")  & strpos(site, "fusa")
(347,508 missing values generated)

. replace count =1 if strpos(value, "461:L-K")  & strpos(site, "fusa")
(66 real changes made)

. replace count =1 if strpos(value, "461:L-K") & strpos(value, "457:H-Q")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-K") & strpos(value, "473:C-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "67:A-T" ) & strpos(site, "fusa")
(4 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "70:A-V" ) & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "67:R-C" ) & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-K")  & strpos(value, "457:H-Q") & strpos(value, "655:A-V") & strpos(value, "90:V-I") & 
> strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-F")  & strpos(value, "376:A-V") & strpos(value, "655:A-P") & strpos(value, "463:D-G") &
>  strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Q")  & strpos(value, "461:L-F") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "90:V-I")   & strpos(value, "457:H-Q") & strpos(value, "461:L-K") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(site, "fusa")
(14 real changes made)

. replace count =1 if strpos(value, "461:L-S")  & strpos(value, "404:P-L") & strpos(value, "71:A-V")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-S")  & strpos(value, "90:V-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "161:M-I") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "416:S-F") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y" ) & strpos(value, "373:D-N") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "115:Q-L")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "436:T-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "452:G-S")  & strpos(site, "fusa")
(3 real changes made)

. replace count =1 if strpos(value, "456:L-F")  & strpos(value, "376:A-V") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-F")  & strpos(value, "444:E-K") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "444:E-K")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "556:G-S" ) & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "659:R-L")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "404:P-L")  & strpos(site, "fusa")
(3 real changes made)

. replace count =1 if strpos(value, "451:G-V")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y")  & strpos(value, "659:R-L") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Y")  & strpos(value, "556:G-S") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-S")  & strpos(value, "233:E-Q") & strpos(value, "90:V-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "655:A-E")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "452:G-C")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "114:P-H")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "659:R-C")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "659:R-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "438:H-N")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "478:P-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "659:R-H")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "67:A-T")   & strpos(value, "406:P-L") & strpos(site, "fusa")
(2 real changes made)

. replace count =1 if strpos(value, "71:A-V")   & strpos(value, "404:P-L") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "652:F-S")  & strpos(value, "654:Y-N") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "71:A-V")   & strpos(value, "189:D-G") &  strpos(value, "406:P-L") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "456:L-F")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "453:M-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "461:L-S")  & strpos(site, "fusa")
(51 real changes made)

. replace count =1 if strpos(value, "464:R-C")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "90:V-I")  & strpos(site, "fusa")
(22 real changes made)

. replace count =1 if strpos(value, "406:P-L")  & strpos(site, "fusa")
(4 real changes made)

. replace count =1 if strpos(value, "464:R-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "464:R-H")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "617:G-D")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "664:G-S")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "457:H-Q")  & strpos(site, "fusa")
(3 real changes made)

. replace count =1 if strpos(value, "385:T-N")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "656:T-K")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "651:M-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "404:P-Q")  & strpos(site, "fusa")
(3 real changes made)

. * from the mutations where MIC no described part of the table

. replace count =1 if strpos(value, "376:A-V")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "441:F-Y")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "70:A-V")   & strpos(value, "160:A-V")  & strpos(value, "457:H-Y") & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "607:V-I")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "90:V-A")   & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "387:T-I")  & strpos(value, "449:E-K")  & strpos(site, "fusa")
(0 real changes made)

. replace count =1 if strpos(value, "189:D-V")  & strpos(value, "430:L-S")  &strpos(site, "fusa")
(0 real changes made)

. noi tab value count if site=="fusa" & strpos(value, "-") , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
161:P-X;461:L-X;473.. |         0          1 |         1 
              326:T-I |         0          2 |         2 
              373:D-G |         0          1 |         1 
376:A-T;404:P-L;461.. |         1          0 |         1 
404:P-?,406:P-?NONC.. |         0          1 |         1 
      404:P-L,461:L-F |         1          0 |         1 
     404:P-L; 461:L-F |         1          0 |         1 
              404:P-Q |         3          0 |         3 
              406:P-L |         4          0 |         4 
      406:P-L; 67:A-T |         1          0 |         1 
              452:G-S |         3          0 |         3 
              457:H-Q |         3          0 |         3 
              457:H-Y |        14          0 |        14 
      457:H-Y; 67:A-T |         2          0 |         2 
              461:L-F |         0          3 |         3 
              461:L-K |        66          0 |        66 
              461:L-S |        51          0 |        51 
              468:E-V |         0          1 |         1 
              656:T-S |         0          2 |         2 
       67:A-T;406:P-L |         1          0 |         1 
       67:A-T;457:H-Y |         2          0 |         2 
       71:A-X;160:A-X |         0          1 |         1 
71:A-X;373:D-X;456:.. |         0          2 |         2 
       71:A-X;456:L-X |         0          3 |         3 
               90:V-I |        22          0 |        22 
----------------------+----------------------+----------
                Total |       175         17 |       192 


. replace value = "P" if count ==1
(175 real changes made)

. noi tab value count if site=="fusa" , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
161:P-X;461:L-X;473.. |         0          1 |         1 
              326:T-I |         0          2 |         2 
              373:D-G |         0          1 |         1 
404:P-?,406:P-?NONC.. |         0          1 |         1 
              461:L-F |         0          3 |         3 
              468:E-V |         0          1 |         1 
              656:T-S |         0          2 |         2 
       71:A-X;160:A-X |         0          1 |         1 
71:A-X;373:D-X;456:.. |         0          2 |         2 
       71:A-X;456:L-X |         0          3 |         3 
                    A |         0      3,945 |     3,945 
                    P |       175          0 |       175 
----------------------+----------------------+----------
                Total |       175      3,962 |     4,137 


. drop count 

. *rpob

. noi di "rpob mutations"
rpob mutations

. gen count =1 if strpos(value, "468:Q-K") & strpos(site, "rpob")
(347,508 missing values generated)

. replace count =1 if strpos(value, "471:D-Y") & strpos(value, "486:S-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "486:S-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "473:A-T") & strpos(value, "477:A-T") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "527:I-M") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "468:Q-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "565:Q-R") & strpos(value, "529:S-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "466:L-S") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-Y") & strpos(site, "rpob")
(17 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "529:S-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(value, "527:I-M") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-D") & strpos(value, "468:Q-K") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-D") & strpos(value, "527:I-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-D") & strpos(value, "529:S-L") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "468:Q-R") & strpos(site, "rpob")
(1 real change made)

. replace count =1 if strpos(value, "456:Q-K") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "484:R-H") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-D") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "477:A-D") & strpos(site, "rpob")
(3 real changes made)

. replace count =1 if strpos(value, "550:D-G") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-D") & strpos(value, "477:A-T") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "470:M-T") & strpos(value, "471:D-G") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "463:S-P") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "471:D-Y") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "464:S-P") & strpos(site, "rpob")
(3 real changes made)

. replace count =1 if strpos(value, "527:I-F") & strpos(site, "rpob")
(0 real changes made)

. replace count =1 if strpos(value, "481:H-N") & strpos(site, "rpob")
(48 real changes made)

. replace count =1 if strpos(value, "477:A-V") & strpos(site, "rpob")
(0 real changes made)

. * check insertion 

. gen insert =1 if strpos(site, "rpob") & (strpos(value,"475H") | strpos(value, "G475")) 
(347,508 missing values generated)

. summ insert

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      insert |          0

. noi di r(sum) " possible insertions in rpob mutations; check"
0 possible insertions in rpob mutations; check

. noi list site value count if insert==1

. noi tab value count if site=="rpob" & strpos(value, "-") , m

                      |   count
                value |         1 |     Total
----------------------+-----------+----------
              464:S-P |         3 |         3 
              468:Q-R |         1 |         1 
              477:A-D |         3 |         3 
              481:H-N |        48 |        48 
              481:H-Y |        17 |        17 
----------------------+-----------+----------
                Total |        72 |        72 


. noi replace value = "P" if count ==1
(72 real changes made)

. noi tab value count if site=="rpob" , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
                    A |         0      4,065 |     4,065 
                    P |        72          0 |        72 
----------------------+----------------------+----------
                Total |        72      4,065 |     4,137 


. drop count insert

. *dfrb

. noi di "dfrb mutations"
dfrb mutations

. gen count =1 if  strpos(value, "99:F-Y" ) & strpos(value, "31:H-N" ) & strpos(site, "dfrb")
(347,508 missing values generated)

. replace count =1 if  strpos(value, "99:F-Y") & strpos(value, "150:H-R") & strpos(site, "dfrb")
(0 real changes made)

. replace count =1 if  strpos(value, "99:F-Y") & strpos(value, "21:L-V") & strpos(value, "60:N-I") & strpos(site, "dfrb")
(0 real changes made)

. replace count =1 if  strpos(value, "31:H-N" ) & strpos(site, "dfrb")
(2 real changes made)

. replace count =1 if  strpos(value, "99:F-Y") & strpos(site, "dfrb")
(222 real changes made)

. replace count =1 if  strpos(value, "150:H-R") & strpos(site, "dfrb")
(18 real changes made)

. replace count =1 if  strpos(value, "99:F-S") & strpos(site, "dfrb")
(0 real changes made)

. replace count =1 if  strpos(value, "41:L-F") & strpos(site, "dfrb")
(3 real changes made)

. replace count =1 if  strpos(value, "99:F-I" ) & strpos(site, "dfrb")
(0 real changes made)

. noi tab value count if site=="dfrb" & strpos(value, "-") , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
              150:H-R |        18          0 |        18 
       21:L-V; 99:F-Y |         1          0 |         1 
        21:L-V;99:F-Y |         1          0 |         1 
               31:H-N |         2          0 |         2 
               41:L-F |         3          0 |         3 
               99:F-X |         0          1 |         1 
               99:F-Y |       220          0 |       220 
----------------------+----------------------+----------
                Total |       245          1 |       246 


. noi replace value = "P" if count ==1
(245 real changes made)

. noi tab value count if site=="dfrb" , m

                      |         count
                value |         1          . |     Total
----------------------+----------------------+----------
               99:F-X |         0          1 |         1 
                    A |         0      3,891 |     3,891 
                    P |       245          0 |       245 
----------------------+----------------------+----------
                Total |       245      3,892 |     4,137 


. drop count 

. preserve

. *gyra and grla

. noi di "gyra and grla mutations"
gyra and grla mutations

. * gyra and grla need to be done on same site

. keep if inlist(site, "gyra", "grla")
(339,234 observations deleted)

. reshape wide value, i(sample method set type ) j(site) string
(note: j = grla gyra)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     8274   ->    4137
Number of variables                   6   ->       6
j variable (2 values)              site   ->   (dropped)
xij variables:
                                  value   ->   valuegrla valuegyra
-----------------------------------------------------------------------------

. gen count =1 if strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-V") & strpos(valuegyra, "88:E-K") 
(4,137 missing values generated)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-G")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "85:S-P") 
(0 real changes made)

. replace count =1 if  strpos(valuegyra, "84:S-L")
(876 real changes made)

. *replace count =1 if  strpos(valuegyra, "84:S-A") 

. * not included on main table 2

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-L")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "85:S-P") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-G")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "88:E-K") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "85:S-P") 
(0 real changes made)

. replace count =1 if  strpos(valuegyra, "84:S-L")  & strpos(valuegyra, "85:S-P") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-G")  & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "108:S-N") & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "85:S-P") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-G")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "88:E-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "48:A-T")  & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "85:S-P") 
(0 real changes made)

. replace count =1 if  strpos(valuegyra, "84:S-L")  & strpos(valuegyra, "88:E-K") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-K") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-G")  & strpos(valuegyra, "84:S-L")
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegyra, "84:S-L")
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "84:S-L")
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegyra, "88:E-K")
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L")
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  
(38 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "84:S-L")  & strpos(valuegyra, "88:E-K") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-V")  & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "83:Y-N")  & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "84:E-K")  & strpos(valuegyra, "84:S-L") & strpos(valuegyr
> a, "88:E-G") 
(0 real changes made)

. replace count =1 if  strpos(valuegyra, "85:S-P") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "84:S-L")  & strpos(valuegyra, "85:S-P") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "116:A-E") & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegyra, "88:E-K") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "88:E-G") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "88:E-K") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "432:D-G") & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "79:D-V")  & strpos(valuegrla, "80:S-Y")  & strpos(valuegyra, "84:S-L") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegrla, "41:V-G")  & strpos(valuegrla, "45:I-M") & strpos(valuegyr
> a, "84:S-L")
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "84:S-L")  & strpos(valuegyra, "106:G-D")
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  & strpos(valuegyra, "88:E-G")
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "79:D-V")  & strpos(valuegrla, "80:S-F")  & strpos(valuegyra, "88:E-K") 
(0 real changes made)

. replace count =1 if  strpos(valuegrla, "80:S-Y")  
(3 real changes made)

. noi bysort count: tab valuegrla valuegyra

----------------------------------------------------------------------------------------------------------------------------------
-> count = 1

                      |                       gyra value
           grla value |    84:S-A     84:S-L     84:S-V     84:S-X          A |     Total
----------------------+-------------------------------------------------------+----------
               45:I-M |         0          1          0          0          0 |         1 
               80:S-F |         3        858          1          1         33 |       896 
        80:S-F;84:E-K |         0          3          0          0          0 |         3 
               80:S-Y |         0          9          0          0          3 |        12 
                    A |         0          5          0          0          0 |         5 
----------------------+-------------------------------------------------------+----------
                Total |         3        876          1          1         36 |       917 


----------------------------------------------------------------------------------------------------------------------------------
-> count = .

                      |            gyra value
           grla value |    84:S-X  84:S-X;..          A |     Total
----------------------+---------------------------------+----------
               45:I-M |         0          0         99 |        99 
       45:I-M; 84:E-G |         0          0          1 |         1 
               84:E-G |         0          0          1 |         1 
                    A |         1          1      3,117 |     3,119 
----------------------+---------------------------------+----------
                Total |         1          1      3,218 |     3,220 



. gen value ="P" if count==1
(3,220 missing values generated)

. replace value= "A" if count==. 
(3,220 real changes made)

. replace value = "grla: " + valuegrla + " gyra: " +valuegyra if (valuegrla!="A" | valuegyra!="A") & count==. 
variable value was str1 now str28
(103 real changes made)

. drop count

. noi tab value, m

                       value |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                           A |      3,117       75.34       75.34
                           P |        917       22.17       97.51
        grla: 45:I-M gyra: A |         99        2.39       99.90
grla: 45:I-M; 84:E-G gyra: A |          1        0.02       99.93
        grla: 84:E-G gyra: A |          1        0.02       99.95
        grla: A gyra: 84:S-X |          1        0.02       99.98
 grla: A gyra: 84:S-X;88:E-X |          1        0.02      100.00
-----------------------------+-----------------------------------
                       Total |      4,137      100.00

. gen site = "grla/gyra"

. drop valueg*

. assert _N==4137

. save grla_results, replace
file grla_results.dta saved

. 
. restore

. display _N
347508

. display 347508 - 343371
4137

. drop if inlist(site, "grla", "gyra")
(8,274 observations deleted)

. assert _N==347508
assertion is false
r(9);

. display _N
339234

