----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\users\amy.mason\Pipeline_27_07_2016\clean_maindata.log
  log type:  text
 opened on:  25 Jul 2016, 10:43:07

. 
. noi di "Run by AMM on $S_DATE $S_TIME"
Run by AMM on 25 Jul 2016 10:43:07

. 
. 
. 
. 
. 
. use "E:\users\amy.mason\staph_carriage\Datasets\raw_input.dta", clear

. 
. bysort patid: gen first=(_n==1)

. 
. summ first

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       first |     13,767    .1000218      .30004          0          1

. 
. noi di  " starting with " _N " records from " r(sum) " paticipants" 
 starting with 13767 records from 1377 paticipants

. 
. drop first

. 
. 
. 
. *******************************************************************

. 
. 
. 
. * drop people who were recruited in hospital / non nasal swabs

. 
. noi di _n(5) _dup(80) "=" _n "(2) DROP NON-NASAL/ NON-GP RECRUITMENT PEOPLE" _n _dup(80) "=" 





================================================================================
(2) DROP NON-NASAL/ NON-GP RECRUITMENT PEOPLE
================================================================================

. 
. * merge with group records

. 
. merge m:1 patid using "E:\users\amy.mason\staph_carriage\Datasets\groups", update

    Result                           # of obs.
    -----------------------------------------
    not matched                             0

    matched                            13,767
        not updated                    13,767  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. tab StudyGroup

                   StudyGroup |      Freq.     Percent        Cum.
------------------------------+-----------------------------------
                        C3 GP |     11,065       80.37       80.37
              D1a MAU disease |         87        0.63       81.01
                  D1b Surgery |        657        4.77       85.78
              D2 Sterile site |        704        5.11       90.89
D3a Skin and soft tissue (GP) |         41        0.30       91.19
                    Multisite |      1,158        8.41       99.60
                      Vaccine |         55        0.40      100.00
------------------------------+-----------------------------------
                        Total |     13,767      100.00

. 
. * upload lab data

. 
. 
. 
. cd E:\users\amy.mason\Pipeline\Amy_work
E:\users\amy.mason\Pipeline\Amy_work

. 
. 
. 
. use "E:\users\amy.mason\Pipeline\Amy_work\lab_compare_all_wide.dta", clear

. 
. 
. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. 
. 
. 
. 
. 
. * get wetlab counts

. 
. reshape long
(note: j = ciprofloxacin clindamycin erythromycin eta etb etd fusidicacid gentamicin meca mecc methicillin mupirocin penicillin pv
> l rifampicin sea seb sec sed see seg seh sei sej selr sep seu tetracycline trimethoprim tsst1 vancomycin)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1379   ->   42749
Number of variables                 126   ->       7
j variable (31 values)                    ->   site
xij variables:
goldstandardciprofloxacin goldstandardclindamycin ... goldstandardvancomycin->goldstandard
genefinderciprofloxacin genefinderclindamycin ... genefindervancomycin->genefinder
typewriterciprofloxacin typewriterclindamycin ... typewritervancomycin->typewriter
zamciprofloxacin zamclindamycin ... zamvancomycin->zam
-----------------------------------------------------------------------------

. 
. 
. 
. * add type to discriminate graphs at later stage

. 
. gen type =""
(42,749 missing values generated)

. 
. replace type ="Phenotype" if inlist(site, "ciprofloxacin", "fusidicacid", "clindamycin", "erythromycin")
variable type was str1 now str9
(5,516 real changes made)

. 
. replace type ="Phenotype" if inlist(site, "gentamicin", "mupirocin", "penicillin","rifampicin")
(5,516 real changes made)

. 
. replace type ="Phenotype" if inlist(site,"tetracycline", "trimethoprim", "vancomycin", "methicillin")
(5,516 real changes made)

. 
. 
. 
. keep if type!=""
(26,201 observations deleted)

. 
. *keep if type==""

. 
. 
. 
. gen anti=(strlen(site)>5)

. 
. 
. 
. contract  anti site gold gene typew zam

. 
. gen result = gene + typew + zam 

. 
. 
. 
. * note order is GENEFINDER THEN TYPEWRITER THEN MYKROBE

. 
. drop gene typew zam

. 
. replace result = "missing" if result==""
(0 real changes made)

. 
. replace gold = "missing" if gold==""
(0 real changes made)

. 
. 
. 
. 
. 
. reshape wide _freq, i(site gold) j(result) string
(note: j = RRR RRS RSR RSS SSR SSS)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      107   ->      44
Number of variables                   5   ->       9
j variable (6 values)            result   ->   (dropped)
xij variables:
                                  _freq   ->   _freqRRR _freqRRS ... _freqSSS
-----------------------------------------------------------------------------

. 
. rename _freq* *

. 
. 
. 
. egen combor = rowtotal(RRR RSR)

. 
. replace combor=0 if combor==.
(0 real changes made)

. 
. egen combos= rowtotal(SSR SSS)

. 
. replace combos=0 if combos==.
(0 real changes made)

. 
. 
. 
.  drop R* S*

. 
.  
. 
.  keep if inlist(gold, "R", "S")
(21 observations deleted)

. 
.  
. 
.  
. 
.  reshape wide combo*, i(site) j(gold) string
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       23   ->      12
Number of variables                   5   ->       6
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------

. 
.  
. 
.  rename combo* *

. 
. 
. 
.  *** generate sensitivity and specificity

. 
.  ***** NOTE: [ called GOLD] is format of these variables

. 
. 
. 
.  replace sS = 0 if sS==.
(0 real changes made)

. 
.  replace rS = 0 if rS==.
(0 real changes made)

. 
.  replace sR = 0 if sR==.
(1 real change made)

. 
.  replace rR = 0 if rR==.
(1 real change made)

. 
.    
. 
. 
. 
. for any lsens usens lspec uspec lme ume lvme uvme:gen X=.

->  gen lsens=.
(12 missing values generated)

->  gen usens=.
(12 missing values generated)

->  gen lspec=.
(12 missing values generated)

->  gen uspec=.
(12 missing values generated)

->  gen lme=.
(12 missing values generated)

->  gen ume=.
(12 missing values generated)

->  gen lvme=.
(12 missing values generated)

->  gen uvme=.
(12 missing values generated)

. 
. 
. 
. gen TP= rR

. 
. gen FP = rS

. 
. gen TN = sS

. 
. gen FN = sR

. 
. use "E:\users\amy.mason\staph_carriage\Datasets\raw_input.dta", clear

. 
. bysort patid: gen first=(_n==1)

. 
. summ first

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       first |     13,767    .1000218      .30004          0          1

. 
. noi di  " starting with " _N " records from " r(sum) " paticipants" 
 starting with 13767 records from 1377 paticipants

. 
. drop first

. list if strpos(spatype, "t1236")

       +---------------------------------------------------------------------------------+
       | SwabID   patid        Sent    Received   Result   DateTa~n   spatype   timepo~t |
       |---------------------------------------------------------------------------------|
 1005. |    176     144   23feb2009   23feb2009     MSSA          .     t1236          0 |
       +---------------------------------------------------------------------------------+

. list if strpos(spatype, "t570")

       +----------------------------------------------------------------------------------+
       | SwabID   patid        Sent    Received   Result   DateTaken   spatype   timepo~t |
       |----------------------------------------------------------------------------------|
  640. |    357      97   31mar2009   06apr2009     MSSA   02apr2009      t570          2 |
  642. |    202      97   04mar2009   16mar2009     MSSA   09mar2009      t570          1 |
  647. |    119      97   11feb2009   11feb2009     MSSA           .      t570          0 |
       +----------------------------------------------------------------------------------+

. list if strpos(spatype, "t6798")

       +---------------------------------------------------------------------------------+
       | SwabID   patid        Sent    Received   Result   DateTa~n   spatype   timepo~t |
       |---------------------------------------------------------------------------------|
 2959. |    474     611   20apr2009   20apr2009     MSSA          .     t6798          0 |
       +---------------------------------------------------------------------------------+

. list if strpos(spatype, "t6801")

       +---------------------------------------------------------------------------------+
       | SwabID   patid        Sent    Received   Result   DateTa~n   spatype   timepo~t |
       |---------------------------------------------------------------------------------|
  230. |     33      31   13jan2009   13jan2009     MSSA          .     t6801          0 |
       +---------------------------------------------------------------------------------+

. list if patid==31

       +-------------------------------------------------------------------------------------+
       | SwabID   patid        Sent    Received      Result   DateTaken   spatype   timepo~t |
       |-------------------------------------------------------------------------------------|
  229. |   1388      31   01sep2009           .                       .                    8 |
  230. |     33      31   13jan2009   13jan2009        MSSA           .     t6801          0 |
  231. |    889      31   09jul2009           .                       .                    6 |
  232. |     81      31   04feb2009   16mar2009   No growth   15feb2009                    1 |
  233. |   2041      31   11nov2009           .                       .                   10 |
       |-------------------------------------------------------------------------------------|
  234. |    196      31   04mar2009   16mar2009   No growth           .                    2 |
  235. |   2793      31   11jan2010   25jan2010   No growth   17jan2010                   12 |
  236. |    533      31   08may2009           .                       .                    4 |
       +-------------------------------------------------------------------------------------+

. list if patid==611

       +-------------------------------------------------------------------------------------+
       | SwabID   patid        Sent    Received      Result   DateTaken   spatype   timepo~t |
       |-------------------------------------------------------------------------------------|
 2955. |   3219     611   12feb2010   22feb2010        MSSA   16feb2010      t089         10 |
 2956. |    573     611   14may2009   01jun2009        MSSA   25may2009      t089          1 |
 2957. |   1603     611   06oct2009   09nov2009        MSSA   30oct2009      t089          6 |
 2958. |   5583     611   13oct2010   02nov2010   No growth   31oct2010                   18 |
 2959. |    474     611   20apr2009   20apr2009        MSSA           .     t6798          0 |
       |-------------------------------------------------------------------------------------|
 2960. |   4964     611   11aug2010   24aug2010   No growth   16aug2010                   16 |
 2961. |   1222     611   14aug2009   15sep2009        MSSA   06sep2009      t089          4 |
 2962. |   3659     611   09apr2010   28apr2010   No growth   20apr2010                   12 |
 2963. |   6151     611   07dec2010   20dec2010   No growth   13dec2010                   20 |
 2964. |   4365     611   11jun2010   30jun2010   No growth           .                   14 |
       |-------------------------------------------------------------------------------------|
 2965. |    728     611   11jun2009   29jun2009        MSSA   21jun2009      t089          2 |
 2966. |   2595     611   09dec2009   04jan2010        MSSA   11dec2009      t089          8 |
 2967. |   7354     611   12apr2011   03may2011        MSSA   22apr2011      t089         24 |
 2968. |   6752     611   08feb2011   28feb2011   No growth   21feb2011                   22 |
       +-------------------------------------------------------------------------------------+

. 
. * upload lab data

. 
. 
. 
. cd E:\users\amy.mason\Pipeline\Amy_work
E:\users\amy.mason\Pipeline\Amy_work

. 
. 
. 
. use "E:\users\amy.mason\Pipeline\Amy_work\lab_compare_all_wide.dta", clear

. 
. 
. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. 
. 
. 
. 
. 
. * get wetlab counts

. 
. reshape long
(note: j = ciprofloxacin clindamycin erythromycin eta etb etd fusidicacid gentamicin meca mecc methicillin mupirocin penicillin pv
> l rifampicin sea seb sec sed see seg seh sei sej selr sep seu tetracycline trimethoprim tsst1 vancomycin)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1379   ->   42749
Number of variables                 126   ->       7
j variable (31 values)                    ->   site
xij variables:
goldstandardciprofloxacin goldstandardclindamycin ... goldstandardvancomycin->goldstandard
genefinderciprofloxacin genefinderclindamycin ... genefindervancomycin->genefinder
typewriterciprofloxacin typewriterclindamycin ... typewritervancomycin->typewriter
zamciprofloxacin zamclindamycin ... zamvancomycin->zam
-----------------------------------------------------------------------------

. 
. 
. 
. * add type to discriminate graphs at later stage

. 
. gen type =""
(42,749 missing values generated)

. 
. replace type ="Phenotype" if inlist(site, "ciprofloxacin", "fusidicacid", "clindamycin", "erythromycin")
variable type was str1 now str9
(5,516 real changes made)

. 
. replace type ="Phenotype" if inlist(site, "gentamicin", "mupirocin", "penicillin","rifampicin")
(5,516 real changes made)

. 
. replace type ="Phenotype" if inlist(site,"tetracycline", "trimethoprim", "vancomycin", "methicillin")
(5,516 real changes made)

. 
. 
. 
. keep if type!=""
(26,201 observations deleted)

. 
. *keep if type==""

. 
. 
. 
. gen anti=(strlen(site)>5)

. 
. 
. 
. contract  anti site gold gene typew zam

. 
. gen result = gene + typew + zam 

. 
. 
. 
. * note order is GENEFINDER THEN TYPEWRITER THEN MYKROBE

. 
. drop gene typew zam

. 
. replace result = "missing" if result==""
(0 real changes made)

. 
. replace gold = "missing" if gold==""
(0 real changes made)

. 
. 
. 
. 
. 
. reshape wide _freq, i(site gold) j(result) string
(note: j = RRR RRS RSR RSS SSR SSS)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      107   ->      44
Number of variables                   5   ->       9
j variable (6 values)            result   ->   (dropped)
xij variables:
                                  _freq   ->   _freqRRR _freqRRS ... _freqSSS
-----------------------------------------------------------------------------

. 
. rename _freq* *

. 
. 
. 
. egen combor = rowtotal(RRR RSR)

. 
. replace combor=0 if combor==.
(0 real changes made)

. 
. egen combos= rowtotal(SSR SSS)

. 
. replace combos=0 if combos==.
(0 real changes made)

. 
. 
. 
.  drop R* S*

. 
.  
. 
.  keep if inlist(gold, "R", "S")
(21 observations deleted)

. 
.  
. 
.  
. 
.  reshape wide combo*, i(site) j(gold) string
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       23   ->      12
Number of variables                   5   ->       6
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------

. 
.  
. 
.  rename combo* *

. 
. 
. 
.  *** generate sensitivity and specificity

. 
.  ***** NOTE: [ called GOLD] is format of these variables

. 
. 
. 
.  replace sS = 0 if sS==.
(0 real changes made)

. 
.  replace rS = 0 if rS==.
(0 real changes made)

. 
.  replace sR = 0 if sR==.
(1 real change made)

. 
.  replace rR = 0 if rR==.
(1 real change made)

. 
.    
. 
. 
. 
. for any lsens usens lspec uspec lme ume lvme uvme:gen X=.

->  gen lsens=.
(12 missing values generated)

->  gen usens=.
(12 missing values generated)

->  gen lspec=.
(12 missing values generated)

->  gen uspec=.
(12 missing values generated)

->  gen lme=.
(12 missing values generated)

->  gen ume=.
(12 missing values generated)

->  gen lvme=.
(12 missing values generated)

->  gen uvme=.
(12 missing values generated)

. 
. 
. 
. gen TP= rR

. 
. gen FP = rS

. 
. gen TN = sS

. 
. gen FN = sR

. 
. * upload lab data

. 
. 
. 
. cd E:\users\amy.mason\Pipeline\Amy_work
E:\users\amy.mason\Pipeline\Amy_work

. 
. 
. 
. use "E:\users\amy.mason\Pipeline\Amy_work\lab_compare_all_wide.dta", clear

. 
. 
. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. 
. 
. 
. 
. 
. * get wetlab counts

. 
. reshape long
(note: j = ciprofloxacin clindamycin erythromycin eta etb etd fusidicacid gentamicin meca mecc methicillin mupirocin penicillin pv
> l rifampicin sea seb sec sed see seg seh sei sej selr sep seu tetracycline trimethoprim tsst1 vancomycin)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1379   ->   42749
Number of variables                 126   ->       7
j variable (31 values)                    ->   site
xij variables:
goldstandardciprofloxacin goldstandardclindamycin ... goldstandardvancomycin->goldstandard
genefinderciprofloxacin genefinderclindamycin ... genefindervancomycin->genefinder
typewriterciprofloxacin typewriterclindamycin ... typewritervancomycin->typewriter
zamciprofloxacin zamclindamycin ... zamvancomycin->zam
-----------------------------------------------------------------------------

. 
. 
. 
. * add type to discriminate graphs at later stage

. 
. gen type =""
(42,749 missing values generated)

. 
. replace type ="Phenotype" if inlist(site, "ciprofloxacin", "fusidicacid", "clindamycin", "erythromycin")
variable type was str1 now str9
(5,516 real changes made)

. 
. replace type ="Phenotype" if inlist(site, "gentamicin", "mupirocin", "penicillin","rifampicin")
(5,516 real changes made)

. 
. replace type ="Phenotype" if inlist(site,"tetracycline", "trimethoprim", "vancomycin", "methicillin")
(5,516 real changes made)

. 
. 
. 
. keep if type!=""
(26,201 observations deleted)

. 
. *keep if type==""

. keep if strpos(site, "mup")
(15,169 observations deleted)

. 
. gen anti=(strlen(site)>5)

. 
. 
. 
. contract  anti site gold gene typew zam

. 
. gen result = gene + typew + zam

. drop gene typew zam

. 
. replace result = "missing" if result==""
(0 real changes made)

. 
. replace gold = "missing" if gold==""
(0 real changes made)

. 
. reshape wide _freq, i(site gold) j(result) string
(note: j = RRR RSR SSS)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        7   ->       4
Number of variables                   5   ->       6
j variable (3 values)            result   ->   (dropped)
xij variables:
                                  _freq   ->   _freqRRR _freqRSR _freqSSS
-----------------------------------------------------------------------------

. 
. rename _freq* *

. 
.  keep if inlist(gold, "R", "S")
(2 observations deleted)

. 
.  
. 
.  
. 
.  reshape wide combo*, i(site) j(gold) string
variable combo* not found
r(111);

. 
.  
. 
.  rename combo* *
variable combo* not found
r(111);

. 
. egen combor = rowtotal(RRR RSR)

. 
. replace combor=0 if combor==.
(0 real changes made)

. 
. egen combos= rowtotal(SSR SSS)
variable SSR not found
r(111);

. 
. replace combos=0 if combos==.
variable combos not found
r(111);

. 
. 
. 
.  drop R* S*

. 
. 
. 
. cd E:\users\amy.mason\Pipeline\Amy_work
E:\users\amy.mason\Pipeline\Amy_work

. 
. 
. 
. use "E:\users\amy.mason\Pipeline\Amy_work\lab_compare_all_wide.dta", clear

. 
. 
. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. 
. 
. 
. 
. 
. * get wetlab counts

. 
. reshape long
(note: j = ciprofloxacin clindamycin erythromycin eta etb etd fusidicacid gentamicin meca mecc methicillin mupirocin penicillin pv
> l rifampicin sea seb sec sed see seg seh sei sej selr sep seu tetracycline trimethoprim tsst1 vancomycin)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1379   ->   42749
Number of variables                 126   ->       7
j variable (31 values)                    ->   site
xij variables:
goldstandardciprofloxacin goldstandardclindamycin ... goldstandardvancomycin->goldstandard
genefinderciprofloxacin genefinderclindamycin ... genefindervancomycin->genefinder
typewriterciprofloxacin typewriterclindamycin ... typewritervancomycin->typewriter
zamciprofloxacin zamclindamycin ... zamvancomycin->zam
-----------------------------------------------------------------------------

. 
. 
. 
. * add type to discriminate graphs at later stage

. 
. gen type =""
(42,749 missing values generated)

. 
. replace type ="Phenotype" if inlist(site, "ciprofloxacin", "fusidicacid", "clindamycin", "erythromycin")
variable type was str1 now str9
(5,516 real changes made)

. 
. replace type ="Phenotype" if inlist(site, "gentamicin", "mupirocin", "penicillin","rifampicin")
(5,516 real changes made)

. 
. replace type ="Phenotype" if inlist(site,"tetracycline", "trimethoprim", "vancomycin", "methicillin")
(5,516 real changes made)

. 
. 
. 
. keep if type!=""
(26,201 observations deleted)

. 
. *keep if type==""

. 
. 
. 
. gen anti=(strlen(site)>5)

. 
. 
. 
. contract  anti site gold gene typew zam

. 
. gen result = gene + typew + zam 

. 
. 
. 
. * note order is GENEFINDER THEN TYPEWRITER THEN MYKROBE

. 
. drop gene typew zam

. 
. replace result = "missing" if result==""
(0 real changes made)

. 
. replace gold = "missing" if gold==""
(0 real changes made)

. 
. 
. 
. 
. 
. reshape wide _freq, i(site gold) j(result) string
(note: j = RRR RRS RSR RSS SSR SSS)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      107   ->      44
Number of variables                   5   ->       9
j variable (6 values)            result   ->   (dropped)
xij variables:
                                  _freq   ->   _freqRRR _freqRRS ... _freqSSS
-----------------------------------------------------------------------------

. 
. rename _freq* *

. 
. 
. 
. egen combor = rowtotal(RRR RSR)

. 
. replace combor=0 if combor==.
(0 real changes made)

. 
. egen combos= rowtotal(SSR SSS)

. 
. replace combos=0 if combos==.
(0 real changes made)

. 
. 
. 
.  drop R* S*

. 
.  
. 
.  keep if inlist(gold, "R", "S")
(21 observations deleted)

. 
.  
. 
.  
. 
.  reshape wide combo*, i(site) j(gold) string
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       23   ->      12
Number of variables                   5   ->       6
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------

. 
.  
. 
.  rename combo* *

. 
. 
. 
.  *** generate sensitivity and specificity

. 
.  ***** NOTE: [ called GOLD] is format of these variables

. 
. 
. 
.  replace sS = 0 if sS==.
(0 real changes made)

. 
.  replace rS = 0 if rS==.
(0 real changes made)

. 
.  replace sR = 0 if sR==.
(1 real change made)

. 
.  replace rR = 0 if rR==.
(1 real change made)

. 
.    
. 
. 
. 
. for any lsens usens lspec uspec lme ume lvme uvme:gen X=.

->  gen lsens=.
(12 missing values generated)

->  gen usens=.
(12 missing values generated)

->  gen lspec=.
(12 missing values generated)

->  gen uspec=.
(12 missing values generated)

->  gen lme=.
(12 missing values generated)

->  gen ume=.
(12 missing values generated)

->  gen lvme=.
(12 missing values generated)

->  gen uvme=.
(12 missing values generated)

. 
. 
. 
. gen TP= rR

. 
. gen FP = rS

. 
. gen TN = sS

. 
. gen FN = sR

. 
. 
. 
. gen POS = TP+FN

. 
. gen NEG = TN+ FP

. 
. gen specificity =TN/(TN+FP)

. 
. gen sensitivity = TP/(TP+FN)
(1 missing value generated)

. 
. gen MajorErrorRate = FP / (FP + TN)

. 
. gen VeryMajorErrorRate = FN/(TP+FN)
(1 missing value generated)

. 
. gen Accuracy = (TN + TP)/(TN+TP+FN+FP)

. 
. 
. 
. local max=_N

. 
. forvalues i=1(1)`max'{
  2. 
. di site[`i']
  3. 
. cii prop NEG[`i'] TN[`i']
  4. 
. replace lspec = r(lb) if _n==`i'
  5. 
. replace uspec = r(ub) if _n==`i'
  6. 
. cii prop POS[`i'] TP[`i']
  7. 
. replace lsens = r(lb) if _n==`i'
  8. 
. replace usens = r(ub) if _n==`i'
  9. 
. cii prop NEG[`i'] FP[`i']
 10. 
. replace lme = r(lb) if _n==`i'
 11. 
. replace ume = r(ub) if _n==`i'
 12. 
. cii prop POS[`i'] FN[`i']
 13. 
. replace lvme = r(lb) if _n==`i'
 14. 
. replace uvme = r(ub) if _n==`i'
 15. 
. }
ciprofloxacin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,035    .9961353    .0019286        .9901345     .998946
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        316    .9525316    .0119618        .9229159    .9731923
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,035    .0038647    .0019286         .001054    .0098655
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        316    .0474684    .0119618        .0268077    .0770841
(1 real change made)
(1 real change made)
clindamycin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        279    .9139785    .0167869        .8747111    .9441066
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        185     .972973    .0119224         .938058    .9911674
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        279    .0860215    .0167869        .0558934    .1252889
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        185     .027027    .0119224        .0088326     .061942
(1 real change made)
(1 real change made)
erythromycin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,024    .9833984    .0039929         .973552       .9903
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        348    .9827586    .0069778        .9628523    .9936471
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,024    .0166016    .0039929           .0097     .026448
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        348    .0172414    .0069778        .0063529    .0371477
(1 real change made)
(1 real change made)
fusidicacid

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,211    .9933939    .0023279         .987025    .9971438
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        162    .9074074    .0227736        .8518829    .9472465
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,211    .0066061    .0023279        .0028562     .012975
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        162    .0925926    .0227736        .0527535    .1481171
(1 real change made)
(1 real change made)
gentamicin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,279    .9976544    .0013526        .9931607     .999516
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         94     .787234    .0422123        .6907065    .8649268
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,279    .0023456    .0013526         .000484    .0068393
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         94     .212766    .0422123        .1350732    .3092935
(1 real change made)
(1 real change made)
methicillin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        962    .9948025    .0023183        .9879127    .9983103
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        391    .9795396    .0071594        .9600844    .9911263
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        962    .0051975    .0023183        .0016897    .0120873
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        391    .0204604    .0071594        .0088737    .0399156
(1 real change made)
(1 real change made)
mupirocin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,015    .9921182    .0027756        .9845291    .9965912
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |          6           1           0        .5407419           1*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,015    .0078818    .0027756        .0034088    .0154709
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |          6           0           0               0    .4592581*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)
penicillin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        232    .8577586    .0229325         .806078    .9000219
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,137    .9903254    .0029029        .9827556    .9951609
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        232    .1422414    .0229325        .0999781     .193922
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,137    .0096746    .0029029        .0048391    .0172444
(1 real change made)
(1 real change made)
rifampicin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,347    .9992576    .0007421        .9958707    .9999812
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         25         .92    .0542586        .7396942    .9901604
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,347    .0007424    .0007421        .0000188    .0041293
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         25         .08    .0542586        .0098396    .2603058
(1 real change made)
(1 real change made)
tetracycline

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,254     .992823    .0023837        .9864197    .9967131
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        118    .9576271    .0185439        .9038842    .9861006
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,254     .007177    .0023837        .0032869    .0135803
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        118    .0423729    .0185439        .0138994    .0961158
(1 real change made)
(1 real change made)
trimethoprim

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        627    .9984051    .0015936        .9911461    .9999596
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         38    .8421053    .0591528        .6874664    .9397703
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        627    .0015949    .0015936        .0000404    .0088539
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         38    .1578947    .0591528        .0602297    .3125336
(1 real change made)
(1 real change made)
vancomycin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,373           1           0        .9973169           1*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)
first argument, #obs, must be a positive integer
r(198);

. 
. 
. 
. 
. 
. 
. 
. sort site

. 
.  gen num =_n 

. 
. 
. 
.  order site  Major lme ume Very lvme uvme sS sR rS rR

. 
.  format  MajorErrorRate lme ume VeryMajorErrorRate lvme uvme lsens usens lspec uspec cPOS cNEG sensitivity specificity truNeg tr
> uPos Agreement num %4.3f
variable cPOS not found
r(111);

. 
. 
. 
. 
. 
. 
. 
. labmask num, values(site)
command labmask is unrecognized
r(199);

. 
. preserve

. 
. rename * maj_*

. 
. rename maj_site site

. 
. save majority, replace
(note: file majority.dta not found)
file majority.dta saved

. 
. restore

. 
. 
. 
. local max= _N

. 
. #delimit ;
Unknown #command

. 
. twoway rcap usens lsens num || scatter sens num,  xlabel(1(1)`max', valuelabel angle(90))

. 
. legend(off) title("Majority Rule vs. Lab") 
command legend is unrecognized
r(199);

. 
. subtitle("Sensitivity in Phenotype prediction");
command subtitle is unrecognized
r(199);

. 
. #delimit cr
Unknown #command

. 
. graph save Graph "E:\users\amy.mason\Pipeline_27_07_2016\majority_sens_all.gph", replace
(note: file E:\users\amy.mason\Pipeline_27_07_2016\majority_sens_all.gph not found)
(file E:\users\amy.mason\Pipeline_27_07_2016\majority_sens_all.gph saved)

. 
. graph export "E:\users\amy.mason\Pipeline_27_07_2016\majority_sens_all.tif", as(tif) replace
(note: file E:\users\amy.mason\Pipeline_27_07_2016\majority_sens_all.tif not found)
(file E:\users\amy.mason\Pipeline_27_07_2016\majority_sens_all.tif written in TIFF format)

. twoway rcap usens lsens num || scatter sens num,  xlabel(1(1)`max', valuelabel angle(90)) legend(off) title("Majority Rule vs. L
> ab") subtitle("Sensitivity in Phenotype prediction")

.  format  MajorErrorRate lme ume VeryMajorErrorRate lvme uvme lsens usens lspec uspec sensitivity specificity Agreement num %4.3f
variable Agreement not found
r(111);

.  format  MajorErrorRate lme ume VeryMajorErrorRate lvme uvme lsens usens lspec uspec sensitivity specificity Accuracy num %4.3f

. 
. 
. 
. labmask num, values(site)
command labmask is unrecognized
r(199);

. 
. preserve

. 
. rename * maj_*

. 
. rename maj_site site

. 
. save majority, replace
file majority.dta saved

. 
. restore

. help labmask

. 
. labmask num, values(site)
command labmask is unrecognized
r(199);

. help labmask

. labmask num, values(site)

. 
. local max= _N

. 
. #delimit ;
Unknown #command

. 
. twoway rcap usens lsens num || scatter sens num,  xlabel(1(1)`max', valuelabel angle(90)) legend(off) title("Majority Rule vs. L
> ab") subtitle("Sensitivity in Phenotype prediction");
option ; not allowed
r(198);

. 
. #delimit cr
Unknown #command

. 
. graph save Graph "E:\users\amy.mason\Pipeline_27_07_2016\majority_sens_all.gph", replace
graph Graph not found
r(111);

. 
. graph export "E:\users\amy.mason\Pipeline_27_07_2016\majority_sens_all.tif", as(tif) replace
could not find Graph window
r(693);

. twoway rcap usens lsens num || scatter sens num,  xlabel(1(1)`max', valuelabel angle(90)) legend(off) title("Majority Rule vs. L
> ab") subtitle("Sensitivity in Phenotype prediction")

. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. do update_combo_method_sens.do

. ***************
. * consider the sensitivity and specificity of all three methods combined against lab results
. *run analysis_phenotypes first
. ****************
. 
. * upload lab data
. 
. cd E:\users\amy.mason\Pipeline\Amy_work
E:\users\amy.mason\Pipeline\Amy_work

. 
. use "E:\users\amy.mason\Pipeline\Amy_work\lab_compare_all_wide.dta", clear

. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. 
. 
. * get wetlab counts
. reshape long
(note: j = ciprofloxacin clindamycin erythromycin eta etb etd fusidicacid gentamicin meca mecc methicillin mupirocin penicillin pv
> l rifampicin sea seb sec sed see seg seh sei sej selr sep seu tetracycline trimethoprim tsst1 vancomycin)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1379   ->   42749
Number of variables                 126   ->       7
j variable (31 values)                    ->   site
xij variables:
goldstandardciprofloxacin goldstandardclindamycin ... goldstandardvancomycin->goldstandard
genefinderciprofloxacin genefinderclindamycin ... genefindervancomycin->genefinder
typewriterciprofloxacin typewriterclindamycin ... typewritervancomycin->typewriter
zamciprofloxacin zamclindamycin ... zamvancomycin->zam
-----------------------------------------------------------------------------

. 
. * add type to discriminate graphs at later stage
. gen type =""
(42,749 missing values generated)

. replace type ="Phenotype" if inlist(site, "ciprofloxacin", "fusidicacid", "clindamycin", "erythromycin")
variable type was str1 now str9
(5,516 real changes made)

. replace type ="Phenotype" if inlist(site, "gentamicin", "mupirocin", "penicillin","rifampicin")
(5,516 real changes made)

. replace type ="Phenotype" if inlist(site,"tetracycline", "trimethoprim", "vancomycin", "methicillin")
(5,516 real changes made)

. 
. keep if type!=""
(26,201 observations deleted)

. *keep if type==""
. 
. gen anti=(strlen(site)>5)

. 
. contract  anti site gold gene typew zam

. gen result = gene + typew + zam 

. 
. * note order is GENEFINDER THEN TYPEWRITER THEN MYKROBE
. drop gene typew zam

. replace result = "missing" if result==""
(0 real changes made)

. replace gold = "missing" if gold==""
(0 real changes made)

. 
. 
. reshape wide _freq, i(site gold) j(result) string
(note: j = RRR RRS RSR RSS SSR SSS)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      107   ->      44
Number of variables                   5   ->       9
j variable (6 values)            result   ->   (dropped)
xij variables:
                                  _freq   ->   _freqRRR _freqRRS ... _freqSSS
-----------------------------------------------------------------------------

. rename _freq* *

. 
. egen combor = rowtotal(RRR RSR)

. replace combor=0 if combor==.
(0 real changes made)

. egen combos= rowtotal(SSR SSS)

. replace combos=0 if combos==.
(0 real changes made)

. 
.  drop R* S*

.  
.  keep if inlist(gold, "R", "S")
(21 observations deleted)

.  
.  
.  reshape wide combo*, i(site) j(gold) string
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       23   ->      12
Number of variables                   5   ->       6
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------

.  
.  rename combo* *

. 
.  *** generate sensitivity and specificity
.  ***** NOTE: [ called GOLD] is format of these variables
. 
.  replace sS = 0 if sS==.
(0 real changes made)

.  replace rS = 0 if rS==.
(0 real changes made)

.  replace sR = 0 if sR==.
(1 real change made)

.  replace rR = 0 if rR==.
(1 real change made)

.    
. 
. for any lsens usens lspec uspec lme ume lvme uvme:gen X=.

->  gen lsens=.
(12 missing values generated)

->  gen usens=.
(12 missing values generated)

->  gen lspec=.
(12 missing values generated)

->  gen uspec=.
(12 missing values generated)

->  gen lme=.
(12 missing values generated)

->  gen ume=.
(12 missing values generated)

->  gen lvme=.
(12 missing values generated)

->  gen uvme=.
(12 missing values generated)

. 
. gen TP= rR

. gen FP = rS

. gen TN = sS

. gen FN = sR

. 
. gen POS = TP+FN

. gen NEG = TN+ FP

. gen specificity =TN/(TN+FP)

. gen sensitivity = TP/(TP+FN)
(1 missing value generated)

. gen MajorErrorRate = FP / (FP + TN)

. gen VeryMajorErrorRate = FN/(TP+FN)
(1 missing value generated)

. gen Accuracy = (TN + TP)/(TN+TP+FN+FP)

. 
. local max=_N

. forvalues i=1(1)`max'{
  2. di site[`i']
  3. cii prop NEG[`i'] TN[`i']
  4. replace lspec = r(lb) if _n==`i'
  5. replace uspec = r(ub) if _n==`i'
  6. cii prop POS[`i'] TP[`i']
  7. replace lsens = r(lb) if _n==`i'
  8. replace usens = r(ub) if _n==`i'
  9. cii prop NEG[`i'] FP[`i']
 10. replace lme = r(lb) if _n==`i'
 11. replace ume = r(ub) if _n==`i'
 12. cii prop POS[`i'] FN[`i']
 13. replace lvme = r(lb) if _n==`i'
 14. replace uvme = r(ub) if _n==`i'
 15. }
ciprofloxacin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,035    .9961353    .0019286        .9901345     .998946
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        316    .9525316    .0119618        .9229159    .9731923
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,035    .0038647    .0019286         .001054    .0098655
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        316    .0474684    .0119618        .0268077    .0770841
(1 real change made)
(1 real change made)
clindamycin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        279    .9139785    .0167869        .8747111    .9441066
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        185     .972973    .0119224         .938058    .9911674
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        279    .0860215    .0167869        .0558934    .1252889
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        185     .027027    .0119224        .0088326     .061942
(1 real change made)
(1 real change made)
erythromycin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,024    .9833984    .0039929         .973552       .9903
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        348    .9827586    .0069778        .9628523    .9936471
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,024    .0166016    .0039929           .0097     .026448
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        348    .0172414    .0069778        .0063529    .0371477
(1 real change made)
(1 real change made)
fusidicacid

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,211    .9933939    .0023279         .987025    .9971438
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        162    .9074074    .0227736        .8518829    .9472465
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,211    .0066061    .0023279        .0028562     .012975
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        162    .0925926    .0227736        .0527535    .1481171
(1 real change made)
(1 real change made)
gentamicin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,279    .9976544    .0013526        .9931607     .999516
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         94     .787234    .0422123        .6907065    .8649268
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,279    .0023456    .0013526         .000484    .0068393
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         94     .212766    .0422123        .1350732    .3092935
(1 real change made)
(1 real change made)
methicillin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        962    .9948025    .0023183        .9879127    .9983103
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        391    .9795396    .0071594        .9600844    .9911263
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        962    .0051975    .0023183        .0016897    .0120873
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        391    .0204604    .0071594        .0088737    .0399156
(1 real change made)
(1 real change made)
mupirocin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,015    .9921182    .0027756        .9845291    .9965912
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |          6           1           0        .5407419           1*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,015    .0078818    .0027756        .0034088    .0154709
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |          6           0           0               0    .4592581*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)
penicillin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        232    .8577586    .0229325         .806078    .9000219
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,137    .9903254    .0029029        .9827556    .9951609
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        232    .1422414    .0229325        .0999781     .193922
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,137    .0096746    .0029029        .0048391    .0172444
(1 real change made)
(1 real change made)
rifampicin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,347    .9992576    .0007421        .9958707    .9999812
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         25         .92    .0542586        .7396942    .9901604
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,347    .0007424    .0007421        .0000188    .0041293
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         25         .08    .0542586        .0098396    .2603058
(1 real change made)
(1 real change made)
tetracycline

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,254     .992823    .0023837        .9864197    .9967131
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        118    .9576271    .0185439        .9038842    .9861006
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,254     .007177    .0023837        .0032869    .0135803
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        118    .0423729    .0185439        .0138994    .0961158
(1 real change made)
(1 real change made)
trimethoprim

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        627    .9984051    .0015936        .9911461    .9999596
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         38    .8421053    .0591528        .6874664    .9397703
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        627    .0015949    .0015936        .0000404    .0088539
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         38    .1578947    .0591528        .0602297    .3125336
(1 real change made)
(1 real change made)
vancomycin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,373           1           0        .9973169           1*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)
first argument, #obs, must be a positive integer
r(198);

end of do-file

r(198);

. di site[_N]
vancomycin

. 
. cii prop NEG[`i'] TN[`i']
NEG not found
r(111);

. 
. replace lspec = r(lb) if _n==_N
(1 real change made, 1 to missing)

. 
. replace uspec = r(ub) if _n==_N
(1 real change made, 1 to missing)

. cii prop NEG[_N] TN[_N]

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,373           1           0        .9973169           1*

(*) one-sided, 97.5% confidence interval

. 
. replace lspec = r(lb) if _n==_N
(1 real change made)

. 
. replace uspec = r(ub) if _n==_N
(1 real change made)

. cii prop POS[_N] TP[_N]
first argument, #obs, must be a positive integer
r(198);

. 
. replace lsens = r(lb) if _n==`i'
invalid syntax
r(198);

. 
. replace usens = r(ub) if _n==`i'
invalid syntax
r(198);

. 
. cii prop NEG[_N] FP[_N]

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,373           0           0               0    .0026831*

(*) one-sided, 97.5% confidence interval

. 
. replace lme = r(lb) if _n==`i'
invalid syntax
r(198);

. 
. replace ume = r(ub) if _n==`i'
invalid syntax
r(198);

. cii prop POS[_N] TP[_N]
first argument, #obs, must be a positive integer
r(198);

. 
. replace lsens = r(lb) if _n==_N
(0 real changes made)

. 
. replace usens = r(ub) if _n==_N
(0 real changes made)

. 
. cii prop NEG[_N] FP[_N]

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,373           0           0               0    .0026831*

(*) one-sided, 97.5% confidence interval

. 
. replace lme = r(lb) if _n==_N
(1 real change made)

. 
. replace ume = r(ub) if _n==_N
(1 real change made)

. 
. cii prop POS[_N] FN[_N]
first argument, #obs, must be a positive integer
r(198);

. 
. replace lvme = r(lb) if _n==_N
(0 real changes made)

. 
. replace uvme = r(ub) if _n==_N
(0 real changes made)

. do update_combo_method_sens.do

. ***************
. * consider the sensitivity and specificity of all three methods combined against lab results
. *run analysis_phenotypes first
. ****************
. 
. * upload lab data
. 
. cd E:\users\amy.mason\Pipeline\Amy_work
E:\users\amy.mason\Pipeline\Amy_work

. 
. use "E:\users\amy.mason\Pipeline\Amy_work\lab_compare_all_wide.dta", clear

. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. 
. 
. * get wetlab counts
. reshape long
(note: j = ciprofloxacin clindamycin erythromycin eta etb etd fusidicacid gentamicin meca mecc methicillin mupirocin penicillin pv
> l rifampicin sea seb sec sed see seg seh sei sej selr sep seu tetracycline trimethoprim tsst1 vancomycin)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1379   ->   42749
Number of variables                 126   ->       7
j variable (31 values)                    ->   site
xij variables:
goldstandardciprofloxacin goldstandardclindamycin ... goldstandardvancomycin->goldstandard
genefinderciprofloxacin genefinderclindamycin ... genefindervancomycin->genefinder
typewriterciprofloxacin typewriterclindamycin ... typewritervancomycin->typewriter
zamciprofloxacin zamclindamycin ... zamvancomycin->zam
-----------------------------------------------------------------------------

. 
. * add type to discriminate graphs at later stage
. gen type =""
(42,749 missing values generated)

. replace type ="Phenotype" if inlist(site, "ciprofloxacin", "fusidicacid", "clindamycin", "erythromycin")
variable type was str1 now str9
(5,516 real changes made)

. replace type ="Phenotype" if inlist(site, "gentamicin", "mupirocin", "penicillin","rifampicin")
(5,516 real changes made)

. replace type ="Phenotype" if inlist(site,"tetracycline", "trimethoprim", "vancomycin", "methicillin")
(5,516 real changes made)

. 
. keep if type!=""
(26,201 observations deleted)

. *keep if type==""
. 
. gen anti=(strlen(site)>5)

. 
. contract  anti site gold gene typew zam

. gen result = gene + typew + zam 

. 
. * note order is GENEFINDER THEN TYPEWRITER THEN MYKROBE
. drop gene typew zam

. replace result = "missing" if result==""
(0 real changes made)

. replace gold = "missing" if gold==""
(0 real changes made)

. 
. 
. reshape wide _freq, i(site gold) j(result) string
(note: j = RRR RRS RSR RSS SSR SSS)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      107   ->      44
Number of variables                   5   ->       9
j variable (6 values)            result   ->   (dropped)
xij variables:
                                  _freq   ->   _freqRRR _freqRRS ... _freqSSS
-----------------------------------------------------------------------------

. rename _freq* *

. 
. egen combor = rowtotal(RRR RSR)

. replace combor=0 if combor==.
(0 real changes made)

. egen combos= rowtotal(SSR SSS)

. replace combos=0 if combos==.
(0 real changes made)

. 
.  drop R* S*

.  
.  keep if inlist(gold, "R", "S")
(21 observations deleted)

.  
.  
.  reshape wide combo*, i(site) j(gold) string
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       23   ->      12
Number of variables                   5   ->       6
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------

.  
.  rename combo* *

. 
.  *** generate sensitivity and specificity
.  ***** NOTE: [ called GOLD] is format of these variables
. 
.  replace sS = 0 if sS==.
(0 real changes made)

.  replace rS = 0 if rS==.
(0 real changes made)

.  replace sR = 0 if sR==.
(1 real change made)

.  replace rR = 0 if rR==.
(1 real change made)

.    
. 
. for any lsens usens lspec uspec lme ume lvme uvme:gen X=.

->  gen lsens=.
(12 missing values generated)

->  gen usens=.
(12 missing values generated)

->  gen lspec=.
(12 missing values generated)

->  gen uspec=.
(12 missing values generated)

->  gen lme=.
(12 missing values generated)

->  gen ume=.
(12 missing values generated)

->  gen lvme=.
(12 missing values generated)

->  gen uvme=.
(12 missing values generated)

. 
. gen TP= rR

. gen FP = rS

. gen TN = sS

. gen FN = sR

. 
. gen POS = TP+FN

. gen NEG = TN+ FP

. gen specificity =TN/(TN+FP)

. gen sensitivity = TP/(TP+FN)
(1 missing value generated)

. gen MajorErrorRate = FP / (FP + TN)

. gen VeryMajorErrorRate = FN/(TP+FN)
(1 missing value generated)

. gen Accuracy = (TN + TP)/(TN+TP+FN+FP)

. 
. local max=_N-1

. forvalues i=1(1)`max'{
  2. di site[`i']
  3. cii prop NEG[`i'] TN[`i']
  4. replace lspec = r(lb) if _n==`i'
  5. replace uspec = r(ub) if _n==`i'
  6. cii prop POS[`i'] TP[`i']
  7. replace lsens = r(lb) if _n==`i'
  8. replace usens = r(ub) if _n==`i'
  9. cii prop NEG[`i'] FP[`i']
 10. replace lme = r(lb) if _n==`i'
 11. replace ume = r(ub) if _n==`i'
 12. cii prop POS[`i'] FN[`i']
 13. replace lvme = r(lb) if _n==`i'
 14. replace uvme = r(ub) if _n==`i'
 15. }
ciprofloxacin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,035    .9961353    .0019286        .9901345     .998946
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        316    .9525316    .0119618        .9229159    .9731923
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,035    .0038647    .0019286         .001054    .0098655
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        316    .0474684    .0119618        .0268077    .0770841
(1 real change made)
(1 real change made)
clindamycin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        279    .9139785    .0167869        .8747111    .9441066
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        185     .972973    .0119224         .938058    .9911674
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        279    .0860215    .0167869        .0558934    .1252889
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        185     .027027    .0119224        .0088326     .061942
(1 real change made)
(1 real change made)
erythromycin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,024    .9833984    .0039929         .973552       .9903
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        348    .9827586    .0069778        .9628523    .9936471
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,024    .0166016    .0039929           .0097     .026448
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        348    .0172414    .0069778        .0063529    .0371477
(1 real change made)
(1 real change made)
fusidicacid

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,211    .9933939    .0023279         .987025    .9971438
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        162    .9074074    .0227736        .8518829    .9472465
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,211    .0066061    .0023279        .0028562     .012975
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        162    .0925926    .0227736        .0527535    .1481171
(1 real change made)
(1 real change made)
gentamicin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,279    .9976544    .0013526        .9931607     .999516
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         94     .787234    .0422123        .6907065    .8649268
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,279    .0023456    .0013526         .000484    .0068393
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         94     .212766    .0422123        .1350732    .3092935
(1 real change made)
(1 real change made)
methicillin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        962    .9948025    .0023183        .9879127    .9983103
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        391    .9795396    .0071594        .9600844    .9911263
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        962    .0051975    .0023183        .0016897    .0120873
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        391    .0204604    .0071594        .0088737    .0399156
(1 real change made)
(1 real change made)
mupirocin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,015    .9921182    .0027756        .9845291    .9965912
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |          6           1           0        .5407419           1*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,015    .0078818    .0027756        .0034088    .0154709
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |          6           0           0               0    .4592581*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)
penicillin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        232    .8577586    .0229325         .806078    .9000219
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,137    .9903254    .0029029        .9827556    .9951609
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        232    .1422414    .0229325        .0999781     .193922
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,137    .0096746    .0029029        .0048391    .0172444
(1 real change made)
(1 real change made)
rifampicin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,347    .9992576    .0007421        .9958707    .9999812
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         25         .92    .0542586        .7396942    .9901604
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,347    .0007424    .0007421        .0000188    .0041293
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         25         .08    .0542586        .0098396    .2603058
(1 real change made)
(1 real change made)
tetracycline

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,254     .992823    .0023837        .9864197    .9967131
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        118    .9576271    .0185439        .9038842    .9861006
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,254     .007177    .0023837        .0032869    .0135803
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        118    .0423729    .0185439        .0138994    .0961158
(1 real change made)
(1 real change made)
trimethoprim

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        627    .9984051    .0015936        .9911461    .9999596
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         38    .8421053    .0591528        .6874664    .9397703
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        627    .0015949    .0015936        .0000404    .0088539
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         38    .1578947    .0591528        .0602297    .3125336
(1 real change made)
(1 real change made)

. 
. di site[_N]
vancomycin

. cii prop NEG[_N] TN[_N]

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,373           1           0        .9973169           1*

(*) one-sided, 97.5% confidence interval

. replace lspec = r(lb) if _n==_N
(1 real change made)

. replace uspec = r(ub) if _n==_N
(1 real change made)

. cii prop POS[_N] TP[_N]
first argument, #obs, must be a positive integer
r(198);

end of do-file

r(198);

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. set more off

. do update_combo_method_sens.do

. ***************
. * consider the sensitivity and specificity of all three methods combined against lab results
. *run analysis_phenotypes first
. ****************
. 
. * upload lab data
. 
. cd E:\users\amy.mason\Pipeline\Amy_work
E:\users\amy.mason\Pipeline\Amy_work

. 
. use "E:\users\amy.mason\Pipeline\Amy_work\lab_compare_all_wide.dta", clear

. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. 
. 
. * get wetlab counts
. reshape long
(note: j = ciprofloxacin clindamycin erythromycin eta etb etd fusidicacid gentamicin meca mecc methicillin mupirocin penicillin pv
> l rifampicin sea seb sec sed see seg seh sei sej selr sep seu tetracycline trimethoprim tsst1 vancomycin)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1379   ->   42749
Number of variables                 126   ->       7
j variable (31 values)                    ->   site
xij variables:
goldstandardciprofloxacin goldstandardclindamycin ... goldstandardvancomycin->goldstandard
genefinderciprofloxacin genefinderclindamycin ... genefindervancomycin->genefinder
typewriterciprofloxacin typewriterclindamycin ... typewritervancomycin->typewriter
zamciprofloxacin zamclindamycin ... zamvancomycin->zam
-----------------------------------------------------------------------------

. 
. * add type to discriminate graphs at later stage
. gen type =""
(42,749 missing values generated)

. replace type ="Phenotype" if inlist(site, "ciprofloxacin", "fusidicacid", "clindamycin", "erythromycin")
variable type was str1 now str9
(5,516 real changes made)

. replace type ="Phenotype" if inlist(site, "gentamicin", "mupirocin", "penicillin","rifampicin")
(5,516 real changes made)

. replace type ="Phenotype" if inlist(site,"tetracycline", "trimethoprim", "vancomycin", "methicillin")
(5,516 real changes made)

. 
. keep if type!=""
(26,201 observations deleted)

. *keep if type==""
. 
. gen anti=(strlen(site)>5)

. 
. contract  anti site gold gene typew zam

. gen result = gene + typew + zam 

. 
. * note order is GENEFINDER THEN TYPEWRITER THEN MYKROBE
. drop gene typew zam

. replace result = "missing" if result==""
(0 real changes made)

. replace gold = "missing" if gold==""
(0 real changes made)

. 
. 
. reshape wide _freq, i(site gold) j(result) string
(note: j = RRR RRS RSR RSS SSR SSS)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      107   ->      44
Number of variables                   5   ->       9
j variable (6 values)            result   ->   (dropped)
xij variables:
                                  _freq   ->   _freqRRR _freqRRS ... _freqSSS
-----------------------------------------------------------------------------

. rename _freq* *

. 
. egen combor = rowtotal(RRR RSR)

. replace combor=0 if combor==.
(0 real changes made)

. egen combos= rowtotal(SSR SSS)

. replace combos=0 if combos==.
(0 real changes made)

. 
.  drop R* S*

.  
.  keep if inlist(gold, "R", "S")
(21 observations deleted)

.  
.  
.  reshape wide combo*, i(site) j(gold) string
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       23   ->      12
Number of variables                   5   ->       6
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------

.  
.  rename combo* *

. 
.  *** generate sensitivity and specificity
.  ***** NOTE: [ called GOLD] is format of these variables
. 
.  replace sS = 0 if sS==.
(0 real changes made)

.  replace rS = 0 if rS==.
(0 real changes made)

.  replace sR = 0 if sR==.
(1 real change made)

.  replace rR = 0 if rR==.
(1 real change made)

.    
. 
. for any lsens usens lspec uspec lme ume lvme uvme:gen X=.

->  gen lsens=.
(12 missing values generated)

->  gen usens=.
(12 missing values generated)

->  gen lspec=.
(12 missing values generated)

->  gen uspec=.
(12 missing values generated)

->  gen lme=.
(12 missing values generated)

->  gen ume=.
(12 missing values generated)

->  gen lvme=.
(12 missing values generated)

->  gen uvme=.
(12 missing values generated)

. 
. gen TP= rR

. gen FP = rS

. gen TN = sS

. gen FN = sR

. 
. gen POS = TP+FN

. gen NEG = TN+ FP

. gen specificity =TN/(TN+FP)

. gen sensitivity = TP/(TP+FN)
(1 missing value generated)

. gen MajorErrorRate = FP / (FP + TN)

. gen VeryMajorErrorRate = FN/(TP+FN)
(1 missing value generated)

. gen Accuracy = (TN + TP)/(TN+TP+FN+FP)

. 
. local max=_N-1

. forvalues i=1(1)`max'{
  2. di site[`i']
  3. cii prop NEG[`i'] TN[`i']
  4. replace lspec = r(lb) if _n==`i'
  5. replace uspec = r(ub) if _n==`i'
  6. cii prop POS[`i'] TP[`i']
  7. replace lsens = r(lb) if _n==`i'
  8. replace usens = r(ub) if _n==`i'
  9. cii prop NEG[`i'] FP[`i']
 10. replace lme = r(lb) if _n==`i'
 11. replace ume = r(ub) if _n==`i'
 12. cii prop POS[`i'] FN[`i']
 13. replace lvme = r(lb) if _n==`i'
 14. replace uvme = r(ub) if _n==`i'
 15. }
ciprofloxacin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,035    .9961353    .0019286        .9901345     .998946
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        316    .9525316    .0119618        .9229159    .9731923
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,035    .0038647    .0019286         .001054    .0098655
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        316    .0474684    .0119618        .0268077    .0770841
(1 real change made)
(1 real change made)
clindamycin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        279    .9139785    .0167869        .8747111    .9441066
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        185     .972973    .0119224         .938058    .9911674
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        279    .0860215    .0167869        .0558934    .1252889
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        185     .027027    .0119224        .0088326     .061942
(1 real change made)
(1 real change made)
erythromycin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,024    .9833984    .0039929         .973552       .9903
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        348    .9827586    .0069778        .9628523    .9936471
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,024    .0166016    .0039929           .0097     .026448
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        348    .0172414    .0069778        .0063529    .0371477
(1 real change made)
(1 real change made)
fusidicacid

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,211    .9933939    .0023279         .987025    .9971438
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        162    .9074074    .0227736        .8518829    .9472465
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,211    .0066061    .0023279        .0028562     .012975
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        162    .0925926    .0227736        .0527535    .1481171
(1 real change made)
(1 real change made)
gentamicin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,279    .9976544    .0013526        .9931607     .999516
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         94     .787234    .0422123        .6907065    .8649268
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,279    .0023456    .0013526         .000484    .0068393
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         94     .212766    .0422123        .1350732    .3092935
(1 real change made)
(1 real change made)
methicillin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        962    .9948025    .0023183        .9879127    .9983103
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        391    .9795396    .0071594        .9600844    .9911263
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        962    .0051975    .0023183        .0016897    .0120873
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        391    .0204604    .0071594        .0088737    .0399156
(1 real change made)
(1 real change made)
mupirocin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,015    .9921182    .0027756        .9845291    .9965912
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |          6           1           0        .5407419           1*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,015    .0078818    .0027756        .0034088    .0154709
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |          6           0           0               0    .4592581*

(*) one-sided, 97.5% confidence interval
(1 real change made)
(1 real change made)
penicillin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        232    .8577586    .0229325         .806078    .9000219
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,137    .9903254    .0029029        .9827556    .9951609
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        232    .1422414    .0229325        .0999781     .193922
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,137    .0096746    .0029029        .0048391    .0172444
(1 real change made)
(1 real change made)
rifampicin

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,347    .9992576    .0007421        .9958707    .9999812
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         25         .92    .0542586        .7396942    .9901604
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,347    .0007424    .0007421        .0000188    .0041293
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         25         .08    .0542586        .0098396    .2603058
(1 real change made)
(1 real change made)
tetracycline

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,254     .992823    .0023837        .9864197    .9967131
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        118    .9576271    .0185439        .9038842    .9861006
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,254     .007177    .0023837        .0032869    .0135803
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        118    .0423729    .0185439        .0138994    .0961158
(1 real change made)
(1 real change made)
trimethoprim

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        627    .9984051    .0015936        .9911461    .9999596
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         38    .8421053    .0591528        .6874664    .9397703
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        627    .0015949    .0015936        .0000404    .0088539
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |         38    .1578947    .0591528        .0602297    .3125336
(1 real change made)
(1 real change made)

. 
. * vancomycin has no
. di site[_N]
vancomycin

. cii prop NEG[_N] TN[_N]

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,373           1           0        .9973169           1*

(*) one-sided, 97.5% confidence interval

. replace lspec = r(lb) if _n==_N
(1 real change made)

. replace uspec = r(ub) if _n==_N
(1 real change made)

. 
. cii prop NEG[_N] FP[_N]

                                                         -- Binomial Exact --
    Variable |        Obs  Proportion    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |      1,373           0           0               0    .0026831*

(*) one-sided, 97.5% confidence interval

. replace lme = r(lb) if _n==_N
(1 real change made)

. replace ume = r(ub) if _n==_N
(1 real change made)

. 
. 
. sort site

.  gen num =_n 

. 
.  order site  Major lme ume Very lvme uvme sS sR rS rR

.  format  MajorErrorRate lme ume VeryMajorErrorRate lvme uvme lsens usens lspec uspec sensitivity specificity Accuracy num %4.3f

. 
. 
. 
. labmask num, values(site)

. preserve

. rename * maj_*

. rename maj_site site

. save majority, replace
file majority.dta saved

. restore

. 
. local max= _N

. #delimit ;
delimiter now ;
. twoway rcap usens lsens num || scatter sens num,  xlabel(1(1)`max', valuelabel angle(90))
> legend(off) title("Majority Rule vs. Lab") 
> subtitle("Sensitivity in Phenotype prediction");

. #delimit cr
delimiter now cr
. graph save Graph "E:\users\amy.mason\Pipeline_27_07_2016\majority_sens_all.gph", replace
(file E:\users\amy.mason\Pipeline_27_07_2016\majority_sens_all.gph saved)

. graph export "E:\users\amy.mason\Pipeline_27_07_2016\majority_sens_all.tif", as(tif) replace
(file E:\users\amy.mason\Pipeline_27_07_2016\majority_sens_all.tif written in TIFF format)

. 
. 
. local max= _N

. #delimit ;
delimiter now ;
. twoway rcap lspec uspec num || scatter spec num,   xlabel(1(1)`max', valuelabel angle(90)) 
> legend(off) title("Majority Rule vs. Lab") 
> subtitle("Specifitity in Phenotype prediction")
> xtitle("Gene site");

. #delimit cr
delimiter now cr
. 
. graph save Graph "E:\users\amy.mason\Pipeline_27_07_2016\majority_spec_all.gph", replace
(note: file E:\users\amy.mason\Pipeline_27_07_2016\majority_spec_all.gph not found)
(file E:\users\amy.mason\Pipeline_27_07_2016\majority_spec_all.gph saved)

. graph export "E:\users\amy.mason\Pipeline_27_07_2016\majority_spec_all.tif", as(tif) replace
(note: file E:\users\amy.mason\Pipeline_27_07_2016\majority_spec_all.tif not found)
(file E:\users\amy.mason\Pipeline_27_07_2016\majority_spec_all.tif written in TIFF format)

. 
. 
. 
. 
. collapse (sum) sS sR rS rR, by(anti)

. 
. for any lsens usens lspec uspec lme ume lvme uvme:gen X=.

->  gen lsens=.
(1 missing value generated)

->  gen usens=.
(1 missing value generated)

->  gen lspec=.
(1 missing value generated)

->  gen uspec=.
(1 missing value generated)

->  gen lme=.
(1 missing value generated)

->  gen ume=.
(1 missing value generated)

->  gen lvme=.
(1 missing value generated)

->  gen uvme=.
(1 missing value generated)

. 
. 
. gen cPOS = sS+sR

. gen cNEG = rR +rS

. gen specificity =sS/cPOS

. gen sensitivity = rR/cNEG

. gen truNeg= rR+sR

. gen truPos= sS+ rS

. gen MajorErrorRate = rS/truPos

. gen VeryMajorErrorRate = sR/truNeg

. gen Agreement = (sS+rR)/(truNeg+truPos)

. 
. local max=_N

. forvalues i=1(1)`max'{
  2. cii  cPOS[`i'] sS[`i']
  3. replace lspec = r(lb) if _n==`i'
  4. replace uspec = r(ub) if _n==`i'
  5. cii  cNEG[`i'] rR[`i']
  6. replace lsens = r(lb) if _n==`i'
  7. replace usens = r(ub) if _n==`i'
  8. cii  truPos[`i'] rS[`i']
  9. replace lme = r(lb) if _n==`i'
 10. replace ume = r(ub) if _n==`i'
 11. cii  truNeg[`i'] sR[`i']
 12. replace lvme = r(lb) if _n==`i'
 13. replace uvme = r(ub) if _n==`i'
 14. }
you must specify one of means, proportions, or variances following cii
r(198);

end of do-file

r(198);

. sysdir set PERSONAL "E:\users\amy.mason\ADO"

. 
. sysdir set STBPLUS  "E:\users\amy.mason\ADO\stbplus"

. 
. sysdir set OLDPLACE "E:\users\amy.mason\ADO\oldplace"

. 
. set logtype text

. 
. 
. 
. *******************

. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. 
. 
. 
. set more off

. 
. * data input

. 
. run inputs.do
