----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\me-filer1\home$\am2609\My Documents\MMM work\Programs\Pipeline\comments.log
  log type:  text
 opened on:   3 Apr 2018, 19:08:02

. noi di "Run by AMM on $S_DATE $S_TIME"
Run by AMM on  3 Apr 2018 19:08:02

. cd "\\me-filer1\home$\am2609\My Documents\MMM work\Programs\Pipeline\Datasets"
\\me-filer1\home$\am2609\My Documents\MMM work\Programs\Pipeline\Datasets

. 
. 
. use anti_panel_all, clear

. 
. ******************************************************
. noi di _n(5) _dup(80) "=" _n " 1 prediction panel" _n _dup(80) "="





================================================================================
 1 prediction panel
================================================================================

. ********************************************************
. 
. *antibiotics
. use anti_panel_all, clear

. 
. gen all_value = valueg + valuez + valuet+ ": "+gold

. replace all_value=valueg + ": "+gold if valueg==valuez & valuez==valuet
(16477 real changes made)

. keep sample site set all

. reshape wide all_value, i(sample set) j(site) string
(note: j = ciprofloxacin clindamycin erythromycin fusidicacid gentamicin methicillin mupirocin penicillin rifampicin tetracycline 
> trimethoprim vancomycin)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    16548   ->    1379
Number of variables                   4   ->      14
j variable (12 values)             site   ->   (dropped)
xij variables:
                              all_value   ->   all_valueciprofloxacin all_valueclindamycin ... all_valuevancomycin
-----------------------------------------------------------------------------

. rename all_value* *

. 
. save predictions, replace
file predictions.dta saved

. 
. * virulence
. 
. use viru_panel_all, clear

. 
. gen all_value = valueg + valuez + valuet+ ": "+gold

. replace all_value=valueg+ ": "+gold if valueg==valuez & valuez==valuet
(26038 real changes made)

. keep sample site set all

. reshape wide all_value, i(sample set) j(site) string
(note: j = eta etb etd meca mecc pvl sea seb sec sed see seg seh sei sej selr sep seu tsst1)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    26201   ->    1379
Number of variables                   4   ->      21
j variable (19 values)             site   ->   (dropped)
xij variables:
                              all_value   ->   all_valueeta all_valueetb ... all_valuetsst1
-----------------------------------------------------------------------------

. rename all_value* *

. 
. merge 1:1 sample using predictions, update

    Result                           # of obs.
    -----------------------------------------
    not matched                             0

    matched                             1,379
        not updated                     1,379  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. assert _merge==3

. drop _merge

. 
. * export
. export excel using "\\me-filer1\home$\am2609\My Documents\MMM work\Programs\Pipeline\Comments\Predictions.xls", sheet("Predictio
> ns") firstrow(variables) sheetreplace
file \\me-filer1\home$\am2609\My Documents\MMM work\Programs\Pipeline\Comments\Predictions.xls saved

. 
. 
. ******************************************************
. noi di _n(5) _dup(80) "=" _n "PHE discrenpencies significant" _n _dup(80) "="





================================================================================
PHE discrenpencies significant
================================================================================

. ********************************************************
. 
. cd "\\me-filer1\home$\am2609\My Documents\MMM work\Programs\Pipeline\Datasets"
\\me-filer1\home$\am2609\My Documents\MMM work\Programs\Pipeline\Datasets

. use pipeline_clean_all_values_wide, clear

. 
. noi di "comparision between methods"
comparision between methods

. noi di  "Recall order is  Genefiner Mykrobe Typewriter"
Recall order is  Genefiner Mykrobe Typewriter

. 
. gen agree  = (ValueA=="AAA"| ValueA=="PPP" )

. 
. *which set  have the most discrenpacies
. noi di "site discrenpacies by set"
site discrenpacies by set

. noi tab set agree, chi2 expected

+--------------------+
| Key                |
|--------------------|
|     frequency      |
| expected frequency |
+--------------------+

           |         agree
       set |         0          1 |     Total
-----------+----------------------+----------
Collindale |       349     32,187 |    32,536 
           |     178.2   32,357.8 |  32,536.0 
-----------+----------------------+----------
 Oxford491 |        45     40,293 |    40,338 
           |     221.0   40,117.0 |  40,338.0 
-----------+----------------------+----------
 Oxford501 |       233     41,350 |    41,583 
           |     227.8   41,355.2 |  41,583.0 
-----------+----------------------+----------
     Total |       627    113,830 |   114,457 
           |     627.0  113,830.0 | 114,457.0 

          Pearson chi2(2) = 305.5423   Pr = 0.000

. 
. 
. 
. * what is the minority method by site
. 
. gen minority= "GeneFinder" if agree!=1 &  valuet==valuez
(114276 missing values generated)

. replace minority= "Mykrobe" if agree!=1 &  valueg==valuet
(183 real changes made)

. replace minority= "Typewriter" if agree!=1 &  valueg==valuez
(263 real changes made)

. 
. noi di "minority opinion by set, expected values included"
minority opinion by set, expected values included

. tab minority set, chi expected

+--------------------+
| Key                |
|--------------------|
|     frequency      |
| expected frequency |
+--------------------+

           |               set
  minority | Collind..  Oxford491  Oxford501 |     Total
-----------+---------------------------------+----------
GeneFinder |       141         22         18 |       181 
           |     100.7       13.0       67.3 |     181.0 
-----------+---------------------------------+----------
   Mykrobe |       130         10         43 |       183 
           |     101.9       13.1       68.0 |     183.0 
-----------+---------------------------------+----------
Typewriter |        78         13        172 |       263 
           |     146.4       18.9       97.7 |     263.0 
-----------+---------------------------------+----------
     Total |       349         45        233 |       627 
           |     349.0       45.0      233.0 |     627.0 

          Pearson chi2(4) = 166.3378   Pr = 0.000

. 
. 
. *which set and type  have the most discrenpacies
. noi di "site discrenpacies by set and type"
site discrenpacies by set and type

. gen new = set + type

. noi tab new minority, expected chi

+--------------------+
| Key                |
|--------------------|
|     frequency      |
| expected frequency |
+--------------------+

                      |             minority
                  new | GeneFin..    Mykrobe  Typewri.. |     Total
----------------------+---------------------------------+----------
CollindaleAquired R.. |        79         64         18 |       161 
                      |      46.5       47.0       67.5 |     161.0 
----------------------+---------------------------------+----------
CollindaleChromosom.. |         0          3          0 |         3 
                      |       0.9        0.9        1.3 |       3.0 
----------------------+---------------------------------+----------
        Collindaleccr |        33         44          6 |        83 
                      |      24.0       24.2       34.8 |      83.0 
----------------------+---------------------------------+----------
  Collindalevirulence |        29         19         54 |       102 
                      |      29.4       29.8       42.8 |     102.0 
----------------------+---------------------------------+----------
Oxford491Aquired Re.. |         9          4          6 |        19 
                      |       5.5        5.5        8.0 |      19.0 
----------------------+---------------------------------+----------
Oxford491Chromosoma.. |         0          1          0 |         1 
                      |       0.3        0.3        0.4 |       1.0 
----------------------+---------------------------------+----------
         Oxford491ccr |        10          0          0 |        10 
                      |       2.9        2.9        4.2 |      10.0 
----------------------+---------------------------------+----------
   Oxford491virulence |         3          5          7 |        15 
                      |       4.3        4.4        6.3 |      15.0 
----------------------+---------------------------------+----------
Oxford501Aquired Re.. |         1         26         14 |        41 
                      |      11.8       12.0       17.2 |      41.0 
----------------------+---------------------------------+----------
Oxford501Chromosoma.. |         0          2          2 |         4 
                      |       1.2        1.2        1.7 |       4.0 
----------------------+---------------------------------+----------
         Oxford501ccr |         4          5         21 |        30 
                      |       8.7        8.8       12.6 |      30.0 
----------------------+---------------------------------+----------
   Oxford501virulence |        13         10        135 |       158 
                      |      45.6       46.1       66.3 |     158.0 
----------------------+---------------------------------+----------
                Total |       181        183        263 |       627 
                      |     181.0      183.0      263.0 |     627.0 

         Pearson chi2(22) = 314.9822   Pr = 0.000

. 
. 
. noi di "method disagreeing with lab"
method disagreeing with lab

. 
. use anti_panel_all, clear

. append using viru_panel_all, gen(new)
(label _merge already defined)

. 
. * reshape wide
. drop _merge new valueall method

. reshape long value, i (sample site set gold) j(method) string
(note: j = genefinder typewriter zam)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    42749   ->  128247
Number of variables                   7   ->       6
j variable (3 values)                     ->   method
xij variables:
valuegenefinder valuetypewriter valuezam  ->   value
-----------------------------------------------------------------------------

. replace value=upper(value)
(128247 real changes made)

. 
. drop if gold=="NA"
(72270 observations deleted)

. drop if gold=="I"
(240 observations deleted)

. gen match=1 if gold==value
(976 missing values generated)

. replace match=0 if match==.
(976 real changes made)

. tab set method if match!=1, chi

           |              method
       set | genefin..  typewri..        zam |     Total
-----------+---------------------------------+----------
Collindale |       226        215        240 |       681 
 Oxford491 |        58         58         59 |       175 
 Oxford501 |        37         35         48 |       120 
-----------+---------------------------------+----------
     Total |       321        308        347 |       976 

          Pearson chi2(4) =   1.3851   Pr = 0.847

. 
. 
. ******************************************************
. noi di _n(5) _dup(80) "=" _n "Oxford validation/ training sets" _n _dup(80) "="





================================================================================
Oxford validation/ training sets
================================================================================

. ********************************************************
. 
. * t-tests of matches in two Oxford sets
. ttest match if method=="zam" & set!="Collindale", by(set)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Oxford49 |    5135    .9885102    .0014874    .1065832    .9855943    .9914261
Oxford50 |    5010    .9904192    .0013764    .0974215    .9877209    .9931175
---------+--------------------------------------------------------------------
combined |   10145    .9894529    .0010143    .1021609    .9874647    .9914411
---------+--------------------------------------------------------------------
    diff |           -.0019089    .0020287               -.0058856    .0020678
------------------------------------------------------------------------------
    diff = mean(Oxford49) - mean(Oxford50)                        t =  -0.9410
Ho: diff = 0                                     degrees of freedom =    10143

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1734         Pr(|T| > |t|) = 0.3468          Pr(T > t) = 0.8266

. ttest match if method=="genefinder" & set!="Collindale", by(set)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Oxford49 |    5135     .988705    .0014749    .1056865    .9858136    .9915963
Oxford50 |    5010    .9926148    .0012098     .085628    .9902431    .9949864
---------+--------------------------------------------------------------------
combined |   10145    .9906358    .0009563    .0963195    .9887613    .9925103
---------+--------------------------------------------------------------------
    diff |           -.0039098    .0019124               -.0076585   -.0001611
------------------------------------------------------------------------------
    diff = mean(Oxford49) - mean(Oxford50)                        t =  -2.0444
Ho: diff = 0                                     degrees of freedom =    10143

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0205         Pr(|T| > |t|) = 0.0409          Pr(T > t) = 0.9795

. ttest match if method=="typewriter" & set!="Collindale", by(set)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Oxford49 |    5135     .988705    .0014749    .1056865    .9858136    .9915963
Oxford50 |    5010     .993014    .0011768    .0832983    .9907069    .9953211
---------+--------------------------------------------------------------------
combined |   10145    .9908329    .0009463    .0953097    .9889781    .9926878
---------+--------------------------------------------------------------------
    diff |            -.004309    .0018923               -.0080182   -.0005998
------------------------------------------------------------------------------
    diff = mean(Oxford49) - mean(Oxford50)                        t =  -2.2772
Ho: diff = 0                                     degrees of freedom =    10143

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0114         Pr(|T| > |t|) = 0.0228          Pr(T > t) = 0.9886

. 
. 
. * sens and spec for each set individually
. 
. 
. noi di "Collindale"
Collindale

. tempfile temp

.         use anti_panel_all, clear

.         assert site!=""

.         assert _N==16548

.         keep if set=="Collindale"
(11844 observations deleted)

. * restrict to clear goldstandard values
.         gen clear=inlist(gold, "R", "S")

.         summ clear

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       clear |      4704    .9181548    .2741579          0          1

.         noi di r(sum) " results are R/S"
4319 results are R/S

.         drop if clear!=1
(385 observations deleted)

.         contract  gold valuegene

.         rename value predict

.         assert predict!=""

. * reshape
.         reshape wide _freq, i( gold) j(predict) string
(note: j = r s)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        4   ->       2
Number of variables                   3   ->       3
j variable (2 values)           predict   ->   (dropped)
xij variables:
                                  _freq   ->   _freqr _freqs
-----------------------------------------------------------------------------

.         rename _freq* *

.         rename r combor

.         rename s combos

.         gen method = "valuegene"

.         reshape wide combo*, i(method) j(gold) string
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        2   ->       1
Number of variables                   4   ->       5
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------

.         rename combo* *

. 
.         * remember : resistance = postive result
.         rename sS TN

.         rename rR TP

.         rename sR FN 

.         *so predicted sensitive but actually resistant
.         rename rS FP 

.         * predicted resistant but actually sensitive
.         gen set="Collindale"

. save temp, replace
file temp.dta saved

.         
. foreach k in valuetype valuez{
  2.         use anti_panel_all, clear
  3.         assert site!=""
  4.         assert _N==16548
  5.                 keep if set=="Collindale"
  6. * restrict to clear goldstandard values
.         gen clear=inlist(gold, "R", "S")
  7.         summ clear
  8.         noi di r(sum) " results are R/S"
  9.         drop if clear!=1
 10.         contract  gold `k'
 11.         rename value predict
 12.         assert predict!=""
 13. * reshape
.         reshape wide _freq, i( gold) j(predict) string
 14.         rename _freq* *
 15.         rename r combor
 16.         rename s combos
 17.         gen method = "`k'"
 18.         reshape wide combo*, i(method) j(gold) string
 19.         rename combo* *
 20. 
.         * remember : resistance = postive result
.         rename sS TN
 21.         rename rR TP
 22.         rename sR FN 
 23.         *so predicted sensitive but actually resistant
.         rename rS FP 
 24.         * predicted resistant but actually sensitive
.         gen set="Collindale"
 25.         append using temp
 26.         save temp, replace
 27. }
(11844 observations deleted)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       clear |      4704    .9181548    .2741579          0          1
4319 results are R/S
(385 observations deleted)
(note: j = r s)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        4   ->       2
Number of variables                   3   ->       3
j variable (2 values)           predict   ->   (dropped)
xij variables:
                                  _freq   ->   _freqr _freqs
-----------------------------------------------------------------------------
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        2   ->       1
Number of variables                   4   ->       5
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------
file temp.dta saved
(11844 observations deleted)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       clear |      4704    .9181548    .2741579          0          1
4319 results are R/S
(385 observations deleted)
(note: j = r s)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        4   ->       2
Number of variables                   3   ->       3
j variable (2 values)           predict   ->   (dropped)
xij variables:
                                  _freq   ->   _freqr _freqs
-----------------------------------------------------------------------------
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        2   ->       1
Number of variables                   4   ->       5
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------
(note: variable method was str6, now str9 to accommodate using data's values)
file temp.dta saved

. 
. noi di "Oxford 491"
Oxford 491

.         foreach k in valuetype valuez valuegene{
  2.         use anti_panel_all, clear
  3.         assert site!=""
  4.         assert _N==16548
  5.                 keep if set=="Oxford491"
  6. * restrict to clear goldstandard values
.         gen clear=inlist(gold, "R", "S")
  7.         summ clear
  8.         noi di r(sum) " results are R/S"
  9.         drop if clear!=1
 10.         contract  gold `k'
 11.         rename value predict
 12.         assert predict!=""
 13. * reshape
.         reshape wide _freq, i( gold) j(predict) string
 14.         rename _freq* *
 15.         rename r combor
 16.         rename s combos
 17.         gen method = "`k'"
 18.         reshape wide combo*, i(method) j(gold) string
 19.         rename combo* *
 20. 
.         * remember : resistance = postive result
.         rename sS TN
 21.         rename rR TP
 22.         rename sR FN 
 23.         *so predicted sensitive but actually resistant
.         rename rS FP 
 24.         * predicted resistant but actually sensitive
.         gen set="Oxford491"
 25.         append using temp
 26.         save temp, replace
 27. }
(10716 observations deleted)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       clear |      5832     .880487     .324419          0          1
5135 results are R/S
(697 observations deleted)
(note: j = r s)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        4   ->       2
Number of variables                   3   ->       3
j variable (2 values)           predict   ->   (dropped)
xij variables:
                                  _freq   ->   _freqr _freqs
-----------------------------------------------------------------------------
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        2   ->       1
Number of variables                   4   ->       5
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------
(note: variable set was str9, now str10 to accommodate using data's values)
file temp.dta saved
(10716 observations deleted)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       clear |      5832     .880487     .324419          0          1
5135 results are R/S
(697 observations deleted)
(note: j = r s)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        4   ->       2
Number of variables                   3   ->       3
j variable (2 values)           predict   ->   (dropped)
xij variables:
                                  _freq   ->   _freqr _freqs
-----------------------------------------------------------------------------
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        2   ->       1
Number of variables                   4   ->       5
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------
(note: variable method was str6, now str9 to accommodate using data's values)
(note: variable set was str9, now str10 to accommodate using data's values)
file temp.dta saved
(10716 observations deleted)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       clear |      5832     .880487     .324419          0          1
5135 results are R/S
(697 observations deleted)
(note: j = r s)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        4   ->       2
Number of variables                   3   ->       3
j variable (2 values)           predict   ->   (dropped)
xij variables:
                                  _freq   ->   _freqr _freqs
-----------------------------------------------------------------------------
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        2   ->       1
Number of variables                   4   ->       5
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------
(note: variable set was str9, now str10 to accommodate using data's values)
file temp.dta saved

. 
. noi di "Oxford 501"
Oxford 501

.         foreach k in valuetype valuez valuegene{
  2.         use anti_panel_all, clear
  3.         assert site!=""
  4.         assert _N==16548
  5.                 keep if set=="Oxford501"
  6. * restrict to clear goldstandard values
.         gen clear=inlist(gold, "R", "S")
  7.         summ clear
  8.         noi di r(sum) " results are R/S"
  9.         drop if clear!=1
 10.         contract  gold `k'
 11.         rename value predict
 12.         assert predict!=""
 13. * reshape
.         reshape wide _freq, i( gold) j(predict) string
 14.         rename _freq* *
 15.         rename r combor
 16.         rename s combos
 17.         gen method = "`k'"
 18.         reshape wide combo*, i(method) j(gold) string
 19.         rename combo* *
 20. 
.         * remember : resistance = postive result
.         rename sS TN
 21.         rename rR TP
 22.         rename sR FN 
 23.         *so predicted sensitive but actually resistant
.         rename rS FP 
 24.         * predicted resistant but actually sensitive
.         gen set="Oxford501"
 25.         append using temp
 26.         save temp, replace
 27. }
(10536 observations deleted)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       clear |      6012    .8333333     .372709          0          1
5010 results are R/S
(1002 observations deleted)
(note: j = r s)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        4   ->       2
Number of variables                   3   ->       3
j variable (2 values)           predict   ->   (dropped)
xij variables:
                                  _freq   ->   _freqr _freqs
-----------------------------------------------------------------------------
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        2   ->       1
Number of variables                   4   ->       5
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------
(note: variable set was str9, now str10 to accommodate using data's values)
file temp.dta saved
(10536 observations deleted)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       clear |      6012    .8333333     .372709          0          1
5010 results are R/S
(1002 observations deleted)
(note: j = r s)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        4   ->       2
Number of variables                   3   ->       3
j variable (2 values)           predict   ->   (dropped)
xij variables:
                                  _freq   ->   _freqr _freqs
-----------------------------------------------------------------------------
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        2   ->       1
Number of variables                   4   ->       5
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------
(note: variable method was str6, now str9 to accommodate using data's values)
(note: variable set was str9, now str10 to accommodate using data's values)
file temp.dta saved
(10536 observations deleted)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       clear |      6012    .8333333     .372709          0          1
5010 results are R/S
(1002 observations deleted)
(note: j = r s)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        4   ->       2
Number of variables                   3   ->       3
j variable (2 values)           predict   ->   (dropped)
xij variables:
                                  _freq   ->   _freqr _freqs
-----------------------------------------------------------------------------
(note: j = R S)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                        2   ->       1
Number of variables                   4   ->       5
j variable (2 values)      goldstandard   ->   (dropped)
xij variables:
                                 combor   ->   comborR comborS
                                 combos   ->   combosR combosS
-----------------------------------------------------------------------------
(note: variable set was str9, now str10 to accommodate using data's values)
file temp.dta saved

.                 
.         
. * point estimates
.         for any TN TP FN FP: replace X=0 if X==.

->  replace TN=0 if TN==.
(0 real changes made)

->  replace TP=0 if TP==.
(0 real changes made)

->  replace FN=0 if FN==.
(0 real changes made)

->  replace FP=0 if FP==.
(0 real changes made)

. 
.         gen sensitivity = TP/(TP+FN)

.         gen specificity = TN/(TN+FP)

. 
.         gen predictPOS = TP+FP

.         gen predictNEG = TN +FN

. 
.         gen trueNeg= TN +FP

.         gen truePos= TP +FN

. 
.         gen MajorErrorRate = FN/truePos

.         gen VeryMajorErrorRate = FP/trueNeg

.         gen Agreement = (TP+TN)/(trueNeg+truePos)

. 
.         * get confidence intervals
.         for any lsens usens lspec uspec lme ume lvme uvme:gen X=.

->  gen lsens=.
(9 missing values generated)

->  gen usens=.
(9 missing values generated)

->  gen lspec=.
(9 missing values generated)

->  gen uspec=.
(9 missing values generated)

->  gen lme=.
(9 missing values generated)

->  gen ume=.
(9 missing values generated)

->  gen lvme=.
(9 missing values generated)

->  gen uvme=.
(9 missing values generated)

.         local max=_N

.         forvalues i=1(1)`max'{
  2.         if truePos[`i']>0{
  3.         cii  truePos[`i'] TP[`i']
  4.         replace lsens = r(lb) if _n==`i'
  5.         replace usens = r(ub) if _n==`i'
  6.         cii truePos[`i'] FN[`i']
  7.         replace lvme = r(lb) if _n==`i'
  8.         replace uvme = r(ub) if _n==`i'
  9.         }
 10.         else{
 11.         noi di site[`i'] " has no positive samples"
 12.         }
 13.         if trueNeg[`i']>0{
 14.         cii trueNeg[`i'] TN[`i']
 15.         replace lspec = r(lb) if _n==`i'
 16.         replace uspec = r(ub) if _n==`i'
 17.         cii trueNeg[`i'] FP[`i']
 18.         replace lme = r(lb) if _n==`i'
 19.         replace ume = r(ub) if _n==`i'
 20.         }
 21.         else{
 22.         noi di site[`i'] " has no negative samples"
 23.         }
 24.         }

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       1003    .9770688    .0047263        .9657897    .9854094
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       1003    .0229312    .0047263        .0145906    .0342103
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       4007    .9965061    .0009321        .9941448    .9980886
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       4007    .0034939    .0009321        .0019114    .0058552
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       1003    .9780658    .0046248        .9669788    .9862041
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       1003    .0219342    .0046248        .0137959    .0330212
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       4007    .9935114    .0012684         .990507    .9957572
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       4007    .0064886    .0012684        .0042428     .009493
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       1003    .9750748    .0049225        .9634242    .9838062
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       1003    .0249252    .0049225        .0161938    .0365758
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       4007    .9975044    .0007882        .9954152    .9988026
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       4007    .0024956    .0007882        .0011974    .0045848
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        735    .9727891    .0060012        .9582867    .9833014
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        735    .0272109    .0060012        .0166986    .0417133
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       4400    .9913636    .0013949         .988165    .9938814
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       4400    .0086364    .0013949        .0061186     .011835
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        735    .9727891    .0060012        .9582867    .9833014
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        735    .0272109    .0060012        .0166986    .0417133
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       4400    .9911364     .001413        .9879028    .9936897
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       4400    .0088636     .001413        .0063103    .0120972
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        735     .970068    .0062853        .9550319    .9811487
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |        735     .029932    .0062853        .0188513    .0449681
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       4400    .9918182     .001358        .9886907    .9942632
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       4400    .0081818     .001358        .0057368    .0113093
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       1087    .9540018    .0063537         .939804    .9656696
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       1087    .0459982    .0063537        .0343304     .060196
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       3232    .9792698    .0025062        .9737473    .9838992
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       3232    .0207302    .0025062        .0161008    .0262527
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       1087     .949402    .0066478         .934646    .9616585
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       1087     .050598    .0066478        .0383415     .065354
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       3232    .9839109    .0022131        .9789542    .9879611
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       3232    .0160891    .0022131        .0120389    .0210458
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       1087    .9540018    .0063537         .939804    .9656696
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       1087    .0459982    .0063537        .0343304     .060196
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       3232    .9811262    .0023936        .9758211    .9855331
(1 real change made)
(1 real change made)

                                                         -- Binomial Exact --
    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
             |       3232    .0188738    .0023936        .0144669    .0241789
(1 real change made)
(1 real change made)

. 
. * save values for combining for table
. noi list set method sens lsens usens spec lspec uspec

     +------------------------------------------------------------------------------------------+
     |        set      method   sensit~y      lsens      usens   specif~y      lspec      uspec |
     |------------------------------------------------------------------------------------------|
  1. |  Oxford501   valuegene   .9770688   .9657897   .9854094   .9965061   .9941448   .9980886 |
  2. |  Oxford501      valuez   .9780658   .9669788   .9862041   .9935114    .990507   .9957572 |
  3. |  Oxford501   valuetype   .9750748   .9634243   .9838063   .9975044   .9954153   .9988026 |
  4. |  Oxford491   valuegene   .9727891   .9582868   .9833014   .9913636    .988165   .9938813 |
  5. |  Oxford491      valuez   .9727891   .9582868   .9833014   .9911364   .9879028   .9936897 |
     |------------------------------------------------------------------------------------------|
  6. |  Oxford491   valuetype    .970068   .9550319   .9811487   .9918182   .9886907   .9942632 |
  7. | Collindale      valuez   .9540018    .939804   .9656696   .9792698   .9737473   .9838992 |
  8. | Collindale   valuetype    .949402    .934646   .9616585   .9839109   .9789543   .9879612 |
  9. | Collindale   valuegene   .9540018    .939804   .9656696   .9811262   .9758211   .9855331 |
     +------------------------------------------------------------------------------------------+

. 
end of do-file

. noi di "method disagreeing with lab"
method disagreeing with lab

. 
. 
. 
. use anti_panel_all, clear

. 
. append using viru_panel_all, gen(new)
(label _merge already defined)

. 
. 
. 
. 
. 
. 
. 
. 
. 
. * reshape wide

. 
. drop _merge new valueall method

. 
. reshape long value, i (sample site set gold) j(method) string
(note: j = genefinder typewriter zam)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    42749   ->  128247
Number of variables                   7   ->       6
j variable (3 values)                     ->   method
xij variables:
valuegenefinder valuetypewriter valuezam  ->   value
-----------------------------------------------------------------------------

. 
. replace value=upper(value)
(128247 real changes made)

. 
. 
. 
. drop if gold=="NA"
(72270 observations deleted)

. 
. drop if gold=="I"
(240 observations deleted)

. 
. gen match=1 if gold==value
(976 missing values generated)

. 
. replace match=0 if match==.
(976 real changes made)

. 
. tab set method if match!=1, chi

           |              method
       set | genefin..  typewri..        zam |     Total
-----------+---------------------------------+----------
Collindale |       226        215        240 |       681 
 Oxford491 |        58         58         59 |       175 
 Oxford501 |        37         35         48 |       120 
-----------+---------------------------------+----------
     Total |       321        308        347 |       976 

          Pearson chi2(4) =   1.3851   Pr = 0.847

. 
. 
. 
. noi di "total number of sites checked against gold method"
total number of sites checked against gold method

. 
. 
. 
. tab set method

           |              method
       set | genefin..  typewri..        zam |     Total
-----------+---------------------------------+----------
Collindale |     8,434      8,434      8,434 |    25,302 
 Oxford491 |     5,135      5,135      5,135 |    15,405 
 Oxford501 |     5,010      5,010      5,010 |    15,030 
-----------+---------------------------------+----------
     Total |    18,579     18,579     18,579 |    55,737 


. do "C:\Users\am2609\AppData\Local\Temp\STD02000000.tmp"

. ************************************************
. * COMMENTS_WORK.DO 
. ************************************************
. 
. *Additional tables etc as requested in feedback
. 
. *Inputs: 
. * Outputs :  
. 
. * Written by: Amy Mason
. 
. ***************************************************************************
. * 
. ****************************************************************************
. set li 130

. 
. cap log close
