----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\users\amy.mason\Pipeline_27_07_2016\Datasets\clean.log
  log type:  text
 opened on:   3 Nov 2016, 15:36:44

. 
. noi di "Run by AMM on $S_DATE $S_TIME"
Run by AMM on  3 Nov 2016 15:36:44

. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\Datasets
E:\users\amy.mason\Pipeline_27_07_2016\Datasets

. 
. 
. 
. noi di _n(5) _dup(80) "=" _n " 1 Combine all predictive sets" _n _dup(80) "="





================================================================================
 1 Combine all predictive sets
================================================================================

. 
. 
. 
. 
. 
. ****** combine the 3 sets

. 
. noi di "combine"
combine

. 
. use pipeline_data_gf, clear

. 
. append using pipeline_data_tw.dta, force
(note: variable comments was str7, now str68 to accommodate using data's values)
(note: variable value was str27, now str34 to accommodate using data's values)

. 
. append using pipeline_data_z2.dta, force
(note: variable value was str34, now str46 to accommodate using data's values)

. 
. gsort sample - set

. 
. by sample: replace set=set[_n-1] if _n>1 & set==""
(120,843 real changes made)

. 
. by sample: assert set==set[_n-1] if _n>1

. 
. replace site = lower(site)
(288,654 real changes made)

. 
. noi di _N " results"
395178 results

. 
. bysort site: gen tab=1 if _n==1
(395,069 missing values generated)

. 
. summ tab 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         tab |        109           1           0          1          1

. 
. noi di "on " r(sum) " sites"
on 109 sites

. 
. tab site

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
      aac6aph2 |      4,207        1.06        1.06
    aaddaph4ia |      4,207        1.06        2.13
    aadeant6ia |      4,207        1.06        3.19
          acrb |      4,207        1.06        4.26
          acrc |      4,207        1.06        5.32
          acrd |      4,207        1.06        6.39
allelicprofile |      1,389        0.35        6.74
    ant9_iaspc |      4,207        1.06        7.80
    ant9_ibspc |      4,207        1.06        8.87
        aph2ic |      4,207        1.06        9.93
  apha3aph3iii |      4,207        1.06       11.00
            ar |      1,429        0.36       11.36
          arca |      4,207        1.06       12.42
          blaz |      4,207        1.06       13.49
           cat |      4,207        1.06       14.55
          ccra |      1,429        0.36       14.91
        ccra_1 |      2,778        0.70       15.62
        ccra_2 |      2,778        0.70       16.32
        ccra_3 |      2,778        0.70       17.02
        ccra_4 |      2,778        0.70       17.73
          ccrb |      1,429        0.36       18.09
        ccrb_1 |      2,778        0.70       18.79
        ccrb_2 |      2,778        0.70       19.49
        ccrb_3 |      2,778        0.70       20.20
        ccrb_4 |      2,778        0.70       20.90
        ccrb_6 |      2,778        0.70       21.60
        ccrc_a |      4,207        1.06       22.67
        ccrc_b |      4,207        1.06       23.73
        ccrc_c |      4,207        1.06       24.80
           cfr |      4,207        1.06       25.86
           chp |      4,207        1.06       26.93
         dfr_a |      4,207        1.06       27.99
         dfr_c |      4,207        1.06       29.05
         dfr_d |      4,207        1.06       30.12
         dfr_g |      4,207        1.06       31.18
         dfr_k |      4,207        1.06       32.25
          dfrb |      4,207        1.06       33.31
          erma |      1,429        0.36       33.67
        erma_1 |      2,778        0.70       34.38
        erma_2 |      2,778        0.70       35.08
          ermb |      4,207        1.06       36.15
          ermc |      4,207        1.06       37.21
          ermt |      4,207        1.06       38.27
          ermy |      4,207        1.06       39.34
           eta |      4,207        1.06       40.40
           etb |      4,207        1.06       41.47
           etd |      4,207        1.06       42.53
         fus_b |      4,207        1.06       43.60
         fus_c |      4,207        1.06       44.66
          fusa |      4,207        1.06       45.73
          grla |      4,207        1.06       46.79
          gyra |      4,207        1.06       47.86
         ile_s |        491        0.12       47.98
          iles |      2,287        0.58       48.56
          isab |      4,207        1.06       49.62
         lnu_a |      4,207        1.06       50.69
         lnu_b |      4,207        1.06       51.75
           luk |      1,429        0.36       52.11
          lukm |      4,207        1.06       53.18
         lukmf |      4,207        1.06       54.24
        lukpvf |      4,207        1.06       55.31
        lukpvs |      4,207        1.06       56.37
          meca |      4,207        1.06       57.44
          mecc |      4,207        1.06       58.50
          mlst |      1,389        0.35       58.85
          mphc |      4,207        1.06       59.92
          msra |      4,207        1.06       60.98
          mupa |      4,207        1.06       62.05
          mupb |      4,207        1.06       63.11
         qac_a |      4,207        1.06       64.18
         qac_b |      4,207        1.06       65.24
      qac_csmr |      4,207        1.06       66.31
          rpob |      4,207        1.06       67.37
           sak |      4,207        1.06       68.43
          sasx |      4,207        1.06       69.50
          sat4 |      4,207        1.06       70.56
           scn |      4,207        1.06       71.63
           sea |      1,429        0.36       71.99
         sea_1 |      2,778        0.70       72.69
         sea_2 |      2,778        0.70       73.40
           seb |      4,207        1.06       74.46
           sec |      4,207        1.06       75.52
           sed |      4,207        1.06       76.59
           see |      4,207        1.06       77.65
           seg |      4,207        1.06       78.72
           seh |      1,429        0.36       79.08
         seh_1 |      2,778        0.70       79.78
         seh_2 |      2,778        0.70       80.49
           sei |      4,207        1.06       81.55
           sej |      4,207        1.06       82.62
          selr |      4,207        1.06       83.68
           sep |      4,207        1.06       84.74
           seu |      1,429        0.36       85.11
         seu_1 |      2,778        0.70       85.81
         seu_2 |      2,778        0.70       86.51
            st |      1,389        0.35       86.86
           str |      4,207        1.06       87.93
          tetk |      4,207        1.06       88.99
          tetl |      4,207        1.06       90.06
          tetm |      4,207        1.06       91.12
          teto |      4,207        1.06       92.19
         tsst1 |      4,207        1.06       93.25
         van_a |      4,207        1.06       94.32
         van_b |      4,207        1.06       95.38
         van_c |      4,207        1.06       96.44
          vgaa |      4,207        1.06       97.51
        vgaalc |      1,429        0.36       97.87
          vgab |      4,207        1.06       98.94
          vgba |      4,207        1.06      100.00
---------------+-----------------------------------
         Total |    395,178      100.00

. 
. drop tab

. 
. bysort sample: gen tab=1 if _n==1
(393,749 missing values generated)

. 
. summ tab

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         tab |      1,429           1           0          1          1

. 
. noi di "from " r(sum) " samples"
from 1429 samples

. 
. tab set if tab==1, m

        set |      Freq.     Percent        Cum.
------------+-----------------------------------
            |         40        2.80        2.80
 Collindale |        397       27.78       30.58
  Oxford491 |        491       34.36       64.94
  Oxford501 |        501       35.06      100.00
------------+-----------------------------------
      Total |      1,429      100.00

. 
. drop tab

. 
. 
. 
. save pipeline_predict_raw, replace
file pipeline_predict_raw.dta saved

. 
. 
. 
. ***********************************************************

. 
. * 1) Remove samples that are contaminated for all methods

. 
. *********************************************************

. 
. use pipeline_predict_raw, clear

. 
. 
. 
. noi di _n(5) _dup(80) "=" _n " 1 Remove samples that were contaminated for all methods" _n _dup(80) "="





================================================================================
 1 Remove samples that were contaminated for all methods
================================================================================

. 
. 
. 
. use pipeline_predict_raw, clear

. 
. preserve
already preserved
r(621);

. 
. reshape wide value  comment, i(set sample site) j(method) string
(note: j = genefinder typewriter zam)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   395178   ->  153983
Number of variables                   6   ->       9
j variable (3 values)            method   ->   (dropped)
xij variables:
                                  value   ->   valuegenefinder valuetypewriter valuezam
                               comments   ->   commentsgenefinder commentstypewriter commentszam
-----------------------------------------------------------------------------

. 
. noi display _N " sample sites"
153983 sample sites

. 
. restore

. 
. gen contam=.
(351,645 missing values generated)

. 
. replace contam=1 if inlist(sample,"C00012813", "C00001215", "C00001249", "C00012746", "C00012791")
(0 real changes made)

. 
. replace contam=1 if inlist(sample,"H113120068-138-1","H121000461-388-2","H131100031-408-2","H111840168-459-2","H111200061-196-2"
> )
(0 real changes made)

. 
. preserve

. 
. keep if contam==1
(351,645 observations deleted)

. 
. reshape wide value  comment, i(set sample site) j(method) string
variable comment not found
r(111);

. 
. * count

. 
. bysort sample: gen count=1 if _n==1

. 
. summ contam if count==1
count not found
r(111);

. 
. noi di r(sum) " samples contaminated"
. samples contaminated

. 
. 
. 
. keep sample set site value* comment* 
variable comment* not found
r(111);

. 
. compress

. 
. sort sample site

. 
. order sample site value* comment*
variable comment* not found
r(111);

. 
. 
. 
. noi save problem_samples, replace
(note: dataset contains 0 observations)
file problem_samples.dta saved

. 
. 
. 
. 
. 
. restore

. 
. summ contam

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      contam |          0

. 
. noi di r(sum) " values for contaminated samples dropped from study"
0 values for contaminated samples dropped from study

. 
. noi drop if contam==1
(0 observations deleted)

. 
. drop contam

. 
. compress
  variable site was str14 now str12
  (703,290 bytes saved)

. 
. save pipeline_noncontam, replace
file pipeline_noncontam.dta saved

. 
. *****************************************************

. 
. * clean site names

. 
. ******************************************************

. 
. use pipeline_noncontam, clear

. 
. noi di _n(5) _dup(80) "=" _n "consolidate names/ spelling errors for various sites" _n _dup(80) "=" 





================================================================================
consolidate names/ spelling errors for various sites
================================================================================

. 
. 
. 
. **** match up things I think are the same but with slightly different names

. 
. replace site = "ant9ib" if site=="ant9_ibspc"
(0 real changes made)

. 
. replace site = "ant9ia" if site=="ant9_iaspc"
(0 real changes made)

. 
. replace site= "aac6aph2" if strpos(site, "aac")
(0 real changes made)

. 
. 
. 
. replace site = subinstr(site, "acr", "arc",.) if strpos(site, "acr")
(0 real changes made)

. 
. replace site = "mlst" if site=="st"
(0 real changes made)

. 
. replace site = "ccrca"  if site == "ccrc_a"
(0 real changes made)

. 
. replace site = "ccrcb"  if site == "ccrc_b"
(0 real changes made)

. 
. replace site = "ccrcc"  if site == "ccrc_c"
(0 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "dfr")
(0 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "fus")
(0 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "ile")
(0 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "lnu")
(0 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "qac")
(0 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "van")
(0 real changes made)

. 
. 
. 
. 
. 
. compress
  (0 bytes saved)

. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. 
. 
. 
. 
. * some sites split into numbers variants; remerge

. 
. 
. 
. noi di "combining numbered variants into single sites"
combining numbered variants into single sites

. 
. 
. 
. use temp, clear

. 
. 
. 
. drop comments 
variable comments not found
r(111);

. 
. keep if strpos(site, "erma") | strpos(site,"ccr") | strpos(site, "se")
(277,179 observations deleted)

. 
. drop if inlist(site, "ccrcb", "ccrca", "ccrcc", "seb", "sec", "sed")
(24,822 observations deleted)

. 
. reshape wide value, i(set sample method) j(site) string
(note: j = ccra ccrb erma sea see seg seh sei sej selr sep seu)
variable type not constant within set sample method
variable value2 not constant within set sample method
    Your data are currently long.  You are performing a reshape wide.  You typed something like

        . reshape wide a b, i(set sample method) j(site)

    There are variables other than a, b, set sample method, site in your data.  They must be constant within set sample method
    because that is the only way they can fit into wide data without loss of information.

    The variable or variables listed above are not constant within set sample method.  Perhaps the values are in error.  Type
    reshape error for a list of the problem observations.

    Either that, or the values vary because they should vary, in which case you must either add the variables to the list of xij
    variables to be reshaped, or drop them.
r(9);

. 
. 
. 
. *erma

. 
. replace valueerma="A" if valueerma_1=="A" & valueerma_2=="A" &valueerma==""
variable valueerma not found
r(111);

. 
. replace valueerma="P" if (valueerma_1=="P" | valueerma_2=="P" ) & valueerma==""
variable valueerma not found
r(111);

. 
. assert valueerma!=""
valueerma not found
r(111);

. 
. drop valueerma_1 valueerma_2
variable valueerma_1 not found
r(111);

. 
. 
. 
. *ccra

. 
. replace valueccra="A" if valueccra=="" & valueccra_1=="A" & valueccra_2=="A" & valueccra_3=="A" & valueccra_4=="A"
variable valueccra not found
r(111);

. 
. replace valueccra="P" if valueccra=="" & (valueccra_1=="P"|  valueccra_2=="P"| valueccra_3=="P"| valueccra_4=="P")
variable valueccra not found
r(111);

. 
. assert valueccra!=""
valueccra not found
r(111);

. 
. drop valueccra_*
variable valueccra_* not found
r(111);

. 
. 
. 
. * ccrb

. 
. replace valueccrb="A" if valueccrb=="" & valueccrb_1=="A" & valueccrb_2=="A" & valueccrb_3=="A" & valueccrb_4=="A" & valueccrb_6
> =="A" 
variable valueccrb not found
r(111);

. 
. replace valueccrb="P" if valueccrb=="" & (valueccrb_1=="P" | valueccrb_2=="P"|valueccrb_3=="P"|valueccrb_4=="P"|valueccrb_6=="P"
>  )
variable valueccrb not found
r(111);

. 
. * two values blank  - C00011656 & C00011655

. 
. assert valueccrb!="" if !strpos(sample, "C0001165")
valueccrb not found
r(111);

. 
. drop valueccrb_*
variable valueccrb_* not found
r(111);

. 
. 
. 
. * sea

. 
. replace valuesea="A" if valuesea_1=="A" & valuesea_2=="A"  & valuesea=="" 
variable valuesea not found
r(111);

. 
. replace valuesea="P" if valuesea_1=="P" | valuesea_2=="P"  & valuesea=="" 
variable valuesea not found
r(111);

. 
. * two values blank  - C00011656 & C00011655

. 
. assert valuesea!=""  if !strpos(sample, "C0001165")
valuesea not found
r(111);

. 
. drop valuesea_*
variable valuesea_* not found
r(111);

. 
. 
. 
. *seh

. 
. replace valueseh="A" if valueseh_1=="A" & valueseh_2=="A"  & valueseh=="" 
variable valueseh not found
r(111);

. 
. replace valueseh="P" if valueseh_1=="P" | valueseh_2=="P"  & valueseh=="" 
variable valueseh not found
r(111);

. 
. * two values blank  - C00011656 & C00011655

. 
. assert valueseh!=""  if !strpos(sample, "C0001165")
valueseh not found
r(111);

. 
. drop valueseh_*
variable valueseh_* not found
r(111);

. 
. 
. 
. *seu

. 
. replace valueseu="A" if valueseu_1=="A" & valueseu_2=="A" &  valueseu=="" 
variable valueseu not found
r(111);

. 
. replace valueseu="P" if valueseu_1=="P" | valueseu_2=="P"  & valueseu=="" 
variable valueseu not found
r(111);

. 
. * two values blank  - C00011656 & C00011655

. 
. assert valueseu!=""  if !strpos(sample, "C0001165")
valueseu not found
r(111);

. 
. drop valueseu_*
variable valueseu_* not found
r(111);

. 
. 
. 
. reshape long
(already long)

. 
. rename value cleanvalue

. 
. 
. 
. merge 1:1 set sample method site using temp, update

    Result                           # of obs.
    -----------------------------------------
    not matched                       302,001
        from master                         0  (_merge==1)
        from using                    302,001  (_merge==2)

    matched                            49,644
        not updated                    49,644  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. assert _merge!=4

. 
. assert _merge!=5

. 
. noi assert value == cleanvalue if _merge==3

. 
. noi tab site if _merge ==1
no observations

. 
. replace value = cleanvalue if value==""
(0 real changes made)

. 
. noi tab site if strpos(site, "_")
no observations

. 
. drop if strpos(site, "_")
(0 observations deleted)

. 
. noi tab site if _merge==2 

        site |      Freq.     Percent        Cum.
-------------+-----------------------------------
    aac6aph2 |      4,137        1.37        1.37
  aaddaph4ia |      4,137        1.37        2.74
  aadeant6ia |      4,137        1.37        4.11
      ant9ia |      4,137        1.37        5.48
      ant9ib |      4,137        1.37        6.85
      aph2ic |      4,137        1.37        8.22
apha3aph3iii |      4,137        1.37        9.59
        arca |      4,137        1.37       10.96
        arcb |      4,137        1.37       12.33
        arcc |      4,137        1.37       13.70
        arcd |      4,137        1.37       15.07
        blaz |      4,137        1.37       16.44
         cat |      4,137        1.37       17.81
       ccrca |      4,137        1.37       19.18
       ccrcb |      4,137        1.37       20.55
       ccrcc |      4,137        1.37       21.92
         cfr |      4,137        1.37       23.29
         chp |      4,137        1.37       24.66
        dfra |      4,137        1.37       26.03
        dfrb |      4,137        1.37       27.40
        dfrc |      4,137        1.37       28.77
        dfrd |      4,137        1.37       30.14
        dfrg |      4,137        1.37       31.51
        dfrk |      4,137        1.37       32.88
        ermb |      4,137        1.37       34.25
        ermc |      4,137        1.37       35.62
        ermt |      4,137        1.37       36.99
        ermy |      4,137        1.37       38.36
         eta |      4,137        1.37       39.73
         etb |      4,137        1.37       41.10
         etd |      4,137        1.37       42.47
        fusa |      4,137        1.37       43.84
        fusb |      4,137        1.37       45.21
        fusc |      4,137        1.37       46.58
        grla |      4,137        1.37       47.95
        gyra |      4,137        1.37       49.32
        iles |      4,137        1.37       50.68
        isab |      4,137        1.37       52.05
        lnua |      4,137        1.37       53.42
        lnub |      4,137        1.37       54.79
        lukm |      4,137        1.37       56.16
       lukmf |      4,137        1.37       57.53
      lukpvf |      4,137        1.37       58.90
      lukpvs |      4,137        1.37       60.27
        meca |      4,137        1.37       61.64
        mecc |      4,137        1.37       63.01
        mphc |      4,137        1.37       64.38
        msra |      4,137        1.37       65.75
        mupa |      4,137        1.37       67.12
        mupb |      4,137        1.37       68.49
        qaca |      4,137        1.37       69.86
        qacb |      4,137        1.37       71.23
     qaccsmr |      4,137        1.37       72.60
        rpob |      4,137        1.37       73.97
         sak |      4,137        1.37       75.34
        sasx |      4,137        1.37       76.71
        sat4 |      4,137        1.37       78.08
         scn |      4,137        1.37       79.45
         seb |      4,137        1.37       80.82
         sec |      4,137        1.37       82.19
         sed |      4,137        1.37       83.56
         str |      4,137        1.37       84.93
        tetk |      4,137        1.37       86.30
        tetl |      4,137        1.37       87.67
        tetm |      4,137        1.37       89.04
        teto |      4,137        1.37       90.41
       tsst1 |      4,137        1.37       91.78
        vana |      4,137        1.37       93.15
        vanb |      4,137        1.37       94.52
        vanc |      4,137        1.37       95.89
        vgaa |      4,137        1.37       97.26
        vgab |      4,137        1.37       98.63
        vgba |      4,137        1.37      100.00
-------------+-----------------------------------
       Total |    302,001      100.00

. 
. drop _merge cleanvalue comment
variable comment not found
r(111);

. 
.  
. 
. 
. 
. reshape wide value , i(sample site) j(method) string
cannot reshape data containing variable _merge
    Either drop or rename variable _merge.
r(110);

. 
. noi display _N " sample sites"
351645 sample sites

. 
. bysort sample: gen count1=1 if _n==1
(350,266 missing values generated)

. 
. summ count1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count1 |      1,379           1           0          1          1

. 
. noi di r(sum) " samples"
1379 samples

. 
. bysort site: gen count2=1 if _n==1
(351,560 missing values generated)

. 
. summ count2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count2 |         85           1           0          1          1

. 
. noi di r(sum) " sites"
85 sites

. 
. drop count*

. 
. 
. 
. save temp2, replace
file temp2.dta saved

. 
. 
. 
. 
. 
. **************************************************

. 
. * SITE TYPES

. 
. ***************************************************

. 
. use temp2, clear

. 
. 
. 
. gen type = "mlst"  if inlist(site, "mlst")
variable type already defined
r(110);

. 
. 
. 
. replace type = "virulence" if inlist(site, "arca","arcb", "arcc", "arcd", "sasx")
(0 real changes made)

. 
. replace type = "virulence" if inlist(site, "sea", "sea1", "sea2", "seb", "sec", "sed" )
(0 real changes made)

. 
. replace type = "virulence" if inlist(site, "seh2", "sei", "sej", "selr", "sep","seu", "seu1", "seu2")
(0 real changes made)

. 
. replace type = "virulence" if inlist(site, "eta", "etb", "etd", "chp", "sak", "scn", "lukpvf" )
(0 real changes made)

. 
. replace type = "virulence" if inlist(site, "luk", "lukm", "lukmf", "lukpvs", "tsst1")
(0 real changes made)

. 
. replace type = "virulence" if inlist(site, "see", "seg", "seh", "seh1" )
(0 real changes made)

. 
. 
. 
. 
. 
. replace type = "ccr" if strpos(site, "ccr")==1
(0 real changes made)

. 
. 
. 
. replace type = "Chromosomal Resistance" if inlist(site, "iles", "gyra", "grla", "dfrb", "fusa", "rpob")
(0 real changes made)

. 
. 
. 
. 
. 
. replace type = "Aquired Resistance"  if inlist(site, "blaz", "meca", "mecc", "aac6aph2" )
(0 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site,"aaddaph4ia","aadeant6ia", "ant9ia", "ant9ib","aph2ic", "apha3aph3iii" )
(0 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site, "str", "fusb", "fusc", "vana", "vanb", "vanc")
(0 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site,"lnua", "lnub", "isab", "vgaa", "vgab", "vgba","erma1", "erma2", "erma")
(0 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site, "ermb", "ermc", "ermy", "ermt", "msra", "mphc", "mupa", "mupb")
(0 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site, "sat4", "tetk", "tetl", "tetm", "teto", "dfra", "dfrc", "dfrd")
(0 real changes made)

. 
. replace type = "Aquired Resistance"  if inlist(site, "dfrg", "dfrk", "cfr", "cat", "qaca", "qacb", "qaccsmr")
(0 real changes made)

. 
. 
. 
. 
. 
. 
. 
. * Summary 

. 
. noi display _N " sample sites"
351645 sample sites

. 
. noi tab type

                  type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Aquired Resistance |    190,302       54.12       54.12
Chromosomal Resistance |     24,822        7.06       61.18
                   ccr |     20,685        5.88       67.06
             virulence |    115,836       32.94      100.00
-----------------------+-----------------------------------
                 Total |    351,645      100.00

. 
. bysort sample: gen count1=1 if _n==1
(350,266 missing values generated)

. 
. summ count1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count1 |      1,379           1           0          1          1

. 
. noi di r(sum) " samples"
1379 samples

. 
. bysort site: gen count2=1 if _n==1
(351,560 missing values generated)

. 
. summ count2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count2 |         85           1           0          1          1

. 
. noi di r(sum) " sites"
85 sites

. 
. noi tab type if count2==1, m

                  type |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Aquired Resistance |         46       54.12       54.12
Chromosomal Resistance |          6        7.06       61.18
                   ccr |          5        5.88       67.06
             virulence |         28       32.94      100.00
-----------------------+-----------------------------------
                 Total |         85      100.00

. 
. noi tab site if type==""
no observations

. 
. drop count*

. 
. 
. 
. save temp3, replace
file temp3.dta saved

. 
. 
. 
. 
. 
. **********************

. 
. *2) LOOK AT MISSING DATA BETWEEN METHODS

. 
. ****************************************************

. 
. noi di _n(5) _dup(80) "=" _n " 2 Missing data between methods" _n _dup(80) "="





================================================================================
 2 Missing data between methods
================================================================================

. 
. 
. 
. * how many values are missing

. 
. use temp3, clear

. 
. 
. 
. * create absence markers

. 
. gen  zbyte=( valuezam!="")
valuezam not found
r(111);

. 
. gen  tbyte=( valuetypewriter !="")
valuetypewriter not found
r(111);

. 
. gen  gbyte=( valuegenefinder   !="")
valuegenefinder not found
r(111);

. 
. gen new= string( tbyte ) + string(zbyte) + string(gbyte)
tbyte not found
r(111);

. 
. replace new ="Phenotype" if type=="Phenotype"
variable new not found
r(111);

. 
. noi di "sample-sites missing values - key (typewriter mykrobe genefinder)"
sample-sites missing values - key (typewriter mykrobe genefinder)

. 
. table new
variable new not found
r(111);

. 
. 
. 
. 
. 
. *000

. 
. summ zbyte if new=="000"
variable zbyte not found
r(111);

. 
. noi di r(N) " not called by any method; people missing from T/G and called blank by mycrobe - see 010 bonus people below"
0 not called by any method; people missing from T/G and called blank by mycrobe - see 010 bonus people below

. 
. 
. 
. 
. 
. *010

. 
. summ zbyte if new== "010"
variable zbyte not found
r(111);

. 
. noi di r(N) " Called only by mykrobe"
0 Called only by mykrobe

. 
. * vgaalc

. 
. noi tab site new if inlist(site, "vgaalc"), m
variable new not found
r(111);

. 
. summ zbyte if inlist(site, "vgaalc")
variable zbyte not found
r(111);

. 
. noi di r(N) " vgaalc only supplied by mykrobe, drop from database"
. vgaalc only supplied by mykrobe, drop from database

. 
. noi drop if inlist(site, "vgaalc")
(0 observations deleted)

. 
. noi di _N " sample sites remaining" 
351645 sample sites remaining

. 
. * luk

. 
. noi tab site new if strpos(site, "luk"), m
variable new not found
r(111);

. 
. summ zbyte if inlist(site, "luk")
variable zbyte not found
r(111);

. 
. noi di r(N) " luk only supplied by mykrobe, drop from database"
. luk only supplied by mykrobe, drop from database

. 
. noi drop if inlist(site, "luk")
(0 observations deleted)

. 
. noi di _N " sample sites remaining" 
351645 sample sites remaining

. 
. * ar

. 
. noi tab site new if strpos(site, "ar"), m
variable new not found
r(111);

. 
. summ zbyte if inlist(site, "ar")
variable zbyte not found
r(111);

. 
. noi di r(N) "ar only supplied by mykrobe, drop from database"
.ar only supplied by mykrobe, drop from database

. 
. noi drop if inlist(site, "ar")
(0 observations deleted)

. 
. noi di _N " sample sites remaining" 
351645 sample sites remaining

. 
. 
. 
. 
. 
. * samples not in other sets

. 
. vallist sample if new=="010", local(list)
new not found
r(111);

. 
. noi tab sample new if strpos("`list'", sample)
variable new not found
r(111);

. 
. bysort sample: gen count =1 if _n==1
(350,266 missing values generated)

. 
. summ zbyte if strpos("`list'", sample) & count==1
variable zbyte not found
r(111);

. 
. noi di r(N) " samples are only processed by mykrobe - drop from comparision set"
. samples are only processed by mykrobe - drop from comparision set

. 
. summ zbyte if strpos("`list'", sample) 
variable zbyte not found
r(111);

. 
. noi di r(N) " sample sites affected"
. sample sites affected

. 
. drop if strpos("`list'", sample)
(0 observations deleted)

. 
. drop count 

. 
. 
. 
. *001

. 
. summ gbyte if new =="001"
variable gbyte not found
r(111);

. 
. noi di r(N) "Called only by genefinder"
.Called only by genefinder

. 
. noi di "sites in sample-sites only supplied by genefinder"
sites in sample-sites only supplied by genefinder

. 
. noi tab site if new =="001"
new not found
r(111);

. 
. * allelicprofile - drop

. 
. noi tab site new if inlist(site, "allelicprofile"), m
variable new not found
r(111);

. 
. summ zbyte if inlist(site, "allelicprofile")
variable zbyte not found
r(111);

. 
. noi di r(N) " allelicprofile only supplied by genefinder, drop from database"
. allelicprofile only supplied by genefinder, drop from database

. 
. noi drop if inlist(site, "allelicprofile")
(0 observations deleted)

. 
. noi di _N " sample sites remaining" 
351645 sample sites remaining

. 
. assert new!="001"
new not found
r(111);

. 
. 
. 
. 
. 
. 
. 
. * 101

. 
. summ zbyte if new =="101"
variable zbyte not found
r(111);

. 
. noi di r(N) " no value in mykrobe, eg fusa"
. no value in mykrobe, eg fusa

. 
. noi tab site if new=="101"
new not found
r(111);

. 
. noi tab valuezam if site=="fusa"
variable valuezam not found
r(111);

. 
. noi tab valuegenefinder valuetypewriter if site=="fusa" & valuezam==""
variable valuegenefinder not found
r(111);

. 
. noi di " problem is that mykrobe is not reporting absence of mutation as other than blank"
 problem is that mykrobe is not reporting absence of mutation as other than blank

. 
. vallist site if new=="101" & site!="mlst", local(list)
new not found
r(111);

. 
. summ zbyte if strpos("`list'", site) & valuezam==""
variable zbyte not found
r(111);

. 
. noi di "solution: replace " r(N) " blanks in these sites in mykroke with wt -  not mlst which is not a mutation site"
solution: replace . blanks in these sites in mykroke with wt -  not mlst which is not a mutation site

. 
. noi replace valuezam="wt" if  strpos("`list'", site) & valuezam==""
variable valuezam not found
r(111);

. 
. 
. 
. * regen new

. 
. drop new
variable new not found
r(111);

. 
. drop *byte
variable *byte not found
r(111);

. 
. gen  zbyte=( valuezam!="")
valuezam not found
r(111);

. 
. gen  tbyte=( valuetypewriter !="")
valuetypewriter not found
r(111);

. 
. gen  gbyte=( valuegenefinder   !="")
valuegenefinder not found
r(111);

. 
. gen new= string( tbyte ) + string(zbyte) + string(gbyte)
tbyte not found
r(111);

. 
. noi tab new
variable new not found
r(111);

. 
. * mslt

. 
. noi assert site=="mlst" if new=="101" 
new not found
r(111);

. 
. assert new =="111" if (type!="Phenotype" & site!="mlst")
new not found
r(111);

. 
. noi di "all remaining sample sites are either complete accross all three methods or mlst (mykrobe absent)"
all remaining sample sites are either complete accross all three methods or mlst (mykrobe absent)

. 
. 
. 
. * save mlst results and drop

. 
. preserve

. 
. keep if site =="mlst"
(351,645 observations deleted)

. 
. gen ident =  strpos(valuetypewriter, valuegene) >0
valuegene not found
r(111);

. 
. replace ident = 1 if valueg=="Novel" & valuet=="NF"
variable ident not found
r(111);

. 
. summ ident 
variable ident not found
r(111);

. 
. noi di "mlst agreement between typewriter and genefinder in " r(sum) " cases out of " r(N)
mlst agreement between typewriter and genefinder in . cases out of .

. 
. noi di "value missing for all mykrobe"
value missing for all mykrobe

. 
. noi di "rest"
rest

. 
. noi tab valueg valuet if ident==0
variable valueg not found
r(111);

. 
. keep sample valueg valuet ident
variable valueg not found
r(111);

. 
. save mlst, replace
(note: dataset contains 0 observations)
file mlst.dta saved

. 
. restore

. 
. gen marker =1 if site=="mlst"
(351,645 missing values generated)

. 
. summ marker

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      marker |          0

. 
. noi di "dropping " r(sum) " mlst sites"
dropping 0 mlst sites

. 
. noi drop if marker==1
(0 observations deleted)

. 
. drop marker

. 
. 
. 
. 
. 
. * count how many sample sites left

. 
. 
. 
. noi display _N " sample sites"
351645 sample sites

. 
. bysort sample: gen count1=1 if _n==1
(350,266 missing values generated)

. 
. summ count1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count1 |      1,379           1           0          1          1

. 
. noi di r(sum) " samples"
1379 samples

. 
. bysort site: gen count2=1 if _n==1
(351,560 missing values generated)

. 
. summ count2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count2 |         85           1           0          1          1

. 
. noi di r(sum) " sites"
85 sites

. 
. bysort site: gen count3=1 if _n==1 & site!="mlst" & type!="Phenotype"
(351,560 missing values generated)

. 
. summ count3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      count3 |         85           1           0          1          1

. 
. noi di r(sum) " sites not including Phenotype results and mlst"
85 sites not including Phenotype results and mlst

. 
. drop count* new *byte
variable new not found
r(111);

. 
. 
. 
. 
. 
.  
. 
. save temp4, replace
file temp4.dta saved

. 
. *************************************

. 
. 
. 
. * then add which go with which antibiotic (based on new sheet by clare)

. 
. **********************************************************

. 
. 
. 
. noi di _n(5) _dup(80) "=" _n " 4 Match to antibiotic prediction" _n _dup(80) "="





================================================================================
 4 Match to antibiotic prediction
================================================================================

. 
. 
. 
. 
. 
. *clean up non binary values

. 
. use temp4, clear

. 
. reshape long
(already long)

. 
. 
. 
. 
. 
.  noi di "missing values"
missing values

. 
. replace value = upper(value)
(0 real changes made)

. 
. gen ambi = 1 if inlist(value, "ND", "NT", "LOW COV", "MIXED")
(351,645 missing values generated)

. 
. replace ambi=1 if inlist(value, "NOT DONE", "N/A", "NF", "NA", "-", "X")
(0 real changes made)

. 
. summ ambi if ambi ==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        ambi |          0

. 
. noi di r(N) " values have N/A or equivalent values, set these all to A"
0 values have N/A or equivalent values, set these all to A

. 
. noi list site value if ambi==1

. 
. noi replace value = "A" if ambi==1
(0 real changes made)

. 
. tab site if ambi ==1
no observations

. 
. drop ambi

. 
. 
. 
. noi di "all values equal A or P, unless chromosonal"
all values equal A or P, unless chromosonal

. 
. replace value=upper(value)
(0 real changes made)

. 
. 
. 
. assert inlist(value, "A", "P") if !strpos(type, "Chro")

. 
. 
. 
. ***************

. 
. gen count = 1 if strpos(value, "=>")
(351,645 missing values generated)

. 
. summ count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |          0

. 
. noi di r(N) " replace => with - to create uniform recording of mutations"
0 replace => with - to create uniform recording of mutations

. 
. noi replace value = subinstr(value, "=>", "-",.)
(0 real changes made)

. 
. drop count 

. 
. 
. 
. 
. 
. gen count = 1 if strpos(value," ")
(351,645 missing values generated)

. 
. summ count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |          0

. 
. noi di r(N) " remove all spaces in value reports"
0 remove all spaces in value reports

. 
. noi replace value = subinstr(value, " ", "",.)
(0 real changes made)

. 
. drop count 

. 
. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. 
. run clean_predict.do
